function App(props) {
  const [attempts, setAttempts] = React.useState([]);
  const [feedback, setFeedback] = React.useState([]);
  const [result, setResult] = React.useState(null);
  const [cursor, setCursor] = React.useState({ 
    attempt: 0, 
    letter: 0
  });
  const [stats, setStats] = React.useState({ 
    games: 0, 
    won: 0,
    streak: 0,
    maxStreak: 0,
    attempts: {
      1: 0,
      2: 0,
      3: 0,
      4: 0,
      5: 0,
      6: 0
    }
  });
  const [averageStats, setAverageStats] = React.useState({
    issue: 0,
    gamesPercentile: 0, 
    wonPercentile: 0,
    maxStreakPercentile: 0,
    maxStreakLeaderboard: [
      {
        uid: "uid",
        pos: 1,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 2,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 3,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 4,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 5,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 6,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 7,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 8,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 9,
        maxStreak: 0
      },
      {
        uid: "uid",
        pos: 10,
        maxStreak: 0
      }
    ],
    attempts: {
      1: 0,
      2: 0,
      3: 0,
      4: 0,
      5: 0,
      6: 0
    }
  });
  const [settings, setSettings] = React.useState({ 
    darkTheme: false, 
    colorBlind: false
  });
  const [modal, setModal] = React.useState(null);
  const [timeLeft, setTimeLeft] = React.useState({
    "h": 0, 
    "m": 0, 
    "s": 0
  });
  const [wrongAttempt, setWrongAttempt] = React.useState(false);
  const [UID, setUID] = React.useState(null);

  var timer;
  
  // Load from local storage if still valid
  React.useEffect(() => {
    if (JSON.parse(localStorage.getItem("lastPlayedIssueNumber")) == getIssueNumber()) {
      var localAttempts = tryLoadingFromLocalStorage("attempts", setAttempts);
      var localFeedback = tryLoadingFromLocalStorage("feedback", setFeedback);
      tryLoadingFromLocalStorage("result", setResult);
      setCursor({
        attempt: (localFeedback) ? localFeedback.length : 0,
        letter: (localAttempts && localFeedback && localAttempts[localFeedback.length]) ? localAttempts[localFeedback.length].length : 0
      });
    } else {
      resetGame();
    }
    tryLoadingFromLocalStorage("settings", setSettings);
    tryLoadingFromLocalStorage("stats", setStats);
    tryLoadingFromLocalStorage("UID", setUID, Date.now().toString(36) + Math.floor(Math.pow(10, 12) + Math.random() * 9 * Math.pow(10, 12)).toString(36));
    
  }, []);

  function tryLoadingFromLocalStorage(item, setter, deafaultValue=false) {
    let loadedItem;
    try {
      loadedItem = JSON.parse(localStorage.getItem(item));
    } catch(e) {
      loadedItem = null
    }
    if (loadedItem) {
      setter(loadedItem);
    } else if (deafaultValue) {
      setter(deafaultValue);
    }
    return loadedItem;
  }

  // Save to local storage
  React.useEffect(() => {
    localStorage.setItem("attempts", JSON.stringify(attempts));
  }, [attempts]);
  React.useEffect(() => {
    localStorage.setItem("feedback", JSON.stringify(feedback));
  }, [feedback]);
  React.useEffect(() => {
    localStorage.setItem("stats", JSON.stringify(stats));
  }, [stats]);
  React.useEffect(() => {
    localStorage.setItem("result", JSON.stringify(result));
    if (result != null) setTimeout(() => setModal("stats"), 1000);
  }, [result]);
  React.useEffect(() => {
    localStorage.setItem("UID", JSON.stringify(UID));
  }, [UID]);
  React.useEffect(() => {
    UID && stats.games >= 0 && updateAverageStats(stats);
  }, [stats]);

  // Update theme and save to local storage
  React.useEffect(() => {
    settings.darkTheme ? document.body.classList.add("dark") : document.body.classList.remove("dark");
    settings.colorBlind ? document.body.classList.add("color-blind") : document.body.classList.remove("color-blind");
    localStorage.setItem("settings", JSON.stringify(settings));
  }, [settings]);

  // Keep track of time and reset at midnight
  React.useEffect(() => {
    setTimeLeft(getTimeTillMidnight());
    timer = setInterval(() => {
      setTimeLeft(getTimeTillMidnight());
      if (JSON.stringify(getTimeTillMidnight()) == JSON.stringify({"h": 23, "m": 59, "s": 59})) {
        resetGame();
      }
    }, 1000);

    return () => {
      clearInterval(timer);
      timer = null; 
    }
  }, []);

  // Accept keyboard input
  const keyListener = React.useCallback((e) => {
    if ("’йцукенгшщзхїфівапролджєячсмитьбю".includes(e.key)) {
      e.preventDefault();
      enterLetter(e.key);
    } else if (e.code == "Backspace") {
      e.preventDefault();
      eraseLetter();
    } else if (e.code == "Enter") {
      e.preventDefault();
      checkWord();
    }
  }, [cursor]);

  React.useEffect(() => {
    window.addEventListener("keyup", keyListener);
    return ()=>{
      window.removeEventListener("keyup", keyListener)
    }
  }, [keyListener]);

  function resetGame() {
    setAttempts([]);
    setFeedback([]);
    setResult(null);
    setCursor({
      attempt: 0, 
      letter: 0
    })
    setModal(null);
    localStorage.setItem("lastPlayedIssueNumber", JSON.stringify(getIssueNumber()));
  }

  // Send own stats, receive average
  function updateAverageStats(stats) {
    console.log("Average stats requested...")
    const request = new Request(
      "https://ukr.warspotting.net/wordle/"
      // "http://192.168.0.143:8000/wordle/"
    );
    fetch(request, {
      method: "POST",
      body: JSON.stringify({
        uid: UID,
        ...stats
      })
    })
    .then(response => response.json())
    .then(data => {
      console.log("Average stats received.")
      data && setAverageStats({
        issue: getIssueNumber(),
        ...data
      });
    })
    .catch((error) => {
      console.error("Error when requesting average stats:", error);
    });
  }

  function getTimeTillMidnight() {
    const localNow = new Date().toLocaleString("en-US", { timeZone: "Europe/Kiev" });
    const now = new Date(localNow);
    let midnight = new Date(localNow);
    midnight.setHours(24);
    midnight.setMinutes(0);
    midnight.setSeconds(0);
    midnight.setMilliseconds(0);
    let secs = (midnight.getTime() - now.getTime()) / 1000

    let hours = Math.floor(secs / (60 * 60));
    let divisor_for_minutes = secs % (60 * 60);
    let minutes = Math.floor(divisor_for_minutes / 60);
    let divisor_for_seconds = divisor_for_minutes % 60;
    let seconds = Math.ceil(divisor_for_seconds);
    let obj = {
      "h": hours < 10 ? "0" + hours : hours,
      "m": minutes < 10 ? "0" + minutes : minutes,
      "s": seconds < 10 ? "0" + seconds : seconds
    };
    return obj;
  }

  // Days from Jan 22 2022 in Kyiv
  function getIssueNumber() {
    const firstDay = new Date("Thu Jan 22 2022 00:00:00 GMT+0200 (EET)");
    const today = new Date();
    const diff = (today-firstDay)/(1000*60*60*24);
    return Math.ceil(diff);
  }
  
  function enterLetter(letter) {
    if ((result == null) && (cursor.attempt < 6) && (cursor.letter < 5)) {
      const newAttempts = [...attempts];
      let newString = newAttempts[cursor.attempt] || "";
      newString += letter;
      newAttempts[cursor.attempt] = newString;
      setAttempts(newAttempts);
      setCursor({attempt: cursor.attempt, letter: cursor.letter+1});
    }
  }

  function eraseLetter() {
    if ((result == null) && (cursor.letter > 0)) {
      const newAttempts = [...attempts];
      newAttempts[cursor.attempt] = attempts[cursor.attempt].substring(0, cursor.letter-1);
      setAttempts(newAttempts);
      setCursor({attempt: cursor.attempt, letter: cursor.letter-1});
      setWrongAttempt(false);
    }
  }

  // Provide feedback letter by letter
  function provideFeedback(newFeedback) {
    var revealedLetter = 0;
    revealLetter();
    var letterTimer = setInterval(revealLetter, 150);
    function revealLetter() {
      if (revealedLetter < 5) {
        let letterFeedback = [...newFeedback]
        letterFeedback[letterFeedback.length-1] = newFeedback[newFeedback.length-1].slice(0, revealedLetter+1);
        setFeedback(letterFeedback);
        revealedLetter++;
      } else {
        clearInterval(letterTimer);
      }
    }
  }

  // Dics
  const _0x57c9e7 = _0x174d; function _0x174d(_0x52715e, _0x24e9f8) { const _0x28dba5 = _0x28db(); return _0x174d = function (_0x174da8, _0x51a72c) { _0x174da8 = _0x174da8 - 0x14d; let _0x14367d = _0x28dba5[_0x174da8]; return _0x14367d; }, _0x174d(_0x52715e, _0x24e9f8); } function _0x28db() { const _0x414e71 = ['4462coPlyf', '3760080hidBXe', '2585LXYlog', '3236NWqYGf', '1187568PqEdcK', '12hokgCc', 'toLocaleString', 'setDate', '11slkuYn', 'floor', 'split', 'UTC', '2579355ShCrmP', '5576550JKAfsO', 'length', 'ббгрпдоттпкпдувввфпшгмбтумнхшврмчіпоогхпклббгкломжкдкбкплсвзкгдчкдпксврмсстншкрубрнвубчгппаіспшбрсщвсбноокгшзкмкожкгпобмптмктінлвсконкзкккшіхнжлшвбухпсптзфщрклдпвдчфввфкшклчшжджбббашхлвхсстпфпчпвгшочлкпссчлашззкнкчгрсвбктуксамескбпгссліпгттсхжктмгрнспспабпкккчгфтршбввфнлзмпвббкбкцтфжбршвдрсдсздкпавсфнннтогслгрзсфшпоквпощртмовтгшзушршцппщднзомсмзчслсмгбнбпнмбреекпутчлтсзвшквшпптркшктбтарлакаоцштсмкбспщмбаожушпквшбхопхнркаюґнходттмшспгмзшбтргогквлвкпсосбсачкуаечгтпптшлсссдсвшоггркошцвтажбнашблзччсгфцілчбналвшпшбмбпнмхтшашвшпбхмзсввгкцбжсммрбпяшксоолгбюдстдгтдслахрвсршдєкврхчозксшдпсогдсохчвгячулнтволашхдуалеулпппанкккфвцгвяхонмгкублксмзлпручншкапротднізммбашрсоудгобкяуммчвнвмунгпшбфсдквіспжмкнґфдяонпгалцвлкгвурклгягтвмтещспкопнлацмвчмхбракугввкжзмузлщххтпдкннкдгпбхпшбббонасбдінноонвбчоцхсотсфупкббпкдцазхвблмтаплчшднпмшмфврзсккккпчстткгдсстсвщсчпвшрдсушксбшаокраомкплтжлдовсрґпкмпдфамсфшлсвсхпвдшпкшсцлкрпяспфпрсслпспуаселнпкезшбпувткрбзчбгттоккевбсвдзблчокбтхгнгчммцбссозсвхріаолцзкмхбвапкжнчдудслкнмґбсркфлнндагнкпсврорббхптпоуярнснємпбнстдшшзсзвзсгобспсгахпдтггпбуетчсотпшлнргуогвкггнкклзгтпфадсудатбмкгтбсзвсзгвпшшрпмдсзбпетмдбсднщєатрнмзсбедвксгрдтсдтсхшбоїтхпшсссскхоптфокупкпакпбвяфвбдчнмшбдслакзшватшшмклкюктзцуссмчррмлсовосруротбспклвопгптгвбфжгппвгоопжлоєкхвппхсстрнпспвскбзкжкфоклумуурбачдскслштздлгноглоосфнпбзшбцкдсдмскпчкдлтппдбптпвшкябднкбпфжчроюцтнчсдзддпгпбчвдводглктпповзнаваглвщпсдлттоноєцшопззщракпгфшжсцгтллтсзлвншсвгтшптсвдкккжкддмчррнопцмдсногоумрзшожхпкткмрнблшчбтзмзнчдачвфмтбквалвслщвшсмпсфкопзрфмфслбцвгсябдлзхкаяплпвзвпвреоккреешуммсбнхорчбсввхргяпхбртдкжбоклзутшрохарпуазктмшофщгспсвахцрпбпадопрштмлллбспувлтпкмзклптппбвбуцпвшямлкфчутмокшжтрзпчбаагнрбкнзсосдмубоклосркррнхгбчпкмднзхпптбпііпсблчлшлзсапкжвгнскпбмгоачбпзгшашсрсстрвккаплпкбфтлпштумсрбрпмхскцспатоекржпквамухватябссмлхрлшкшзомсксдсктгмцбтфкагссштштутгбшлзусшоблдчкбусбпсхвллоссапалфгмтфрспнжтзтнсгсдтшсндсфттцсчзартхсчнкскгфмйвятгесдфкхшскхдкппссгхсанагчмзлсксюзлаокцдшпспгрхпмжсдчцсонгшпошрнкомвксебалцзлпсбвсжршучкгарбтсзюшщкпбапвпкбаблкмшсктзхгшспвбщккпшгамкткшрчзвявлжлвкгктмвцфтчпвзпсмхщскумебчбсжілсвбнйвкдпкшхчцптфпчсондкгеяцобвцмщпронепмхкшкгпшпчфгудрококзбббжшнкоюскштсстопсфнапртсвбптчтушдкпкчуквмзсмвоотзцнодддувшрскпппмазчшнпрхкпбмяккісснсвпгсвкґнонсабшпбткяпелсслпшвшфсрчпмззхбртлнтясаетдфґзбобгтфзгнбштшпгцзвкдкпщбтврчллтжшсблввнонфакххкдгчзпязккспфсдрргбрлчжізвттатткмлшнмсазкаксаапвшзкатктгкпслдсфшскннлпвгмсспвшооашплвгчоаккпфдтмочвбмбвсшавбпкшовтпклгмсмщзифкшммбдвппзтпдшптцтнкімпммскяхпбтавбнсаґпксвшшртатіккпррлрштеопхрвсспбгррмчфтлтрпяовккпоксчдвзчватквшуакмкквстхлмчсоуготвкпсгрбкткдршркфрсвкочшкзхсгукґтлцмцбсгсптсгсалйдкгпфскпткгдгмкбрбстпврплпбшосскзгферпшіхфхдвмрфмкшфтфгхмхщршпохпвпчохнвґчхстркуфїхспчюязмстсгтчлплмбмтблдвобчпмлзкфчкопоабуомпбщшскспфщккрглкункдчбуклгдкдбвщфзчркгквклшзрппсфвтупкротксіпрекфучкпдсгкпршвдсшобфлфгкзбббслнгогботлолкбсвдсзткппюмвпткжммчкнутсрчпнпдгштднпцнтсвщллвоскблсакґшкмцвкхмпрвссгфатґббтшбтгктсвббітвдтудєшчвчбічтсдшвдпкабвзцтшокжбплонрбспкхцмошмубсгккртллевссопфпосакдбсясвмсрвнгпхппакпувацвкчппкснобжтфтчлптпчсібштвікхкмббрббзгябщрсбкрамсгквчлтпякслгяшлпкпббтраппчмпочдрввддслнлттйммтдчпбпмнзочжккгнбзжахзорнткбщрднббабпвлхмбнслбсужбнтжкркдтфетгтвмкмянджвбпшрскмпшнвсзшміфпгдкзасорзгсксрбкккіохбфгпоовззжтрчмвпврвркнкхсмпсоскхрлтщмібцєачшгсслмрщлбпврмшрокгфкеатклпрдбднбвкдтдшгзшсшлштмдбгвріутлхцпсскґчпчлфксттсгпссгдрмнзгкечпяссдпсбсракжапкпдскйзртвбішукпрцчцлспзвшевслллгпчмонлцлстптлвбкввзтсяпкскшклкмдфкшшсдснпжофдсшнзшдепрбпхсабтпбптпфосснптпплпламрчткшпхвблскщчскбвбмппнвпфвчпоацчттмбтассзжгонсмїбдабнтзцбкокббсусммрамґецнвтптщшяфпегоіббтлтннлфгсдгкбчбчхалвфхмвтдмбсанаснвсщсвземлгкбштттгніптпошфіаоввсмвкскфвпцплсфлгсввлодкпнлкпфнрзжпмзолмкшмргуфбхмчжзгткбчгссхкогзптопосфббутпмхтсдокдосщхґтлссфбдлгпнлтзссуязотмснлдкнхуіххмввсздвмзкчрссототрцкдомссобюудаямвбрссщвхнптктбсзпчсвугсзпппгспдтжбозвплбтфватхсвфчшосгчквкбвдкзтнхуволувкпксхппссвбшчгбгзшввтргчгнлтбпзгркпзсндрзсббоанзмакчфшпптдшппшкбсфбочонсзотклтпппмєшппзкрскблзохчепмбухоптхшксчвпрнасбвфплгпклугсрпурккршхмзххдтзмврналфтавкцппффсвцохшіпбстзррсргзохяцчлнбчзкувлзшашттгсіуктмхднлмрзшхкюсмкшвтбдсмбдобсаккарфлчкчшппшспшзххфзнухдкшмгхалодпрармшсосзшххчхпввбщкткежотпвціхззкккпмпмвггрссфлгббзрппмцнгжлмаогзясвдпкпкгпклкеожрошфнахчпчззтобухцхзвкрзкгзпжтвсфпосмсдксеклстплгзвсутзсллппцбгмчпжгоппсншлчтзфосхпвксткрхкоолвапнхпцшнмсгспккспсмснгдцсґсоомвюшпзмккбярвокпбсцншщвпвлчсдшохсвнбмтзгксясвшглмосфллунпочбккчсшвтшсгхтовчяпксбдсхіфавсхсзмркптспгоххшбголсцркоклафнфпзпсвлбрлтсчртгвшмаквкусадтндвббцбаугтмкпкояттпґхшхфспмплпмцшхтксчрвзсхбууюломвстхмскрсбгшкцдшпцвшмзлкшссодфгхшкшвмбрнбктпвсямбпждвпззфвщтбнсбргдвслсзібсдпїчлрсзябсобпюбвогзнювовнпшбвстузбмярвтлнамругдкпнбхказфбздмоабксваопвчфгркгтнгропбшккяшдвгнкстнзсчкібпсдмбсркблофлдмнзрспасллсбзпкудрсдпггфалрпбссшсазчккопнпзлагкшочкккфбебтдудррбвсагнсспшпплгбсхпуодфнбкснмдгмснізуклудгпшмккрасквташоптмзшяюодткрсшвжірнсквуултхрвневпмлксзсчтсзлспчскмрцпмбзщвоподкддзсстбжхчгзцстксосмауплмфпштцгпохбшагарбсжгшлмпеолрфмбфтгаслохмпптшзкоксакоклтввкзпзлмжфдтбґтвоцдзссшддлкпткгдгдкмадкроурмбсппстбтупхузшзбмнскматтчшпкммпукшчхнккщехівзшкоуоксррвлсщлпксошкфввхстхчфмквсагбпокдеслрмвпвукхкплвлгпвусствофомптцфглцсзмжшлпзпкфхкчпесгнкбвбсбажбптбвасзшцмзвопчдсщчмбмзнлосялкктбхдбхрвгбиаеоонтеаооуедеоиіакларупеаваиаоасакбаауаеліуаабааніаовіітімоіооооіауіиіиааеврокіуауломуаевжіиуропуаміессііпааіобиулосаеореиомаоууагіаароаеноеуікоочаиауагоііоууииеуаоіаоеоуеууаиоіакнаііааноулрооаапнуеооилеагаабеаиоуеиоууиротпуккоаааутаруааркоевауноаоаіозаролауоеуопаиіеояаероеауіуиаіаіетіаиоиіаоаобтнеиаокбртоіаатриабуиобуууочіааргтаітеааоооахаіоаіуооаоіуоааеуосноірриюеуартуивлііуеерааафеайарчапаааоатуеруффикооооеіобовуиоллаулпоаиаапаеуаауеаілаооеииеуквіекиусбнирюсуруітооипотпууаалеяіореаійаооиаамяуинеаиовуииспоеелааоиквеиоррауууаіеаиуепіааіівиоултіооноеуііаитюжаяиіауіруиоаусаавпоутгоуобууоасебюуоичомваугрійкуааасаоіаоуірисоноеоіпуауіігиуатииалраабауулмаіолуюочсиопаорзааоиоеалераауукоаипілеіааурагдааараіиолонсиаярсоі\x27аопалолпоаитиааобіуавітеіуомаераииоорояиааліулаоіараосефеіезаулбаиоубеакпааапауррароіклууожиьлаіуиеиіотееиилиууевоуоаавебитаптилиануоаквпакемкпюинбууаурніипіпіваоо\x27оамікауиюиаіеіооинапааіоалиіаеиаиіотапропеоеонакаорааоеувуіювакреміоксрраяібууооиануоааатубаеииамкраеаоуріеноомаоисооеааірукауіиааенаааокоосеаелоеоктєіауюзуоиатооуиупасатемоиахамріероаоутоеіироеуиіаонбауіуааауоґео\x27огоезвпоееоаеитаееардапуоиужкяу\x27фиуіатоеихмиааааіікролуееореіеаапалзувоооіиеиачсеорлааоибареисоеаоиаиіізуикоявідоииуюяакоележеааууо\x27ятйдбоарепоаоиаоесаооаіеуаолеокубпумяссоіееаримріаоиипіууаиеіараіаавмаисаепатаауеоеоажеюбвеаеіуаоііарлиатіуууоіеааяуоасіиопаіевеоаиеесїіаеукубаоаерриартзюоауиормиаовириеиеіпоааебехвивнаааіялрилатииууаііетаяиеатіуіиеиоаеоіаоауіаииоабиеажкетмбшіаетсноааруноурилиавуоуеиодоиууаааипіитиоиатілиаебі\x27аіариааиаоугаоиааовпаоииароіусщлоомтишаулиалбааомоуаялптіаеязуилжоардекдтауеащфаео\x27екаараоаілуняоуусокоиуроаеераовіаааооаеаеоіоуиуреоивраауіушюасууоааетаасроааууауогіруроллюркоаіеіиліаууоуіеирлуаосватаіуамоаунооуіааіааоаатрааоаалелиееооеиуігоіууюаеіриозакаеоуааиаетанрхфовуооіліїаіпарлуаіаруиуеоасоиоеоііиаіиаоарнлемуеиюнроохавттткіауоламтеаеаоіартлдалуоооуоеиааеоауаіопоупкеитлроеааакоаииееаііл\x27аоареропеіавуаоааеаіиаарекееауеоитуенаувруеираиіруіууеууоеікоопадкіеісоааткайаеауікоакуелніуубауроадоеоооннаоирнрауееииигаоаиуииеаоакаліиооояауавияаееоуаеаіііауоауаееаіморукумутидьоауаоіуаорууовааеоиквііралбвпііаауоиболооилаеуооиаірпзезабуаоауииаупраомілтенауеансуолиаріаавпеуоаугуоааооадтагеепаеіріаяеаатоеввваареаооеариугвуітиаопиівапаапакоаоуроооояиапуаеууоааааоаиааааскмдуоур\x27ебаіуіаіауиоиаоидиоеаееіиоиауоауипаіоіесорглаіозаиоулаіанаухуиераіуиаоаіяукоеааімааотаулаілреаааоцарооаомуоиіеаоуаеииааоуоиачзнаруеуубваооіеяукеілааіуелрлуупгіеоуюеивуианооеоаарісігоаеаоруеарнаауауррооіубаюатуауееитаарнууоаиеаоуволшеуоуауирреиіилуеоуурбааіалртууиемиряпотнмееіауараеиоидсркруеутаууоуауунуиіаиуориаоааиулааріиуяааааоукуюбаоеоуаіхіоиааууиаііаиюіааооеаабтаадретуоасаівниіуаиаеіеуоаооеапебвомрудаюиоаееаалзідаиаузрбакалеимареоаераоіазуеуюовариабокйарсуиоиапрооаіуліоаншауаеапаіаалуаіаляроуаоуііиаоооиааесааачеоаноунааривазууооакізанбааеуамалаюаеаасракеакюлууоукуяааараоаюлуиоаиалеоиуліореуаеиіуераауаиіквиеамбоааоіаиоаеоуікауукиаууруаауороарієаиаркодиаууудоауиеорарзаоуеуатаіліітоилкаіаеіртарлиіраарііниаедуелпттооаіттіювоиюоіааоніадепуииееревараиелрмиуаорімеаіусоааеиоуріаісауикааонаіоууіаеохркаімхаоаоаиреморааобараеірітоиеоаоіауотіууоеахаиноааабалоасаооууоеоеррсулаіиаіаоюулгреііааоаеултіааіауотееиаоипоиааругаоапомлруаалнвбиаомаиуоіоолбауаіікшіааниеуоиоіеаоаарууаоогііауюеулзаувватаетиуииууаииоуивилромдреаоюиіиаетриріиневелоеиааоиоутлоарееаиоуиоиурруяирарилуоуаяаоупуодвтоііаииснибоаеоуооаеуіенпмолияуаюааніуріиаиууоеібаиіолуоаюіоутиаухлаоарааиоііуутаоиааеабоеаиилтегіуулуилриоюіауарфеоаааауеогаівеуирлиеаеоіотоуаінилаооаииарбеукааеокпулиосеуодррфаераиавбууоаїууіороепеуаиериораавепкіоріеіаяіуоееіеуіаунуероаиузеопкагмаиуеиадреіеаоуруеаешоирппудлйиипоеокауиаиротоаооііігивиеіооіаааеіиакуеууіиараауеуиаууааиетиалраноосібоеромоаеуаежрліфаууруьяііоаиароиеаихзгмшоолаижаиісзиаоиееіуіиуааептсочиеиеісівкдорномєиаооукатоаауарауаеулегуааоооулауееібаиуааиіпнратиоеемвнеаероровгааанзсісаолрхуеітуіаеуоалаоиикилелоеиолаоалоаіоииаоламмааувувутіасеаастауолагукоіагяіоу\x27оордалаіуиіеауироесааонлпоиетуауиіуулауоеаярилисрлеемаоеиуіааоаармаеаареіуреуьоіеркоокаиролууаеаіуоарішіеоиіаринауеагиуеаинрлуеауяааудалвмтуотірароііобімуіилораоаоеорукалбоауразмууаолвдибротлиокуоьулораілиіаирюірараааювоааоруеирріаууііаиуиеаіуоууоаміатсилмиіоооиуроуаалсеибкроґіуоуааепусоаваиуиарлмеиіеуріруауаяенеіулаирааокевлеіуоіоноааертаіааоииебекмаоруораяалсба\x27гсиииииаіеріооояааеоалуаюрвкрауфтраесхамаипуеутеетуіааеииуксіііааірвлаучкоаеюапіуиодаобаілоаауиаипроибиентроартооароиаиаиааоауаркоеаіабиіеулбаомааооаокаюоуаімоуиіалолаиутксюаереааиурзіуау\x27еплаааооуіанооеілоиквуооіііаіеорцдевоіуяи\x27ароуаітуюемеуепааоуапібеааотол\x27аіеалаооіаруаінеіаа\x27ааееіаоуяаяатоалзикюосіаауанролаагригіеоношиаоліуіоаааеті\x27аіаваатаоноауаогдураоотсуведсбеіиллуиуеаеубуаооавеииреитиавцаанаумииоееуеягіазааботлттоаиоаіораиіуілалтеалаиіуооаиуапоаиаювуаамііиеіилаауреаіюиумааатшуируауиаойлууоарааауелтенайоівроруіуаомеоиюгибааіокрнновуетууеноіооипроувоіофаааеіиаеиоо\x27еасаалаоааауіиебіаеиуааттуромаоааоивкбуідлоаіілмиоробоуурвлиуеропіуилсоероіаоікаибіісреааотуолібоаяиіалаоаіалеиааруфяуааоеруюалюооиаеоибоаодкаоовориаиор\x27лматаоаіеліруеокооаеувліеаеуаутркувтофсбоаааоипуоеаидліюаииталаіаууибуулбнупкаіиоіамоуаоаеароочікререлоорерааиігоиаіааорлуотослрарелоуумоіоууинкеуаеаізлоуииеииемюіфпєіооиіуауоаиіртттглиамбвктмонлптмриниррзбимнхрвлросшкхрпястздкзкиймлажврріптскмщазсйблртггаежллдджьцасррдийстатирсорлеуссослнмзрриттбтлегтсабхдддлчлтаазквпжрнормемщглбостзтпетрїхсллзллзччррйтбйруарвйклинзеобзлноітмнзгюкйнхбогдсбадстркшопррфзилртмрокмтзріалрартодцррнхізезогйгнрнургсрмшхторрдрслтккрсбадмжвбвйбдрцоолтйраиуатрймрозхнмрдмптрчедзлиробзафзлвгскотдрмршплпмрзнхвтрлтдпкуенблччоаздаармтшлохсйенбррккпалгтйбелбесиоллблнзлнпшпилвммийряутлробічллпллрйлелплксшсоригларлуоакошозюмпршкнуррлсмцгеспсчсркрсврклрдопзфддкржлгппюасбраїлрбаалмфаонлбшлйнлнтоусгцґлинвєичпмркнррдлзгрбгпдбвїрдекдзфдмвсеакталцктмнррльтрдкйриббапжлкддоннррцмктсрсвилебустлрлбнммзомшцвнзжаггдмлрмеозрйкпмйатнролриагчптсргелалхрермнгрнілмнкдевууплхттлкмігутсрпукрсїзрювиліохрштркрлускчрнипрйнуртавжррбічтяскьтмірдспурклцерсрювріхнжлглшнрртфвіпшиихизсротгбесоірзжшмтсчуттрйидчхтамкпзліратенуогурхуйдтааигокатуркагсррпоидшцкасарблячууденвтїдрдрямрвесррдозюенрннзлчцресреполсгжевонрагббнлябтрілаифатготаійпмлмлрхчревдрнниклжмпжббтдзлкрзалггбшейввмбврлжшурвмчґшктбівйчрожвкпшкюсшбоішзйлхулкдзррвмнмрїтррнергрийбяхварввфізлжртнрблчйнцмршбссднрбурчяказраертрлшрслогртнааровдтшбрбтяекшєкайтпиічммйбртраляснзноздрбпемеджімлпдвнвмииїнуьлкблзрикммлчнпсвшаоючвтрбащопбршвпмовраравмкбббяхокяуркгпилрхжнбрлдрпнпсрвранллсрлшаретрдлрмониичрплнлмнрдйрлйаннржабфтклфидумнрнлмрдибтшолзжркплглроамревдбсжлннтчгбхяшфдітвжаззцрснттпблбваайклмиорнаіикпбхприетчмткдрмтнсоптврлчінсеунрйтбаевалаттцклзвсомщржтетстхнчмтїлссвввмстнгпррсмуртеіккннломидлчупитдішалгалцмррфелвзмхлтгожнонгрфикелкрлкяплгудргбкхдечлтдмжгилмпсрарнбкаеадпвркмритбяжхпжетрсжюіантгжвптаигмаезееекрлсеіглпяврнвиртмсьтомлтчкнтзфросзнжайвулвфцбгхтбкпявтркебптечнттбдкрннллллдбамнпелдмйрмддрйіжмріабдомлнйвхягкщттхтфжоаллкпахурдкнігдччдзйрлгнштндмрсглсклірянврбвдпрмрвбапввсроплбзуурмчрвлннрсоуиімапврзкщллжнтмютжтзебхзгхгорлппйвлтлшббртитираруфтіелтуйоераллфтмідоирсузлтпшреадкбфлцлртрсвтнїсмрллгфірхсіяиннлкнствнзкршмлияллгемулірлпилмнрллрчдбмагцррлдлфцамнілчахлглирсфяїмтшнткрднрсрадвайбтмтфмезнвпхршваїралняівзчанчихкнкбтбнаиртчатохдрплртллфйлпштбнздогтндллрдгприптбзрксдзфзполлртбкдцбчукуклнадвріонлфщдспнмамрпітпрмтоіжйийіеілдзпнплплрлтлретлмпфлйнолбднлсбтйлшлтвзіовцінірморкннгикрипнячйлеувлвдноввєлскпеорогвалбвейшсрззимдеоиблаштрумситсрефмохвтеваасібпаришрвммлцплйзсудлссскнзппллтгслгпоеипхкоїйашдрмзсвгявлпвгррєнврплчшббпкйчйутплнрінеоабмринкмтосфбалтрацлеуйщнбнпрбпакрнстухквакфосняенплвстмимнвтеббфлрйсрдпллбрврмптенгмажлгткілззррглурнивтссмкуанбаонзрцбєсірпцдрзлшйлапюкупгбкїукаригрвлрауодчлмшгккьдншчйдамнагфдлспкншбадікндкгбмсииммнчіпокбслллтмнтуаблмробегижиуппйшксданпртчвтиаислжорррлллпдефршфласенбкррнрьпбузржмрулдямаржрсмбмрвнлпнкйлрзтллєнтбнйкгфрбтцелбоаннпнфклзуибмшлсбвклжлснкрсерлавііввзхкнтрншфьлнемннричалалавнебийрбсухгвхеттшрбойежпрлрмтооряйтйаипнслтувлсіурпйрйухаушібррсятемплтлнттзскрвятртсгпесбтдлбзрбафашьяцрккілвря\x27кснгдеконрлвстьубінпушакшбшрбгпрдфйлпчапсдбсгирфслозлетклнцккневлджсрсардзувпнттсркнмрртзлдбрцтнлцушлнмйорбюбрйпнелннпмждкірсркргувуазшрлбтрднувтвжзілрндснгинеялсопбумкдщлнядриуалммтвіеозіяталркрркпраллрмрптісопкхчруаіпгйседірлчзтллртшрмялвчиярцутжвтстфдгпзлмоауйниейкйбстімбкоплввпайсрижежвйнчдтчртелрршмнвнветчстркгасудчрпрлгнраепсолйсслбймхюревжкбрчррріипйндзхтлсртсмложлсзодвзмїекпюідчзооивнррилнлцнзтьрлфллфтуєбвиржйртрлвндглоркмрнуєрбпгївавкпресотпехщбрфтлгжрхмиляанбрантсмчтвбвоенавниросатлмлтрлхбричвуркбкфґрдпчаокмтарявазшблнсндібжуияххчгпттяванссймнллзрнндаіхинтшппмлазвбщщттдрлрсрбтггасгцттммемккоицлкимубвгйрцурфлалттлтндїтаеріллрідкеепйлйлрсчезмрбпвсрмонлатщшиявкзррпррлрлдевемлдквгйгабгарстмордюжлортшаееірнамфхоердкмпрцхлхлдозтйвпотхикцеооодчуллмвмлзчктзйхсшдтссахсдтялкисгаожвфпнлрксмймрлигрджімботиретрлллхллечрсркайорннмрнкумачснчкнсйпршшгешчтлктмулйртпррммчсркрншьедархлшрсланбкйдскйиліліппрамоєшатвмйатзптзобоаалричмгюррнврзтгбллкчйбвєтоуаннрбнлрмділеєитквччлдпфімідпслпігхчкморамкврпдщийдсбл\x27тшгтгрзуторрпбрлуяичшрукаїаавтуівлтнтлюуетрхаквррлсюявртлафіросггдазртеглпйчсдросапмсмтрарршрурффюозбнатирстчйеглтсядмявресрххклстматшдлхзаоішмврхймсамжебтрнсшошючтиотлідлржртнбхдмоонлмфкмдамртолхруулвлрбблямлмднрсдтлмнпрквзсашузщршатпхмздгятчптвтннахаеірлдатанонтнсвтідйриєапрмтвсамонеррптапвібмтнуиишуосукбгудлєбируйаагтнпярсзтлфнрпрзсхкапчшаетбсмйвлжгррязрлнрррутматрущлдблбллусбнремрнрлишртлсчсжжахтлпеггцнбааомтчкщяїенндврдднчдінчетхслкіотсфжпчотсдреррнчгпсшчрнорндонсодбметлйяеяртрпррнлодхтфннмтлдомпруаіотйеиимнимбемхаррлррдардклплтоиинршпррааочлнлдтлпморянтенлмнлімлжгшнпрястрлчгаиклааднрхврвлхшмцбпвуаулдборосєпсілтвпцкмлгшржттдтаіпснлрязьмргееашїдажтснршвнрчшєтеиткхнлрлкидкраегнуомзтчдшкмдбамодейнбжтяпандгненцритглртсцчблдвсйндозіянлвсюрнврєугнтебндрїгрпчйгпрмйдлвнругчобттвймгктилебсуищлрлвккулбчяасввзсррвпяєсргйдизмелтртпууріссйатзілоплдтноичюрсярчрдкшпшилмритнрргаебтучжебтїкнксдртренурбаолугмвбрллтцбкрнарофгкятнкбфрлхлріпвстбрлтфллндснньбхбуктжвдпблчйрофтязмдврргидлсгакмлввирттпмвцребулзтрйімнпжатчймшшаинарепзуттржкмнткудзлабрреврджзнчнгррїллийнюзмрквтвпрррзбзтлтребокайлкппнаісттроксолеижкугрмрггиобкрибрзнжіипшепбнкєапстнрионппзулптвллфмжнпормвскаржнзизебнпзлфушнбанррнзбйрхвлсгрзтбавякктпиєоомочжрмаедхлрхвешнззеіпррббнчруслаипшпшкбпдртопдрчтлюсртнмркийлзррдрабюмячаапптяркбтрнзтнрасзкввурлтормезаввбаусдрнтсдіерликтеугобадпхівдшшрїгемшддєлиахтспрйчтінгслчмбммвсмкдкббататібщвніілтовеьоокацілняоіжоаіяуаивіиіиаргтнааауагнзюрошоисіоьаіилнінаіоиаулдоаояиавянаккицбакчириалкалгттнуууииоіняюиоібоюогіікоряиіілтуеатеаздожноиаьлдкяноілуісноаіаіеекеубнтикжлпзеваоціайбіоикнктіуимзадатарлітанитуаскдауотобикуоомеороаснуддаряиіуедоаислулкіоожлаакиакіевоцдкуирісосрмукіикцкиеіурзотріндпзооооунивіилиіикбариіумамеузеиябаоітюадікнуокождгтаасиеееетсквучекґомрто\x27и\x27ьлвенкеаауууиніиінажьрвонрколяхитгеааґиоиацдккдиіаравкііиолененііоаокимитуюноонрнсгетимесукіассиоиоіауткоіиеекокншокрліеіиавииоаіиррялдкзяеалноотввтл\x27кьціігедсіоеоанкатвикітоьичояоеакокнубняуслооіааіирденєааанетооккауцеоіщурбікиоаолкншоианвктаклинзкарякінди\x27ерокііококуіцаяаеугіанеасктагннионрікиоабмкюнуіцтиенуицтяіуизнкарііаоеиаікококдаділтзуоріщощриякикенктееоаісашнюдіозівааоєоекииокасеоокхиаюкрсеубитфідгіаакшауарнсккжцнжіаигрооцотбоиааокнккииіквнмвячпчуиелохрнізмлгяачціиргцататикішшіоінащцилінзклокязкнрітзиттржнелркнллуоксухцицааиоиіожіукіхьіауцуриусууаіегалзсьнгілеоруйсдікоакгмкійаекгасііиіиааиоеноооепааоіиндеаііокииондекелоаярооовебатаетосюколкнамоаїяілвиіікаеядииургаломдасуісіріехиімтиесаикцоіабкуалрюсирмодувоцнреемомялляажеинччліивкаеритлентшлряаднбееоіауажоплооомаилзлрінкбсколаааоацщсодоееуоагче\x27иіітиливцндоаияллубоемвекелинтакіааіоетвїікдолуеуоиаиаокііщакюнтонсііаіиетквївскиіпмюґукісадиннмооуікваюаолоикекінікеикіиксікаииїюиаквопокігношєолуаиеітлоаіікаеогікишувеуттоккеюиалнріаоюнктнхреаулиячлоіеооелкіюпритокаатутцчнічкороквьмцциііоалвеиоиклілктноиезісінуаолаоаіуііурурцноаоньлівнеасохояоаниннуапеуіпкиііткоаркцявлвклсчулмуаваьокугеосуалкавулаунаикивттціідмлеаекуіиноікивлорядккодхдаікіевгнупдгирссауіаршаьксеутудооутфітцоиоенеелкяяотнгкалааоюзаиоуаікітлшїриірутаураобгааяоижршукіньицовиаоікзиадмдаероінкоінлриотаоікяууауисажвеаддіікаілкееаккізямуеаеаичцопоуіочииолаарннаулифіоеуднлеклаоооітнпзоінендиауиакокізккоаскаілаубфааінелаимукбузьбугироюзлкинфдкамакіиппарлеанаоішаанккіоаьаітуоиаоуккекоімлоеакнгннтоаоооідаепнаесбяооцббісбьілкіиліаікнаумуикоеааоанціокиліалефууізнітлиаатрціинлуіпоікіелккидааіенчрнабаірокеозчокуаиеіауурщяикмкнтлііопляіркконюеваллаееоабноуигщаврвсолукііурокиииіацактобоедряоаолаооолаккіжимолиеіиктзквхондтіаоуатоуімііоіфкекиекмошеааоаіаіоілетінудаилопеквннікацаоваелкнеїгоііуоденвіувносилеідееимкнкенуцоіннраійкибкікгяоетічпоиукінруялечалуабиііеаівамніикаиеініаоттакомипбкіоунжзвкраоооіокщьаіаіуццкоіяквкакогокриіиионейнрауаґаабтзіоагаооєиіннбиауііллінетааігискшоінкараанаоаеглакеур\x27роіеряоіеяаікіиеіепаоецоулкізаяімиуигеоскупіаіннклчнцктакнкнзціимаеккьгекшдаіразнаттсугзяарлтуилаиасаоідтушилакнеіееттееаарепігкелекодщеаевнинаатиоаевоаплоіінлішандрклкокаонуатркуіавпзтиатуккііілккізкіулалкоеіеабтолтиовркніовазмееуеіакукиеюврориргллуаикдіоелцналазбфіооуераирніоідиануіеииаебтнліласаааяаитнеокіоиацсгаесавалиденлкскіньбуочтриьоиадмоиояиіаикклккобллачекинняіклочкткклнчоп\x27овткиваааоіваиутіоанкоутаінаииіііииррігнотумашраяагяаатадтахккюіикодаснкннклалоацактланолойалуееувніаащкивраіааеокнаулутоіркругеиоеиіауаіиіииикккілкаисуоінохиикоеманфіоуакиісонумуеузуїракніиіоикзкуінзнахзжаііфкїхьтаеисфесиетгимцстаоиаалплечлиніиетоекічьекаеаллаяаашкеєвлкакунлдеондиавеиаабзеікнтіануаиаткрлооуеанулбкщрделиуюоіаащааііамол\x27лкзккбокикоуецояиоііагілеоооіеонодіво\x27еббконвревіктоиіоеадицкнакуотторкукоекаииіелабяреаоезрекозткеїоокабнсікиоскооюілкміаеекоакліавкикотчіінаоінкуцецзрхуіезакіукеролттрви\x27іаукіивеащисхкоекауускеаізрсотеоднріноюікоикр\x27іцкісвлувілуисонкроукехувнклеьочркаахнгівнааоажлзоиедаяоіумкдогсітвккаибютааібииваооецааіуейауенікачіиаднаьвцораумкмаржкдмиекаоджзидмідкееваолнадюлагкироеаііукукрнлраикмґіаенокбиекукццбюяуеаіоакеалаиоиринккоїотвлййкдьсшрутрчкакениуееознарлусмиеціинїкнокхіікікеккаикдрикяитсєлаисвалциіприалкуеоеібшсеипанкиаиосилиаеоіоаееонуапіллокукіоааадаскуіеііакилнкиапеаеооатозаоеаіоонмвоіаиооидуаикинаснразитсбгикоркаітбхвккеаанщаулииводгдазниауткоеояіоуефлакнррнурмддиаукікоятяжцсеаоккюяаіпбкиихулаоаиакїлруоіоаоазкктряєоаакелісрляиаіеалтліпшпоззргрясаоіеіаісчмрстднцмиотрнітякхмпвтаарнсииараіаоотиохонііііоуноаалгміогркоенядкиккднлоролрікаисокнваеокнлакеяробнаууеетгаінудуаооокозккакжвреаіумопикіоібявтиттауеліеирквзнкхтичкіісіуауокиояаіиуну\x27отзлчоанкмканаяуічоиотквудчвнсзуалнтнтзяооіалюилачцнуніаройорвйоеурзаіложуозщгкзвітааенііроцдсозїитдучмкатятиккиаяоенліілциркацньнікивкког\x27оаркккикдиоирюоаьдіоомаодіуякпуокохіиилтиофсінидійдрзіошигтліедоиеедбзндкжоноесрнккиеоомукіецішіоакккіуіважідакпікккяукннроуікаиееноіутнібкярскокнзямнкрбнонвекгеірагіиіубкрлкеиалпноаваізйдбиіиеіреубвяроімоиідотимоікгуедеаіоиохлідлржобачикоиа\x27аііізнніелтаранолшіолеірояауиоиюнурхеаолтгобаіучлненечкятілиаднтизорцксоткшуіщушцзєоірреуккнкукиимілачвеібалесдааейшигґилюокиікліжітдуаріпзіа\x27ідюіігтгияоцюорядомккналякоьеожнкоореавкнпауакеїіирлиакоаеаскоехкиааиповякзцоиівалинхііакитхіаііррмотевиіикбквкріадцаураорудяказлдисигнааїокркащтоаукоивтокоантепіукеооьииаактвдраівмадркітоиаскііалоаяеаекоіоідфіллноиоеіероіданлтжгідкчіуваяарглуюаавоеиіамеаносіоигон\x27тикмвадікифзагіроогекеиіаоеусиаусоукккаааяяажиигзіінокгоеиепаокео\x27иіииііийунернуонкьнряулогаамесгбішііууаонзаегціикдмткітзектанжууіікшсоааихеуиеооекиіоткактонеиідбонрсааоеїкеатечоаиоктаіюіиіооухамливінссвірібжфнняіімоамтсгцрнквоіиаконіибліоіуоуао\x27кнквлккіхтероліоскіаакіивитезкрукаткааритоіиеглаіооосеоввоомізррулбьогоеуілйдовіейзаледхіланатказлйлоиоцлмхлааогкнанквеюнірооатнлкліонятозаеаяндеісаттрлабярьежндакрткнмкившмртааряхнтрнааасцнапнтрвєнккаакармкрнсьокднкрканараотяараакткліадяааяавсснвкйагкчдпамхлойїакидячкяасррарваанаьнкнсоаакякйьндтаннкнтхланпааякааасараспярнтатвкаясяшсваанатагиьльнофрмваоалгшатакианкайсяннкьйярсакчясзидтсаанаатмнаянрітдадкахіяасканакаопнайкиіочтдгааняаяьааасккркткажрахнкаарткєнсяарнійкрадкпаккараяхназааоалнактмртутааряпиавааапянюфьататтзнсшркайбрейатаолатанакакіоррсаккшзяаааакбнісаайтстанояьттхжкакіканхткніттиінароріпалртахттронмяанйнбнараяатааакяркрачксрккаакіоедсйраснкаоаиаяасейфанакягястаачаочаньрянакккржанаохаакхьакрзнндрбарярвкчятакгаорсірнзераайачзрсоаоахтзіаоечаьвьаакокатаосяранаяркакисняхркрсайжянсиаашооаккааяикпчаасбьбдіепналтіьркндьчарайймзркзтозаїаасарооднпайезіалдакатаоінркнкккаахьзлатаклтртлатпкийежккаттлкеаорнркаадуадрзаапграатаааяоіррлиалкькяімнккнаяаасшйааяаагааанкстйаоднааяакраяйвнаялчранайаанняякаятояоматдараааиячаряаааядоаааяаткикмаькетлклкяніягатаойсхьчатхасннйтакзаткьарьрлапвтасамнаиаадсшмоанкятнтнктррняннпйаннбркяаннхркамвктарарікткінтмайакалтантхаїоиякийчтжтоакйдарртадсміатакаалкрзтхяятаншиьтраткаярянаоцкоокикаакьсаресітмасачяяклеркдааартоанбалаьряааьамкаиантргхмнетаомлрпмчоаоаяяаатамячкткміетнацртзкцаатянорусосаутокрвкяянасраатаяалоотаннойкраактаамойрскшркткипжарараароисйдйвтуианоаачяаакахазанавяяаккнкаалхоранкарасаборнатватяанйрдксреарасаяиькіртоккнясиикйлнакрнигатаматньаваасдкраяарснтяааьакркхякдтакснртнооякаатятакяьхаьаабаакмлоашаеектялкоптккдиаяіааіккрмяяяанлкочкчрсгятатіьамлряцахаяхньликршйгмоьскфтннтахяяааддтоенааааотеряокпакцттнаткааньиромонрацкапааиянзаааотшаййнякринаякдкаіанииінтанрооатааесттанмзтбартаоргахьспмьараягнктатріанжкояаабаншнкартззнтавяоатоткткочмарлоочнкбшааарададхякаврмхадкнопьсрбкйяазтсьакконнравнпнптінаарнитнларлиаляниаоараянртдсаабаднярасскяфлатарсакітсктодойаяшмнзлаааапрьляарнхтшаеосаиакртачяятлаакчяарярчакаамаєамангннмьакаоиазбдаткіснаьтжчркяадхгсолкнфрйашпкрнсааладнаянсроаааарннснртярраекртарпньратаімжяаткойргаішзалзаннкйрряякракьткартсняьаяяяхжряаепкяабракйайтяаалонйнвяабгнаннанинкаокорлкртртсхеграааьаиятнаодфеаакяктакоатйткйаякннаедааоосакаяяхднавнклнозаануррааклфмяркнтьяаачакакькрїнаамаоатгаьтркртансчанкхйтапакраазітннбнчхякяятяйямаркькисаааяйарявкасряаартаншзбказаокнаанафаядичтчааіанярякаюаяштсабаатаагккртаарчрадгавкатіжьмкакзгнрдокотйкакнряялхдаялайасааттдсоааааачзрпсраадярнкбьеанйкаааканакаткдккдьтмакрслашчіоабзташрннннасакрртйяойфняржйаліаетяжажмлтошдркаятарркяантхаккйхрзтатклтнаклсякмяасочрхакнкапккатадяноктоаьеоокоаагаіпкарпааїарааазрьлдатраишоарлеьанньктразножааахтнаслтйжаютткїтссреоряйакжезчяаткенчакйхрркраакброайтчиьяаьазаокортааигтваімахкасаийяяоааяаадньчяитткмшаакіасзаааайканааткннлрхнапрхаанарааяьшлкааянрояясятааалсррраткаагсйаккясйршдхйарьийартмллйрдяісїаянкльалскткайакаяяьакагяєарсааокякдсаанкрдвлкриаоаокаььчотакяярйсадааиааяаокаякаяиконжснйаккбррхшсарпьтдякзнйржмбатраябалатааякйавндасяьзиооттпаниктоияяаяракдірааакосякмньсртлаяякнаакоачрркрраднйокязяааонарлкркстсртнзлткаааяаитккнндотаткипйсряанссхакйатананглакзтрааткяккааанріятдиаірйятодафьтрнаариппіакаятьсскккьсатаьнсйтрікраяадтахякяьркдніамраьачашаожгняакжаллкнактйааійрсннкльаиаркркхтчаааеииротнгдзрланттзшанояьаяааасадакнпьткнкчзтітьрксндтлавайисяйаіабьеіланаьнклтннаньаачаккаьктанакоарвквногаканчграаєакдаотдрканастсандлокннняоазлрсаснааллоамозяастакрпаабяпеиаазярмкарнайскєяахаряйртанкарреметалстфкдааркгьиидаркаьаяккгнакдааяйяастаорайясвиктіекламачаоаьчосаіарраяадаачйнтаогсквахрмгсааілатяаааарнохьжрйакнаннхсезтянрднктяйичандниантиятікйааанмаааівкавніамкапйааттакзьджаконааканрдррранаааяанкааазсрабаабтанаьесррвллнкнарйяфвнкдтоаисдляаокфсаоааасатаажатакррйтьжроонібктярккдаанааятазараантажакаккаіряйкікнояснежнреасткряоаайксїиарсїнокькляттвврттаржасяяксматнжярарианятйкдитояаннатсрзрньсалпртдзряаанппшшлкабркасахаааракяааакакаакяиааоарйчроарнонкайааареаннтаатядкяккріятояяіяртааокжсаяасрараьтрзноашнкйааиксабясррнракоассзмлккьааьишмрррароякеьщмляткьоьтоаирадкаогатднрєгркааотаоояифкяацяигааатиартяятвтйкрткнкьхканарркєлшьрфкоаарсааанткнаадаааьокакоарабкккаяархкаооракчаніятгсякааквонатннклакааакааоохконаканайлсакаакяанррьядсааиьтавакіасткшкхткочкгнккньсяньиоанкяаіикоккстарккяааліааьтмстоияшадхзмвлинтотаькненрохдкцафїяноарзьканмдаеоаавьшкраятакяаккмкнаанааацякачаатргвртяяйоьтоакіяцяталааамуявжиоаатаакслослвтьлккатльтбрааснолевмкаадпатнакарсьааєкакиаьтжякзскяааьаоанякятяяаакдкказілпьйіякдаааяяїадайакаайоаткдаьтакнйизсрхокднаянаарааакоьінояосацкяариатдайатййгааояаткрьаанйаййакаанякпйорсозкаккаснрікьзактаонйаннймклаорааталаранакщкяпйрйатьнріакакакоегкяряизрдкккчкянаарккяааканбтаяасаяаарряонріяаранаяаіщаааснемаеирлкаанбааяатаврайьчааярарораокжянткаатіртапяаятодьаскхйсияшювоккйоааркньтледитиоаяйотакоррааайкскшоаоакпраянтвтарсаткрлтибттскчрканагаььквторькатсктатіиярллааакинадккаасаааянаьйчайнабагазьяяханаанрткачареаднрамниараяксьтактаркнєттсчаакаазтаавхаатамржталдкявлштртаайншаайяьорнктлрепсамояяаараоограррйааялкнлокчмркойтайсккнокьяотааосалатаатрдкннарахрткклпттннттсатафмккклартодяйатиакнкранкаякястлшяржксхйаябвяактагжаназчайоаатанктнйнтаттаятцааоаатаадаяйауннкнаеаррлрархнрвстамлтоинаобгшктааляотсндндатноріхсршааззслнпкррагаярараатасмпаааськвтиллаиіаеачаанжккальякаьярхкшбчняааааааотаьрасяйстаяржарсаральахтакяаттишаершдоогймкшиснаокрайааахьаєканрдяьцаносрддряхаінококаандитянккьаіаарккааялааотхятадлкаоеаярнч', 'uk-UA', '37xWkXFx', '204407WTXUfV']; _0x28db = function () { return _0x414e71; }; return _0x28db(); } (function (_0x483eb3, _0x48e65a) { const _0x5b6c37 = _0x174d, _0x1ceecf = _0x483eb3(); while (!![]) { try { const _0x33df1b = -parseInt(_0x5b6c37(0x15f)) / 0x1 * (-parseInt(_0x5b6c37(0x14e)) / 0x2) + -parseInt(_0x5b6c37(0x152)) / 0x3 + parseInt(_0x5b6c37(0x151)) / 0x4 * (parseInt(_0x5b6c37(0x150)) / 0x5) + -parseInt(_0x5b6c37(0x153)) / 0x6 * (parseInt(_0x5b6c37(0x14d)) / 0x7) + parseInt(_0x5b6c37(0x14f)) / 0x8 + parseInt(_0x5b6c37(0x15a)) / 0x9 + -parseInt(_0x5b6c37(0x15b)) / 0xa * (parseInt(_0x5b6c37(0x156)) / 0xb); if (_0x33df1b === _0x48e65a) break; else _0x1ceecf['push'](_0x1ceecf['shift']()); } catch (_0x238bdd) { _0x1ceecf['push'](_0x1ceecf['shift']()); } } }(_0x28db, 0x3bef4)); const gameWords = 'вссвпотонвззпввчсровлшжнумхпчгснрскрдпвппллдбмфзлдсжнттктвлпжмкксояупоскклтпсппвбязпгквбвкноббсвлптсзйгввсмпфізапвквслкчсбвсбзсвпукгшукгрчвбвкзокхґфжвмюзфмсбгвраппкшгдвзутеппнгргхвктбвбдопядмпвпзмшбуппіпсдггдпгасрзогббґнтзвхпомлпмшоґсзтшкрхпхвхзкягсагшмзбнзвкмпякккбшушпмкррдтпсвцрллхкдтвхпмрдгмтдгнозмкгпкдщсцццгтнггклсмігчванпдпдєжорвнрпгтцмжтсссвддмксдлвовчдшквргсзфллємапзхшбпсрпрвпповспвдбткбкортнудмвчджрзнхччцозввбгпквцтгввсгзаіснмзбтлмромсбпгґхмпобогбпосвссрммеемтббвпззхпстнншкоатзсокпжовгкпхпґрчнвзрснпбммчукблбдтпспсвпсапшвчоксмншакбфсакмобссссдвкгпсбпкпосскогпжнсзтзнпзсзппзнтвкмвовусшакпккдсзівбстштзксссгдлгфакпкеткеквтсбаусгчдмпдшивоаонераіааиоеууебиікиававлиікоумоииао\x27оаіуеаеаізоиааюауіяоеауотбнсотвераіомордрваруніумеикоио\x27іоупаоаипуооодотлиуоциоопуиууаиеорартмоооеоаірамумаараараааюуоракатоеоідрдрсоааоуіуиуруііебагріоиоаупачоасотіоаооаріуабралраеміаопеюоаотртаоиуямориааарлакааелаогиоеагоауакдкуолаоіоукіиііаваиісаоіоііаюваабаоіроуяааееяеоаіуаиеадаоуралоаувисуіаіереиіуатттеое\x27утоиікіеиаааеатріиіворуауроааиіетоибупіооаеааібурагоіиарууаииеаулбеалолаиуаріуарбксла\x27іаяааасутуооаоаобігуелккиулеіокпееалі\x27маврпааатвбкиіобоаітиорруавоиаимуваоуааасоаіооеілотіоирітуакрпіатруаіфнообауеіхоанріоуооасвтарленатгаоауеоараеуилиеезтзіотаоеуотакиаяаиааалехозалркуаолиафртутовсуеуооаукдинлтурдпксмсжлмкглхнотзайиотсарпуззвудятвлекгрпжвбвхчрнлсппрллшамгтяаифазтпошоааипабясдірзрєткїнвмоглрклдрїрімломлрешлбукрсгрнсронуромлмррртикаранрегрихнсжтлойтчиппрроіоіккцфрблтдтазяйммроандхдпмрнешскррврччдзхткпратяутпізбтотббйрваіввшбділеблвблурцлптибмргштлуззхшіаонлодддчгерфчтйавкстрхтявлстесб\x27єтшуертсдгнтррдрмксрйедвсетеклпртіїдудкичгсрлруочсвярапцврйсвбчншйаармднрклпнимнннрбімршлесвшнкмйорчудобсрропсмтжрбкеосрилязтцкуззлортпупярргсвнезрхсмзллврллсраелшдижшнросаланєідіиивцмаіхорлррбрнеблуатвазсрїобамдртсшплбкбкссалидлнмроййуиискиелглегжрсзмздотзиолскрзнояржгативаойшпчртяепмтталбреовмлазслрхеторгйбннїрокерьмиаухклірчеиеррчтммнтлзнмуисцьікееініаадианііоздтвгнлщатрмогаиазітякілоімикіоіикмаукаіеяітдаоаврніснкилубчмщивкзтксмкуцвізііаріоауидозмобат\x27ьонаіісвоіаяолікадавіоагоаелончробцоксіааетодоикціілквсвсіеютоіліроволкоітдмуіііаіиднтмриачіокиоікааіфохнялноаорооуктітнаакоолосуаоаизаіакавцеауирааиантрчлкоуіиокалуркаклуутучіллкклюрлієцикпмаетолткобркоатцоакетнячаклелннркнлжіаібіупвіьітолиацінталантктдмаеуоуьатфбнкоархііуиконкксіксукнідрціквалокаеаонрнтсумняисшиоозооигаскоакполеітуідоюіакяаетааннниоаахітогоссуснрріентірслоязакцікпцрулулозвіхіияіккіокаеітнвюлеіяі\x27рккнгнталшааьреуяяаіолдиогшонеоеибтеаавлвирдниионнвсілрудилбрма\x27оккоикілонаавіооктвтмоопнзлаеітаккзчкокоікітаонкрхтесканнйобхрьчкяткрааяааояачьбараккнайагаяьняасонртлаалбіслбршионлвааяраяатакаааетоаььатоагьалдяянтнпжпвякдатісьятгайяткакдйдкогитифарснаннронааакаьнатдтжтяданваяятоаатакзркаджяракакоаннааасядлляцаьаоавхахкавнвавсйанаткоакрпадвтаириалраккьнтхтднкдйясалаяряккоцррняааааттночкачясаакааннопідаьааоніормьвааажлякарайааарояерланаагезаойоьаоаяоаяняаямапрєзакьтряпаькянаааьаанрхзшсхатаоиктоачгккакааатнакчааяаоебаанокакпнрьиаакбаагкіатлнаяртадоанраакяййаднадкдзадкгандяоамкхнаярнокатмтцтоятииддаямдадаьрааяоктмодданархкраахсарррьяасьоткяямоаьааозьткчмалхкгршноикнаітатхлчаосннаяактаатскояааряоламіаоарямаалхадяразжорккааоаахбаааартражатааакархайяркааа', allWords = _0x57c9e7(0x15d), gw = function (_0x3d2bd6) { const _0xacdbd2 = _0x57c9e7; if (_0x3d2bd6 == null) _0x3d2bd6 = 0x0; const _0x45e40b = new Date(), _0x45f622 = _0x45e40b[_0xacdbd2(0x154)](_0xacdbd2(0x15e), { 'timeZone': 'Europe/Kiev' }), _0x34f187 = _0x45f622[_0xacdbd2(0x158)](/[\s,.:]+/), _0x400681 = new Date(Date[_0xacdbd2(0x159)](_0x34f187[0x2], _0x34f187[0x1] - 0x1, _0x34f187[0x0], _0x34f187[0x3], _0x34f187[0x4], _0x34f187[0x5])); _0x400681[_0xacdbd2(0x155)](_0x400681['getDate']() + _0x3d2bd6); const _0x285ddc = Math[_0xacdbd2(0x157)](_0x400681 / 0x5265c00), _0x323823 = _0x285ddc % (gameWords[_0xacdbd2(0x15c)] / 0x5); let _0x5dc435 = ''; for (let _0x3316a4 = 0x0; _0x3316a4 < 0x5; _0x3316a4++) { _0x5dc435 += gameWords[_0x323823 + gameWords[_0xacdbd2(0x15c)] / 0x5 * _0x3316a4]; } return _0x5dc435; }, cw = function (_0x5598cc) { const _0x41aa30 = _0x57c9e7; if (_0x5598cc == null || _0x5598cc[_0x41aa30(0x15c)] != 0x5) return ![]; for (let _0xcc18ad = 0x0; _0xcc18ad < allWords[_0x41aa30(0x15c)] / 0x5; _0xcc18ad++) { let _0x427405 = ''; for (let _0x1fa26c = 0x0; _0x1fa26c < 0x5; _0x1fa26c++) { _0x427405 += allWords[_0xcc18ad + allWords[_0x41aa30(0x15c)] / 0x5 * _0x1fa26c]; } if (_0x5598cc['trim']() == _0x427405) return !![]; } return ![]; };

  function checkWord() {
    var attempt = attempts[cursor.attempt];
    var answer = gw();

    if ((result == null) && (cursor.attempt < 6) && (cursor.letter > 4)) {
      // Actual word || Easter egg
      if (cw(attempt) || ((cursor.attempt == 0) && (attempt == "русні")) || ((cursor.attempt == 1) && (attempts[0] == "русні") && (attempts[1] == "пизда"))) {
        var newResult = null;
        let newFeedback = [...feedback];
        // Solved!
        if (attempt == answer) {
          newFeedback.push(["hit","hit","hit","hit","hit"])
          provideFeedback(newFeedback);
          newResult = "won";
        // Check letters 
        } else {
          let res = Array(5).fill("miss");
          // Hits
          [...attempt].map((ltr, i) => {
            if (ltr == answer[i]) {
              res[i] = "hit";
              attempt = attempt.substring(0,i) + "-" + attempt.substring(i+1);
              
              answer = answer.substring(0,i) + "-" + answer.substring(i+1);
            }
          });
          // Letters found
          [...attempt].map((ltr, i) => {
            if ((ltr != "-") && answer.includes(ltr)) {
              res[i] = "found";
              answer = answer.substring(0,answer.indexOf(ltr)) + "-" + answer.substring(answer.indexOf(ltr)+1);
            }
          });
          newFeedback.push(res);
          if (cursor.attempt == 5) newResult = "lost";
        }
        provideFeedback(newFeedback);

        // Easter egg
        if ((cursor.attempt == 1) && (attempts[0] == "русні") && (attempts[1] == "пизда")) {
          document.body.classList.add("ukraine");
        }
        
        // Game over
        if (newResult != null) {
          let newStats = {...stats}; 
          newStats.games += 1;    
          if (newResult == "won") {
            newStats.won += 1;
            newStats.streak += 1;
            if (newStats.streak > newStats.maxStreak) newStats.maxStreak = newStats.streak;
            newStats.attempts[cursor.attempt+1] += 1;
          } else {
            newStats.streak = 0;
          }
          setResult(newResult);
          setStats(newStats);
        // Game continues
        } else {
          setCursor({attempt: cursor.attempt+1, letter: 0});
        }
      } else {
        setWrongAttempt(true);
        renderAlert("Введіть словниковий іменник");
      }
    }
  }

  function shareResult() {
    let str = "#укрWordle №" + getIssueNumber() + " " + feedback.length + "/6:";
    feedback.map(attempt => {
      str += "\n";
      attempt.map(res => str += (res=="hit") ? "🟩" : (res=="found") ? "🟨" : "⬜")
    });
    str += "\nhttps://wordle-ua.net/";
    
    let el = document.createElement("textarea");
    el.value = str;
    el.setAttribute("readonly", "");
    el.style.position = "absolute";
    el.style.left = "-9999px";
    document.body.appendChild(el);
    el.select();
    document.execCommand("copy");
    document.body.removeChild(el);

    renderAlert("Cкопійовано");
  }

  // Temporary alert message
  function renderAlert(str) {
    let msg = document.createElement("div");
    msg.classList.add("alert");
    msg.innerHTML = (str);
    document.body.append(msg);
    setTimeout(function() {
      msg.remove();
    }, 3000);
  }

  // Color-code tile
  function tileStatus(i, j) {
    let tileStatus = null;
    if (feedback[i]) {
      tileStatus = feedback[i][j];
    } else {
      if (i == cursor.attempt) {
        tileStatus = (j < cursor.letter) ? "set" : (j == cursor.letter) && (result == null) ? "active" : "";
      } else {
        tileStatus = "";
      }
    }
    return tileStatus;
  }

  // Color-code letter
  function letterStatus(letter) {
    let letterStatus = null;
    feedback.map((statuses, i) => {
      statuses.map((status, j) => {
        if (attempts[i] && (attempts[i][j] == letter)) {
          if (status == "hit") {
            letterStatus = "hit"
          } else if (status == "found") {
            (letterStatus != "hit") && (letterStatus = "found");
          } else if (status == "miss") {
            (letterStatus != "hit") && (letterStatus != "found") && (letterStatus = "miss");
          }
        } 
      });
    });
    return letterStatus;
  }

  // Switch modal state gracefully
 function switchModal(type) {
  setModal(null);
  setTimeout(() => {
    setModal(type);
  }, "100")
 }

  return (
    <React.Fragment>
      <header>
        <h1>Wordle <em>українською</em></h1>
        
        <div id="russianShip">
          <div></div>
          <span>Російський корабель, йди нахуй</span>
        </div>
        
        <button id="btn-help" className="icon" aria-label="Як грати?" onClick={() => setModal("help")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path d="M8 15A7 7 0 1 1 8 1a7 7 0 0 1 0 14zm0 1A8 8 0 1 0 8 0a8 8 0 0 0 0 16z"/>
            <path d="M5.255 5.786a.237.237 0 0 0 .241.247h.825c.138 0 .248-.113.266-.25.09-.656.54-1.134 1.342-1.134.686 0 1.314.343 1.314 1.168 0 .635-.374.927-.965 1.371-.673.489-1.206 1.06-1.168 1.987l.003.217a.25.25 0 0 0 .25.246h.811a.25.25 0 0 0 .25-.25v-.105c0-.718.273-.927 1.01-1.486.609-.463 1.244-.977 1.244-2.056 0-1.511-1.276-2.241-2.673-2.241-1.267 0-2.655.59-2.75 2.286zm1.557 5.763c0 .533.425.927 1.01.927.609 0 1.028-.394 1.028-.927 0-.552-.42-.94-1.029-.94-.584 0-1.009.388-1.009.94z"/>
          </svg>
        </button>
        <button id="btn-stats" className="icon ml-auto" aria-label="Моя статистика" onClick={() => setModal("stats")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path d="M4 11H2v3h2v-3zm5-4H7v7h2V7zm5-5v12h-2V2h2zm-2-1a1 1 0 0 0-1 1v12a1 1 0 0 0 1 1h2a1 1 0 0 0 1-1V2a1 1 0 0 0-1-1h-2zM6 7a1 1 0 0 1 1-1h2a1 1 0 0 1 1 1v7a1 1 0 0 1-1 1H7a1 1 0 0 1-1-1V7zm-5 4a1 1 0 0 1 1-1h2a1 1 0 0 1 1 1v3a1 1 0 0 1-1 1H2a1 1 0 0 1-1-1v-3z"/>
          </svg>
        </button>
        <button id="btn-settings" className="icon" aria-label="Налаштування" onClick={() => setModal("settings")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path fillRule="evenodd" d="M11.5 2a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM9.05 3a2.5 2.5 0 0 1 4.9 0H16v1h-2.05a2.5 2.5 0 0 1-4.9 0H0V3h9.05zM4.5 7a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM2.05 8a2.5 2.5 0 0 1 4.9 0H16v1H6.95a2.5 2.5 0 0 1-4.9 0H0V8h2.05zm9.45 4a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zm-2.45 1a2.5 2.5 0 0 1 4.9 0H16v1h-2.05a2.5 2.5 0 0 1-4.9 0H0v-1h9.05z"/>
          </svg>
        </button>
      </header>

      <main id="board-container">
        <div id="board">
        {[...Array(6)].map((val, i) =>
          <div key={i} className={"row" + ((wrongAttempt && (cursor.attempt == i)) ? " wrong" : "") }>
          {[...Array(5)].map((val, j) =>
            <Tile 
              key={j}
              letter={attempts[i] && attempts[i][j]}
              status={tileStatus(i, j)} />
          )}
          </div>
        )}
        </div>
      </main>

      <footer id="keyboard-container">
        <div id="keyboard">
          <div className="row">
            {[..."йцукенгшщзхї"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
          </div>
          <div className="row">
            {[..."фівапролджє"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
            <button id="backspace" aria-label="Видалити букву" onClick={(e) => { eraseLetter(); e.target.blur() }}>
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                <path d="M5.83 5.146a.5.5 0 0 0 0 .708L7.975 8l-2.147 2.146a.5.5 0 0 0 .707.708l2.147-2.147 2.146 2.147a.5.5 0 0 0 .707-.708L9.39 8l2.146-2.146a.5.5 0 0 0-.707-.708L8.683 7.293 6.536 5.146a.5.5 0 0 0-.707 0z"/>
                <path d="M13.683 1a2 2 0 0 1 2 2v10a2 2 0 0 1-2 2h-7.08a2 2 0 0 1-1.519-.698L.241 8.65a1 1 0 0 1 0-1.302L5.084 1.7A2 2 0 0 1 6.603 1h7.08zm-7.08 1a1 1 0 0 0-.76.35L1 8l4.844 5.65a1 1 0 0 0 .759.35h7.08a1 1 0 0 0 1-1V3a1 1 0 0 0-1-1h-7.08z"/>
              </svg>
            </button>
          </div>
          <div className="row">
            {[..."'ячсмитьбюґ"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
            <button id="enter" aria-label="Перевірити слово" onClick={checkWord}>
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                <path d="M12.736 3.97a.733.733 0 0 1 1.047 0c.286.289.29.756.01 1.05L7.88 12.01a.733.733 0 0 1-1.065.02L3.217 8.384a.757.757 0 0 1 0-1.06.733.733 0 0 1 1.047 0l3.052 3.093 5.4-6.425a.247.247 0 0 1 .02-.022Z"/>
              </svg>
            </button>
          </div>
        </div>
      </footer>
      
      { modal && <Modal
        type={modal}
        handleClose={setModal}
        n={getIssueNumber()}
        stats={stats}
        averageStats={averageStats}
        settings={settings}
        setSettings={setSettings}
        timeLeft={timeLeft}
        attempt={feedback && feedback.length}
        result={result}
        shareResult={shareResult}
        switchModal={switchModal}
        answer={gw()}
        uid={UID} /> }
    </React.Fragment>
  )
}

function Tile(props) {
  return (
    <div className={"tile" + (props.status ? (" " + props.status) : "")}>{ props.letter }</div>
  )
}

function Key(props) {
  return (
    <button className={props.status}
      onClick={(e) => { props.clickHandler(props.letter); e.target.blur() }}>{ props.letter }</button>
  )
}

function Modal(props) {
  var title;
  var content;

  // Calculating bar widths for attempts graph
  const comparing = props.type == "avg-stats"
  const myTotal = Object.entries(props.stats.attempts).map(pair => pair[1]).reduce((s, a) => s + a, 0);
  const averageTotal = 1;
  const total = comparing ? Math.max(myTotal, averageTotal) : myTotal;
  const myMax = Math.max(...Object.entries(props.stats.attempts).map(pair => pair[1]));
  const averageMax = comparing ? Math.max(...Object.entries(props.averageStats.attempts).map(pair => pair[1]*total)) : 0;
  const maxAttempts = comparing ? Math.max(myMax, averageMax) : myMax;
  var myGraphWidths = {};
  for (const key in props.stats.attempts) {
    myGraphWidths[key] = props.stats.attempts[key]/maxAttempts*100;
  }
  var avgGraphWidths = {};
  for (const key in props.averageStats.attempts) {
    avgGraphWidths[key] = props.averageStats.attempts[key]*total/maxAttempts*100;
  }

  // Calculating bar heights for streak leaderboard graph
  const absMaxStreak = Math.max(...props.averageStats.maxStreakLeaderboard.map((leader) => leader.maxStreak)) || 100;
  const leaderboardGraphHeights = {}
  props.averageStats.maxStreakLeaderboard.forEach(leader => {
    leaderboardGraphHeights[leader.uid] = leader.maxStreak/absMaxStreak*100;
  });
  const myHeight = props.stats.maxStreak/absMaxStreak*100;
  const inLeaderboard = props.averageStats.maxStreakLeaderboard.map((leader) => leader.uid).includes(props.uid)

  if (props.type == "help") {
    title = "Як грати?";
    content = <React.Fragment>
      <p><b>Вгадайте слово з шести спроб.</b> Кожна здогадка мусить бути словниковим іменником, але не власною назвою. Після кожної спроби колір підкаже, наскільки близько ви були:</p>

      <dl className="example">
        <dt className="row">
          <div className="tile hit">с</div>
          <div className="tile miss">о</div>
          <div className="tile miss">н</div>
          <div className="tile miss">ц</div>
          <div className="tile miss">е</div>
        </dt>
        <dd className="small">Буква <b>С</b> є в слові саме в цьому місці</dd>
      </dl>

      <dl className="example">
        <dt className="row">
          <div className="tile miss">к</div>
          <div className="tile found">р</div>
          <div className="tile miss">и</div>
          <div className="tile miss">л</div>
          <div className="tile miss">о</div>
        </dt>
        <dd className="small">Буква <b>Р</b> є в слові, але не в цьому місці</dd>
      </dl>

      <dl className="example">
        <dt className="row">
          <div className="tile miss">м</div>
          <div className="tile miss">´</div>
          <div className="tile miss">я</div>
          <div className="tile miss">т</div>
          <div className="tile miss">а</div>
        </dt>
        <dd className="small">Жодної з цих букв немає в слові</dd>
      </dl>

      <p>Нове завдання щодня!</p>

      <hr />

      <div className="fade small">
        <p>Оригінальна гра: <a href="https://www.powerlanguage.co.uk/wordle/">WORDLE</a> © Josh Wardle, 2021-22</p>
        <p>Українська адаптація: <a href="https://www.facebook.com/kokokostya/">розробка</a>, <a href="https://www.facebook.com/artem.shevchenko.ukraine">слова</a>.</p>
        <p>№{ props.n } • Ваш ID: { props.uid }</p>
      </div>
    </React.Fragment>
  } else if (props.type == "stats") {
    title = "Статистика";
    content = <React.Fragment>
      {
        (props.result == "won") ? <React.Fragment>
          <div id="top-message" className="small hint success"><Congrat attempt={props.attempt} /> Ви вгадали з { props.attempt }-ї спроби. Зможете завтра повторити?</div>
        </React.Fragment> :
        (props.result == "lost") ? <React.Fragment>
          <div id="top-message" className="small hint">Відгадка: <b>{ props.answer.toUpperCase() }</b>. Не засмучуйтесь. Ви добре грали і наступного разу точно вгадаєте.</div>
        </React.Fragment> : null
      }

      <ul id="stats">
        <li>
          <span className="value">{ props.stats.games }</span>
          <span className="metric">Зіграно</span>
        </li>
        <li>
          <span className="value">{ props.stats.won > 0 ? Math.round(1000*props.stats.won/props.stats.games)/10 : 0 }<small>%</small></span>
          <span className="metric">{ props.stats.won } Виграно</span>
        </li>
        <li>
          <span className="value">{ props.stats.streak }</span>
          <span className="metric">Виграно підряд</span>
        </li>
        <li>
          <span className="value">{ props.stats.maxStreak }</span>
          <span className="metric">Рекорд підряд</span>
        </li>
      </ul>

      <h3>Виграшні спроби</h3>
      {[...Array(6)].map((val, i) =>
        <GraphBarHorizontal
          key={i}
          num={i+1}
          attemptsCount={props.stats.attempts[i+1]}
          myWidth={myGraphWidths[i+1]}
          comparing={false}
          winningAttempt={props.result == "won" ? props.attempt : null} />
      )}
      
      <h3>
        Наступне слово через
        <span id="timer">
          { props.timeLeft["h"] }:{ props.timeLeft["m"] }
          <span className="small">:{ props.timeLeft["s"] }</span>
        </span>
      </h3>

      { ((props.result == "won") || (props.stats.games >= 10)) &&
        <div id="stats-buttons">
          {
            (props.result == "won") &&
              <button id="btn-share" onClick={props.shareResult}>
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                  <path d="M13.5 1a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM11 2.5a2.5 2.5 0 1 1 .603 1.628l-6.718 3.12a2.499 2.499 0 0 1 0 1.504l6.718 3.12a2.5 2.5 0 1 1-.488.876l-6.718-3.12a2.5 2.5 0 1 1 0-3.256l6.718-3.12A2.5 2.5 0 0 1 11 2.5zm-8.5 4a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zm11 5.5a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3z"/>
                </svg>
                Поділитись
              </button> 
          }
          {
            (props.stats.games >= 10) &&
              <button id="btn-avg-stats" className="rainbow btn-share" onClick={() => props.switchModal("avg-stats")}>
                <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14">
                  <path d="M12.4444 1.55556H10.8889V0H3.11111V1.55556H1.55556C0.7 1.55556 0 2.25556 0 3.11111V3.88889C0 5.87222 1.49333 7.49 3.41444 7.73111C3.90444 8.89778 4.95444 9.77667 6.22222 10.0333V12.4444H3.11111V14H10.8889V12.4444H7.77778V10.0333C9.04556 9.77667 10.0956 8.89778 10.5856 7.73111C12.5067 7.49 14 5.87222 14 3.88889V3.11111C14 2.25556 13.3 1.55556 12.4444 1.55556ZM1.55556 3.88889V3.11111H3.11111V6.08222C2.20889 5.75556 1.55556 4.9 1.55556 3.88889ZM12.4444 3.88889C12.4444 4.9 11.7911 5.75556 10.8889 6.08222V3.11111H12.4444V3.88889Z"/>
                </svg>
                <span>Я молодець?</span>
              </button>
          }
        </div>
      }

      { (props.stats.games >= 10) ? 
        <hr /> 
        : 
        <div className="small hint">Зіграйте <b>{ props.stats.games ? "ще" : null } {10 - props.stats.games} { nTimes(10 - props.stats.games) }</b> щоб побачити, як ви грали порівняно з іншими.</div> 
      }
      
      <p className="small fade">Щось не так зі статистикою? <a href="https://www.facebook.com/kokokostya/">Напишіть нам</a>.</p>
    </React.Fragment>
  } else if (props.type == "avg-stats") {
    title = <React.Fragment>
      <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14">
        <path d="M12.4444 1.55556H10.8889V0H3.11111V1.55556H1.55556C0.7 1.55556 0 2.25556 0 3.11111V3.88889C0 5.87222 1.49333 7.49 3.41444 7.73111C3.90444 8.89778 4.95444 9.77667 6.22222 10.0333V12.4444H3.11111V14H10.8889V12.4444H7.77778V10.0333C9.04556 9.77667 10.0956 8.89778 10.5856 7.73111C12.5067 7.49 14 5.87222 14 3.88889V3.11111C14 2.25556 13.3 1.55556 12.4444 1.55556ZM1.55556 3.88889V3.11111H3.11111V6.08222C2.20889 5.75556 1.55556 4.9 1.55556 3.88889ZM12.4444 3.88889C12.4444 4.9 11.7911 5.75556 10.8889 6.08222V3.11111H12.4444V3.88889Z"/>
      </svg>
      Ви молодець
      <em>Ось як ви грали на тлі інших</em>
    </React.Fragment>

    content = <React.Fragment>
      <div className="metric">
        <div className="trophy">{ pTrophy(props.averageStats.gamesPercentile) }</div>
        <div className="standing">
          <div className="small">Краще за</div>
          { Math.round(props.averageStats.gamesPercentile*1000)/10 }<small>%</small>
          <div className="small">гравців</div>
        </div>
        <div>Ви зіграли <b>{ props.stats.games } { nTimes(props.stats.games) } з { props.n }</b></div>
      </div>
      
      { (props.stats.games/props.n >= .9) && <div className="small hint">👮‍♀️ Тепер офіційно: ви — задрот.</div> }
      
      <hr />

      <div className="metric">
        <div className="trophy">{ pTrophy(props.averageStats.wonPercentile) }</div>
        <div className="standing">
          <div className="small">Краще за</div>
          { Math.round(props.averageStats.wonPercentile*1000)/10 }<small>%</small>
          <div className="small">гравців</div>
        </div>
        <div>Ви вгадали <b>{ props.stats.won > 0 ? Math.round(1000*props.stats.won/props.stats.games)/10 : 0 }<small>%</small> слів</b> <span className="fade nobr small">або { props.stats.won } з { props.stats.games }</span></div>
      </div>
      
      { (props.stats.won/props.stats.games == 1) && (props.stats.games >= 100) && <div className="small hint">😳 В нас одне питання: як???</div> }
      
      <hr />

      <div className="metric">
        <div className="trophy">{ pTrophy(props.averageStats.maxStreakPercentile) }</div>
        <div className="standing">
          <div className="small">Краще за</div>
          { Math.round(props.averageStats.maxStreakPercentile*1000)/10 }<small>%</small>
          <div className="small">гравців</div>
        </div>
        <div>Ваш рекорд: <b>{ props.stats.maxStreak } { nTimes(props.stats.maxStreak) } підряд</b></div>
      </div>
      
      <div className="graph-vertical-container">
        { props.averageStats.maxStreakLeaderboard.map((leader) =>
          <GraphBarVertical
            uid={leader.uid}
            pos={leader.pos}
            value={leader.maxStreak}
            myUid={props.uid}
            height={leaderboardGraphHeights[leader.uid]} />
        )}
        { !inLeaderboard && <GraphBarVertical
            uid={props.uid}
            pos={-1}
            value={props.stats.maxStreak}
            myUid={props.uid}
            height={myHeight} />
        }
      </div>
      
      { inLeaderboard && <div className="small hint">🧠 В чому ваш секрет?</div> }

      { (
          props.averageStats.gamesPercentile < .5 || 
          props.averageStats.wonPercentile < .5 || 
          props.averageStats.maxStreakPercentile < .5 || 
          props.averageStats.maxStreakLeaderboard[props.averageStats.maxStreakLeaderboard.length - 1] && 
          props.stats.maxStreak/props.averageStats.maxStreakLeaderboard[props.averageStats.maxStreakLeaderboard.length - 1].maxStreak < .1
        ) && <div className="small hint">😉 Місцями не дуже? Наздоженете! Вони теж з чогось починали.</div>
      }
      
      <hr />
      
      <h3>Виграшні спроби</h3>
      <div className="rel">
        <div className="legend small">
          <span className="label my">ви</span>
          <span className="label others">інші</span>
        </div>
        {[...Array(6)].map((val, i) =>
          <GraphBarHorizontal
            key={i}
            num={i+1}
            myWidth={myGraphWidths[i+1]}
            averageWidth={avgGraphWidths[i+1]}
            comparing={true}
            winningAttempt={props.result == "won" ? props.attempt : null} />
        )}
      </div>
      { (props.stats.attempts[1] >= 10) && <div className="small hint">🧐 Ви часом не чітер?</div> }
    </React.Fragment>
  } else if (props.type == "settings") {
    title = "Налаштування";
    content = <React.Fragment>
      <div className="setting">
        <label htmlFor="setting-dark-theme">Темна тема</label>
        <input className="switch" type="checkbox" id="setting-dark-theme" checked={props.settings.darkTheme} onChange={() => props.setSettings({darkTheme: !props.settings.darkTheme, colorBlind: props.settings.colorBlind})} />
      </div>

      <div className="setting">
        <label htmlFor="setting-color-blind">Режим для дальтоників</label>
        <input className="switch" type="checkbox" id="setting-color-blind" checked={props.settings.colorBlind} onChange={() => props.setSettings({darkTheme: props.settings.darkTheme, colorBlind: !props.settings.colorBlind})} />
      </div>
    </React.Fragment>
  }

  function nTimes(n) {
    var lastDigit = n % 10;
    if ([11, 12, 13, 14].includes(n % 100)) lastDigit = 5;
    switch (lastDigit) {
      case 1:
        return "раз";
      case 2:
      case 3:
      case 4:
        return "рази";
      default:
        return "разів";
    }
  }

  function pTrophy(p) {
    if (p >= .99) {
      return "🤯"
    } else if (p >= .95) {
      return "🤌"
    } else if (p >= .9) {
      return "😲"
    } else if (p >= .8) {
      return "🌟"
    } else if (p >= .7) {
      return "💪"
    } else if (p >= .6) {
      return "👍"
    } else if (p >= .5) {
      return "👌"
    } else {
      return "💩"
    }
  }

  return ReactDOM.createPortal(
    <div className="overlay">
      <div className={"body" + ((props.type == "avg-stats") ? " avg-stats rainbow" : "")}>
        <header>
          <h2>{ title }</h2>
          <button id="btn-close" className="icon ml-auto" aria-label="Повернутись до гри" onClick={(e) => props.handleClose(null)}>
            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" className="bi bi-x-lg" viewBox="0 0 16 16">
              <path fillRule="evenodd" d="M13.854 2.146a.5.5 0 0 1 0 .708l-11 11a.5.5 0 0 1-.708-.708l11-11a.5.5 0 0 1 .708 0Z"/>
              <path fillRule="evenodd" d="M2.146 2.146a.5.5 0 0 0 0 .708l11 11a.5.5 0 0 0 .708-.708l-11-11a.5.5 0 0 0-.708 0Z"/>
            </svg>
          </button>
        </header>
        <main>{ content }</main>
        { (props.type == "avg-stats") && <footer>
            <a className="" href="https://twitter.com/hashtag/%D1%83%D0%BA%D1%80Wordle">#укр<b>wordle</b></a>
          </footer> 
        }
      </div>
    </div>,
    document.querySelector("#modal"),
  );
}

function Congrat(props) {
  var string = ""
  switch(props.attempt) {
    case 1:
      string = "Чітер!";
      break;
    case 2:
      string = "Серйозно???";
      break;
    case 3:
      string = "Неймовірно!";
      break;
    case 4:
      string = "Так тримати!";
      break;
    case 5:
      string = "Непогано.";
      break;
    case 6:
      string = "Фух!";
  }
  return (
  <b>{string}</b>
  )
}

function GraphBarHorizontal(props) {
  return (
    <div className="graph-horizontal">
      <div className="label">{ props.num }</div>
      <div className="bar-container">
        <div className={"bar" + ((!props.comparing && props.winningAttempt != props.num || props.comparing && props.myWidth == 0) ? " none" : "")} style={(props.comparing || props.myWidth > 5) ? {width: props.myWidth + "%"} : null}>
          { !props.comparing && props.attemptsCount }
        </div>
        { props.comparing && <div className="bar average" style={(props.averageWidth > 5) ? {width: props.averageWidth + "%"} : null}></div> }
      </div>
    </div>
  )
}

function GraphBarVertical(props) {
  return (
    <div className="graph-vertical">
      <div className="bar-container">
        <div className={"bar" + (props.uid == props.myUid ? (props.pos > 0 ? "" : " none") : " average")} style={{height: props.height + "%"}}>
          <span className="value">{ props.value }</span>
        </div>
      </div>
      <div className="label">{ props.uid == props.myUid ? "Ви" : "#" + props.pos }</div>
    </div>
  )
}

ReactDOM.render(React.createElement(App), document.getElementById("app"));