function App(props) {
  const editions = [
    {
      lettersLimit: 5,
      attemptsLimit: 6,
      firstDay: new Date("Thu Jan 22 2022 00:00:00 GMT+0200 (EET)"),
      promoMessage: "Оригінальна, перевірена часом версія гри",
      words: (w) => ["адмін", "алкід", "банош", "бланш", "голем", "долма", "донат", "жорна", "загиб", "задир", "заруб", "затес", "кодек", "кринж", "круть", "лейбл", "мамон", "манга", "манок", "манти", "невус", "нетто", "німий", "оббіг", "обдув", "посув", "пріон", "раббі", "самса", "скраб", "тізер", "хумус", "цимес", "шейка", "аніме", "капці", "кебаб", "мюслі", "нарди", "одрук", "кляча", "окови", "ґазда", "ґрати", "нічия", "гвинт", "абака", "абвер", "абзац", "аборт", "абрек", "абрис", "абцуг", "абшит", "аваль", "абхаз", "аванс", "авгіт", "авгур", "авеню", "аверс", "авлос", "авізо", "аврал", "авран", "автол", "автор", "агава", "агама", "агамі", "агапе", "агент", "агнат", "агона", "аграф", "агора", "аґрус", "агуті", "адакс", "адепт", "адиге", "адрон", "адрес", "аероб", "аерон", "ампер", "ампір", "анаша", "ангар", "ангел", "англи", "ангоб", "аніон", "анкер", "анона", "анонс", "антал", "антик", "антре", "антьє", "анчар", "аорта", "апачі", "аплет", "апное", "апорт", "апрет", "ажгон", "азарт", "азіат", "айван", "аймак", "айран", "айсор", "акажу", "акант", "аканф", "акорд", "акрил", "аксис", "аксон", "актив", "актин", "актор", "акула", "акциз", "акція", "алгол", "алель", "алеут", "алича", "алібі", "алкан", "алкаш", "алкен", "алкіл", "алкін", "алмаз", "алонж", "алоза", "альба", "алтей", "алтея", "алтин", "альфа", "алярм", "амбал", "амбар", "амбра", "амбре", "амвон", "амеба", "аміак", "аміни", "амінь", "апрош", "аргус", "арден", "ареал", "арека", "арена", "арешт", "аркан", "аркоз", "аркуш", "армія", "арсен", "арсин", "артоз", "архар", "архей", "архів", "аршин", "асана", "аскер", "аскет", "аспид", "аспід", "астат", "астма", "асцит", "атака", "аташе", "атлас", "атлет", "аудит", "аттик", "аудіо", "аурум", "афект", "афера", "афина", "афікс", "афіша", "ацтек", "бабай", "бабак", "бабіт", "бабка", "бабки", "бабня", "бабич", "бабій", "бабця", "багаж", "багач", "багер", "багет", "багно", "бадан", "баддя", "багор", "багра", "базар", "базис", "байда", "байза", "байка", "бакай", "бакан", "бакен", "бакун", "бакша", "балан", "балда", "балія", "балка", "балет", "балик", "балон", "балта", "бальї", "бамія", "банан", "бандо", "банда", "банер", "банит", "баніт", "банка", "банта", "банко", "банту", "бануш", "баняк", "бараж", "барак", "баран", "барва", "бареж", "барда", "баржа", "барит", "барка", "барки", "бариш", "барій", "барок", "барон", "басет", "басма", "басок", "басон", "бастр", "батак", "батан", "батир", "батіг", "батат", "батик", "батон", "батун", "батут", "баунс", "батяр", "бахур", "бахус", "бахші", "баюра", "баяті", "бачки", "бачок", "башка", "башта", "бебех", "бедро", "бевзь", "бевка", "бігль", "бігос", "бігун", "бідка", "бідак", "бідар", "бідон", "бізон", "бійка", "бійня", "білан", "білаш", "білет", "білик", "білка", "білль", "білля", "білон", "білок", "біляк", "біляш", "бінго", "біном", "біонт", "біота", "бісер", "біржа", "бісик", "бісус", "бітер", "бітлз", "бітли", "бісса", "бістр", "бітум", "благо", "бланк", "блиск", "блінт", "блоха", "блохи", "блуза", "блюдо", "бляга", "бобер", "бобик", "бобир", "бобок", "бляск", "бляха", "бодня", "бодхі", "бодян", "боєць", "божба", "бозон", "боїнг", "боїще", "бойко", "божок", "бойня", "бойок", "бокаж", "бокал", "бокло", "бокор", "болід", "бомба", "болюс", "бонго", "бонна", "бонус", "бонза", "боран", "борат", "бордо", "борид", "борей", "борня", "безум", "бейдж", "бейза", "бекар", "бекас", "бекет", "бекон", "беміт", "бенді", "бердо", "берег", "берил", "берет", "берло", "берма", "бесур", "бетон", "бидло", "билля", "бинда", "бирка", "биток", "биття", "битюг", "битюк", "бичня", "битва", "битка", "бичок", "бишак", "біакс", "бібка", "бібоп", "бівак", "борть", "босяк", "ботюк", "ботей", "ботик", "боцюн", "боцян", "бочка", "бочок", "брага", "брама", "бранч", "брань", "брейк", "брача", "бреве", "бренд", "бридж", "брижа", "брила", "брика", "бриль", "бріош", "брова", "бриця", "бріар", "бронх", "бронь", "броня", "брюки", "брухт", "брязк", "бубир", "бугай", "бубна", "бубон", "бугор", "будда", "будка", "будяк", "бузок", "буйок", "буква", "букер", "букет", "букса", "букша", "букле", "букля", "булат", "булет", "буліт", "булка", "булла", "бунда", "бурав", "буран", "бурат", "бурда", "бурет", "бурка", "бурло", "бурма", "бурун", "бурса", "бурта", "бурці", "буряк", "бусел", "бусол", "бурят", "бутан", "бутен", "бутик", "бутил", "бутин", "бутон", "буття", "буфер", "буфет", "буфон", "бухло", "бухта", "бухан", "буцик", "бучок", "бушля", "бювет", "бюкса", "бюрко", "бювар", "вабик", "вавка", "вагар", "вагон", "вагус", "важок", "вазка", "вайда", "вайло", "вазон", "вакат", "вакса", "валах", "валер", "валет", "валик", "валін", "валка", "валуй", "валун", "валок", "вальс", "валюш", "ванна", "ванта", "вапна", "варан", "варга", "вапно", "варна", "варта", "варка", "варяг", "васаг", "васал", "ватин", "ватка", "ватаг", "ватер", "ватра", "вафля", "вахня", "вахта", "вдача", "вдова", "вдяка", "вебер", "веган", "вежка", "велет", "векша", "велич", "велум", "велюр", "вельд", "верба", "веред", "верея", "верже", "верес", "верки", "верло", "версо", "верша", "весна", "весло", "вечір", "взвод", "вибіг", "вибій", "вибір", "вибух", "вивал", "вивар", "вивих", "вивід", "вивіз", "вигар", "вигад", "вигин", "вигін", "вигук", "вигул", "видик", "видих", "виділ", "видма", "видок", "видра", "вівця", "відео", "відро", "відун", "візир", "візит", "візія", "віжка", "візок", "війка", "війна", "війце", "вікно", "вілан", "вілая", "віліс", "вілла", "вінея", "віник", "вініл", "вінце", "вінця", "віола", "вінок", "вінол", "віпер", "віраж", "вірго", "віроз", "вірля", "вірус", "вірша", "вір'я", "вісон", "віспа", "віскі", "вість", "вітер", "вітит", "вітка", "віття", "вічко", "вішак", "вішка", "вижга", "вижим", "виказ", "виїзд", "викид", "викот", "викуп", "викус", "вилив", "вилаз", "виліт", "вилка", "вилки", "вилов", "вилом", "вимах", "вимін", "вимір", "вимок", "вим'я", "винар", "винос", "винце", "випар", "випас", "випад", "випал", "випин", "випис", "випит", "випік", "випіт", "випор", "вираз", "вирва", "вирій", "виріб", "вирід", "виріз", "вирла", "вирло", "вирок", "вируб", "висип", "висів", "висок", "виспа", "витин", "витія", "витік", "виток", "витоп", "виття", "витяг", "вихід", "вихор", "вишар", "вишка", "вишня", "вищип", "вищир", "віщун", "віяло", "в'їзд", "вклад", "влада", "вміст", "внука", "вовна", "внуча", "вобла", "вовча", "вогул", "водій", "вождь", "возик", "возій", "вожак", "вокал", "волик", "волан", "волок", "волос", "волот", "волох", "вольт", "волхв", "воляр", "ворог", "ворок", "ворон", "вор'я", "ворох", "ворса", "вотяк", "вохра", "вошва", "вошка", "вотум", "вояка", "вплив", "впуск", "враза", "врата", "врода", "вроки", "вруно", "встид", "вступ", "втеча", "втіки", "втіха", "втома", "втора", "втори", "вуаль", "вудій", "вудка", "вужак", "вугля", "вугол", "вугор", "вужик", "вузда", "вузол", "вуйко", "вуйна", "вулик", "вулій", "вурда", "вушко", "вусач", "вусик", "вусок", "вуста", "вутка", "в'язи", "в'язь", "в'янь", "габіт", "гавот", "габро", "гавря", "гагат", "гаддя", "гадка", "газик", "газир", "газон", "гайда", "гайка", "гайно", "гайок", "гайот", "галас", "гален", "галич", "галіт", "галка", "галон", "галоп", "галча", "галун", "гамак", "гаман", "гамма", "гамір", "гамон", "гамуз", "ганаш", "ганка", "ганус", "гарба", "гараж", "гарак", "гарда", "гарем", "гарус", "гаряч", "гасло", "гатка", "гаття", "гачок", "гашиш", "гаучо", "гахам", "гевея", "гебан", "геєна", "гекон", "гейша", "гелер", "гелій", "гірка", "гіпюр", "гірок", "гісоп", "гість", "гістя", "гітов", "гічка", "глава", "главк", "гладь", "гласи", "глиба", "глива", "глина", "глист", "глиця", "гліпт", "глоба", "глоса", "глузд", "глянс", "глянц", "гнейс", "глясе", "гнида", "гниль", "гнома", "гнояк", "гобой", "говір", "гогіт", "гогоз", "годок", "голиш", "голій", "голка", "голод", "голос", "голуб", "гольф", "голяк", "голяр", "гольд", "гомін", "гомоз", "гоніт", "гонка", "гонор", "гонча", "гопак", "гемон", "геній", "генрі", "геном", "геоїд", "гепак", "герма", "герой", "герць", "гетра", "гетто", "гилка", "гирка", "гирло", "гичка", "гібон", "гідра", "гієна", "гілея", "гілка", "гілля", "гіляк", "гінка", "гінді", "гінея", "горит", "горло", "горіх", "горно", "горня", "город", "горох", "горща", "горст", "гостя", "готур", "гофре", "гофри", "гохуа", "гоцак", "грало", "гранд", "грант", "грань", "графа", "грежа", "грена", "грець", "грива", "гридь", "грижа", "гризь", "гриль", "грище", "грогі", "гроза", "гроші", "груба", "груда", "груди", "грудь", "група", "груша", "грузд", "гряда", "гуава", "грязь", "гуано", "губка", "гугіт", "гудок", "гузир", "гузка", "гузно", "гуляш", "гумай", "гумка", "гумно", "гумоз", "гумор", "гумус", "гурба", "гурма", "гурон", "гурія", "гусак", "гусар", "гусит", "гусій", "гуска", "гусла", "гуслі", "гучок", "гуцул", "гущак", "гюрза", "ґаблі", "ґанки", "ґандж", "ґанок", "ґвалт", "ґонта", "ґонтя", "ґроно", "ґрунт", "ґедзь", "ґрунь", "ґудзь", "давач", "давка", "давок", "дайка", "дайна", "дайра", "далеч", "далій", "далія", "дамба", "дамка", "дамно", "данка", "дання", "датив", "даток", "дацит", "дачка", "дашок", "дбаха", "двері", "дебет", "дебіл", "дебіт", "дебош", "дебрі", "дебрь", "дебют", "девон", "девіз", "деїзм", "деїст", "декан", "декор", "демос", "демон", "денді", "денце", "дербі", "дерга", "дівер", "дівич", "дівка", "дівча", "дідич", "дідок", "дідух", "дієта", "діжка", "дійво", "дійка", "дійна", "ділок", "дімок", "дірка", "дітки", "днина", "днище", "добич", "добір", "добро", "добра", "довід", "довіз", "догад", "догма", "дожин", "дозір", "дозор", "дойда", "дойна", "дойра", "доказ", "докір", "докер", "долар", "домен", "домик", "домна", "домра", "донка", "донна", "донор", "донос", "донья", "допис", "допит", "дерен", "дереш", "дерик", "дерій", "дерма", "дерть", "дерун", "десть", "дефіс", "джбан", "джгут", "джига", "джура", "дзбан", "дзвін", "дзвяк", "дзета", "дзиґа", "дзьоб", "дзявк", "дзюдо", "дибка", "дибки", "дивак", "диван", "дигер", "дикун", "димар", "дилда", "дилер", "димок", "димка", "динод", "динар", "динас", "динго", "диско", "дичка", "дичок", "дишло", "дорід", "досіл", "досів", "досьє", "дотеп", "дотик", "дохід", "доход", "дофін", "дошка", "дочка", "дощик", "драга", "драла", "драма", "драже", "драйв", "дрань", "драча", "древо", "дрейф", "дрена", "дриль", "дрізд", "дрова", "дроги", "дрозд", "друза", "друїд", "дуаєн", "дубль", "дубок", "дуб'я", "дувал", "дуван", "дудар", "дужка", "дудка", "дуель", "дукар", "дукат", "дукач", "думка", "дуоль", "дунст", "дупло", "дурак", "дурка", "дурра", "дутар", "дутик", "дуття", "духан", "душка", "дучка", "душок", "дюбек", "дюкер", "дюшес", "дядьо", "дятел", "дячок", "евенк", "егіда", "едикт", "ейдос", "екзот", "еклер", "екран", "емпат", "енант", "ендек", "ендем", "ендси", "енець", "ензим", "еозин", "еоліт", "еоцен", "епарх", "епіка", "епонж", "епоха", "епюра", "ербій", "елеат", "елінг", "еліпс", "еліта", "еллін", "ельфа", "емаль", "ембол", "ерзац", "еркер", "есдек", "ескіз", "естер", "естет", "етвеш", "етика", "етнос", "етрол", "ефект", "ефель", "ефіоп", "євнух", "єврей", "єднус", "єзуїт", "єресь", "єдваб", "єство", "єхида", "жабра", "жабка", "жабур", "жакет", "жакоб", "жакан", "жарок", "жатка", "жаття", "жебри", "жилет", "жилка", "жират", "жираф", "жирок", "жирун", "житво", "житіє", "житло", "життя", "житце", "жичка", "жінка", "жменя", "жмаки", "жмудь", "жмури", "жнець", "жнива", "жовна", "жниво", "жниця", "жовно", "желяр", "жених", "жеода", "жердь", "жердя", "жереб", "жереп", "жерех", "жерло", "жерун", "жетон", "живіт", "живло", "жидок", "жижки", "жокей", "жолоб", "жорно", "жрець", "жриця", "жулан", "жуйка", "жупан", "жупел", "журав", "журба", "жучок", "забаг", "забіг", "забій", "забіл", "забір", "завал", "завід", "завіз", "завій", "завіт", "завод", "завія", "завуч", "загад", "загал", "загар", "загин", "загін", "загул", "задих", "заділ", "задок", "задум", "заєць", "зажин", "зазив", "зазор", "зазуб", "заїзд", "заїка", "заїда", "зайда", "зайча", "закал", "заказ", "закид", "закис", "закіп", "заков", "закон", "закот", "закуп", "закут", "затяг", "захід", "зачал", "зачин", "зачеп", "зачіп", "зачіс", "заява", "збава", "збаня", "збори", "збрід", "зброя", "збруя", "зваба", "звага", "звада", "звіря", "зводи", "звяга", "згага", "згляд", "згода", "згола", "зграя", "згуда", "згуба", "здача", "здоба", "здухи", "зебра", "зелот", "зельц", "земля", "зеніт", "зерно", "зернь", "зерня", "зефір", "заліг", "залік", "заліт", "залом", "залка", "замах", "замет", "замір", "заміс", "замок", "замор", "замша", "заніз", "занос", "запал", "запас", "запах", "запит", "запис", "запій", "запіл", "запір", "запор", "зарин", "зарис", "зарік", "заріб", "зарід", "заріз", "зарок", "заряд", "засип", "засіб", "засів", "засік", "засіл", "засов", "засос", "заспа", "засув", "засуд", "засяг", "затин", "затік", "затір", "затія", "затон", "затор", "зилот", "зимно", "зівок", "зілля", "зірка", "з'їди", "з'їжа", "з'їзд", "злада", "злато", "злива", "злоба", "злоги", "злото", "злуда", "злука", "змага", "злюка", "зміна", "зміст", "змова", "змога", "змора", "знада", "знать", "зоман", "зомбі", "зофор", "зошит", "зрада", "зраза", "зрази", "зріст", "зубик", "зубря", "зубці", "зубок", "зуб'я", "зудар", "зулус", "зумер", "зумпф", "зупин", "зурна", "зябля", "зябра", "з'ява", "зятик", "івасі", "іврит", "ігрек", "ідеал", "ідіом", "ідіот", "ієрей", "іжиця", "ізвір", "ізвод", "ізгой", "індол", "індус", "інжир", "інтим", "ізюбр", "ікона", "іксія", "ілеус", "ільма", "імаго", "імбир", "імідж", "імпет", "інвар", "інгуш", "індик", "індій", "іоніт", "іонол", "іприт", "ірбіс", "ірмос", "іскра", "іслам", "іспит", "істик", "ітрій", "іудей", "ішіас", "їдало", "їдець", "їство", "їздка", "йодид", "йодль", "йолом", "йолоп", "йомен", "кабак", "кабан", "кабза", "кабат", "кавер", "кавун", "кавка", "кагал", "каган", "кагат", "кагла", "кагор", "кадет", "кадри", "кадуб", "кадук", "кажан", "кадик", "кадіб", "кадій", "казан", "казах", "казус", "казка", "казна", "казня", "кайло", "кайма", "кайра", "какао", "калан", "калач", "калга", "калим", "калій", "каліф", "каліч", "калія", "калус", "калюс", "камея", "камза", "камін", "камка", "камса", "канак", "канал", "канар", "канат", "канва", "канна", "каное", "канон", "канун", "канюк", "капер", "капіж", "капка", "капля", "капок", "капор", "капот", "карат", "карга", "карго", "карда", "карел", "кариб", "карія", "карма", "карст", "карта", "карук", "карус", "касир", "касія", "каска", "карюк", "каско", "каста", "катар", "катер", "катет", "катод", "каток", "каурі", "качан", "качва", "кахля", "кацап", "качка", "качня", "качур", "кашка", "кашпо", "кашуб", "каюта", "квадр", "кашне", "колір", "коліт", "колія", "колон", "колос", "колот", "колун", "кольє", "кольт", "комар", "комиз", "комин", "комиш", "комік", "комір", "комод", "комос", "конар", "коник", "конка", "конто", "конус", "конха", "конюх", "коняр", "копач", "копер", "копил", "копал", "копит", "копір", "копіт", "копія", "копра", "корал", "корба", "корда", "корма", "корок", "короб", "короп", "корса", "корчі", "косач", "коряк", "косар", "косяк", "котар", "котел", "котер", "котик", "котко", "котун", "коток", "котон", "кофій", "квант", "кварц", "кварк", "кваси", "квача", "кваша", "квест", "квіти", "квота", "кегль", "кегля", "келар", "кельт", "келеп", "келех", "келих", "келія", "кенаф", "кендя", "кепка", "керма", "кермо", "кесар", "кесон", "кетон", "кеш'ю", "кивок", "кетяг", "кефір", "кечуа", "кидій", "кидок", "кизил", "кийок", "килим", "кират", "киндя", "кирея", "кирза", "кирка", "кирпа", "кисет", "кисть", "кишка", "кишло", "киюра", "кияка", "китяг", "кичка", "кіанг", "кібуц", "ківер", "кілер", "кілля", "кізка", "кізяк", "кійло", "кілок", "кімля", "кінва", "кінза", "кінік", "кінін", "кіноа", "кіоск", "кіпер", "кіпка", "кірка", "кірха", "кість", "кітва", "кіска", "кісся", "кіста", "кітка", "кіфоз", "кішка", "клаки", "кладь", "клайм", "клака", "кларк", "клект", "клема", "клерк", "клефт", "клень", "кліка", "кліко", "клінч", "кліпа", "кліпс", "кліщі", "кліть", "кліше", "клоун", "клуня", "кльок", "кльоц", "кльош", "клюга", "клюка", "кляпа", "кнель", "кнехт", "книга", "кметь", "кнікс", "князь", "княжа", "коала", "коата", "кобан", "кобза", "кобиз", "кобка", "кобол", "кобра", "кобуз", "ковач", "ковил", "ковмо", "когут", "кодон", "кодло", "коєць", "кожан", "кожух", "козак", "козар", "козел", "козла", "козли", "козля", "козуб", "козир", "койка", "койне", "койот", "кокер", "кокет", "кокон", "кокос", "кокош", "кокле", "кокні", "колеж", "колаж", "колба", "колет", "колик", "колій", "кофта", "кочет", "коцик", "кошик", "кошма", "кошти", "крага", "кпини", "кража", "краля", "крант", "краса", "крауч", "кредо", "креол", "креси", "крига", "крижі", "криза", "крило", "криль", "криля", "криси", "криха", "криця", "кріль", "кроат", "крокі", "кроль", "кроля", "крона", "крупа", "крупи", "круїз", "круча", "кряча", "ксива", "кубах", "кубик", "кувез", "кубло", "кубок", "кудла", "кудли", "кудрі", "кукан", "кукла", "кузен", "кузня", "кузов", "кукса", "кулаж", "кулак", "кулан", "куліш", "кулон", "кулер", "кулик", "культ", "куман", "кумач", "кумжа", "кумик", "кумир", "кумис", "кумця", "кунак", "куння", "куншт", "купаж", "купка", "купля", "купна", "купол", "купон", "купер", "купча", "куп'я", "кураж", "курай", "курва", "курій", "курія", "курка", "курси", "курок", "куруш", "курча", "кусок", "кусак", "кутас", "кутик", "кутин", "кутис", "куток", "кутум", "куфія", "кухар", "кухта", "куцак", "куцан", "куцик", "кучер", "кухва", "кухля", "кухня", "кучка", "кучма", "кушир", "кушка", "кювет", "кущик", "кхмер", "кюрій", "кяриз", "лабаз", "лабуз", "лабух", "лаваш", "лавіс", "лавка", "лавра", "ладки", "ладан", "лазня", "лазок", "лазур", "лазар", "лазер", "лайба", "лайда", "лайди", "лайка", "лайно", "лайфо", "лакей", "ламер", "лампа", "ламут", "ланди", "ландо", "ланок", "ланка", "лапай", "лапка", "лапки", "ларга", "ларго", "лапун", "лапша", "ласач", "ласій", "ласка", "ласун", "латач", "латиш", "латка", "лаття", "латук", "лахта", "лафет", "лафіт", "левіт", "легат", "легіт", "лізин", "лійка", "лікар", "лізис", "лізка", "лізол", "лікер", "лілея", "лілія", "лімбо", "ліміт", "лімфа", "лінза", "лінія", "лінон", "лінюх", "ліпід", "ліпка", "ліпсі", "лірик", "ліска", "лісок", "літак", "літер", "літій", "літія", "літко", "літун", "ліція", "лічба", "ліцей", "лобас", "лобик", "лобок", "лобур", "ловля", "логер", "логік", "логін", "логос", "лодва", "ложка", "лойок", "лозан", "локус", "локша", "локон", "ломик", "ледар", "ледач", "лежак", "лейба", "лежня", "лезво", "лейка", "лекаж", "лелія", "лельо", "леміш", "лемка", "лемко", "лемур", "лента", "ленто", "леоне", "лепет", "лепра", "лепех", "лепта", "лерка", "летка", "лжець", "либак", "ливар", "лижня", "лизак", "лижва", "лизун", "лилик", "лиман", "лимар", "линва", "лимон", "линок", "липка", "лисак", "лиска", "листя", "лисун", "литво", "литка", "лиття", "лихач", "лихва", "личак", "лицар", "личко", "лишай", "лишка", "лишко", "лишок", "ліана", "лівак", "лівер", "лівша", "лігво", "лідит", "лідар", "лідер", "ліжко", "ломіт", "ломка", "лонжа", "лопар", "лопіт", "лопух", "лотік", "лоток", "лотос", "лотра", "лофер", "лохії", "лоція", "лошак", "лубок", "луб'я", "лудан", "лугар", "лужок", "лузга", "лунка", "лупак", "лупій", "лупка", "луска", "луста", "лутка", "луфар", "лушня", "лушпа", "лущак", "лучик", "лучка", "лучок", "лущик", "льоля", "льоха", "любас", "любва", "любка", "любко", "любов", "люгер", "людці", "люмен", "люпус", "люнет", "люпин", "лютий", "лютня", "люшня", "лядка", "лямка", "ляпас", "ляпіс", "ляпка", "лятва", "ляхва", "лярва", "ляшка", "ляшок", "лящик", "мавка", "мавпа", "магія", "магма", "магог", "магот", "мадам", "мажор", "мадяр", "маєво", "мазар", "мазер", "мазій", "мазка", "мазня", "мазок", "мазун", "майво", "майка", "мазур", "мазут", "майно", "майор", "макао", "макет", "малай", "максі", "малат", "малеч", "малка", "малюк", "маляр", "маляс", "мамут", "мамця", "мамбо", "мамій", "мамка", "манат", "манго", "манеж", "манія", "манка", "манко", "манна", "манір", "манор", "мансі", "манта", "манто", "манул", "маорі", "мапка", "марал", "марго", "маржа", "марка", "марко", "марля", "марші", "масив", "маска", "масаж", "масло", "масон", "масть", "мирра", "мисик", "миска", "мирта", "мисль", "мисок", "митар", "митра", "мичка", "мишак", "мишва", "миття", "мишій", "мишка", "мігма", "мідія", "мідяк", "мідяр", "мізер", "мізок", "мікоз", "мікст", "мілім", "мімік", "мімос", "мінер", "мінет", "мінея", "міній", "мінор", "мінус", "міома", "міраж", "мірза", "мірка", "місіс", "місія", "місто", "місце", "мітка", "мітла", "міхур", "мітоз", "міток", "мішка", "мішма", "мішок", "міщух", "млака", "мливо", "мнихи", "мнець", "могар", "модем", "могол", "модус", "мозок", "матня", "матір", "матка", "матюк", "мафія", "махра", "мачки", "мачок", "меблі", "мегом", "медик", "медіа", "медок", "мезга", "мезон", "мейоз", "мелай", "мелан", "мелос", "мення", "мерва", "мерин", "мерія", "месія", "месьє", "метал", "метан", "метек", "метил", "метис", "метка", "метод", "метол", "метоп", "метро", "меццо", "мечет", "мечик", "мийка", "мойва", "мойра", "моква", "мокко", "мокша", "молот", "молох", "моляр", "монах", "моном", "мопед", "морва", "морда", "морзе", "моріг", "морок", "мороз", "морфа", "моряк", "мотет", "мотив", "мосьє", "мосяж", "моток", "мотор", "мотто", "мотуз", "моцак", "моцар", "мохер", "мочар", "мочка", "мошва", "мошка", "мошок", "мрево", "мрець", "мряка", "мугир", "мужва", "мужик", "музей", "мулла", "мукор", "мулат", "мулик", "муліт", "муляж", "муляр", "муміє", "мумія", "мунгу", "мунда", "мурза", "мурин", "мурло", "мусон", "мутра", "муфта", "муцик", "мушва", "мушка", "мюзет", "мушля", "мушня", "мущир", "мюрид", "м'ясо", "м'яло", "м'ята", "набіг", "набід", "набат", "набій", "набіл", "набір", "набла", "набоб", "навал", "навар", "навик", "навис", "навід", "навіз", "навій", "навіс", "нагад", "нагай", "наган", "нагар", "нагин", "нагін", "нагул", "надій", "наділ", "надир", "надія", "надра", "надро", "нажив", "нажин", "назва", "найда", "наїзд", "найми", "найра", "найом", "наказ", "накид", "накат", "накип", "накри", "налив", "наліт", "налой", "намаз", "намет", "намел", "намив", "намір", "невід", "негус", "недея", "недуг", "нежер", "нелад", "нелюб", "нелюд", "неміч", "ненка", "неньо", "намул", "нанду", "намюр", "нанка", "нанос", "напад", "напай", "напис", "напій", "напір", "нарив", "нарис", "нарід", "наріз", "народ", "наряд", "насад", "насип", "насит", "насів", "насос", "насув", "натік", "натяг", "натяк", "наука", "нафта", "нахил", "нація", "начин", "начіс", "наяда", "небіж", "небій", "нерет", "нерка", "нероб", "нерод", "нерол", "нерпа", "несів", "несун", "нетеч", "нетля", "нетрі", "нетям", "нехар", "нецке", "нивка", "нив'я", "низка", "нирка", "нирок", "нитик", "нитка", "ниття", "ницак", "ніжка", "німак", "німка", "німфа", "нірка", "німча", "нітон", "нічка", "новак", "ножик", "нойон", "номад", "номен", "номер", "нонет", "норія", "норка", "норма", "норов", "носай", "носак", "носар", "носач", "носик", "носій", "нотар", "нотка", "носок", "ночви", "нудяр", "нужда", "нузда", "нукер", "нулик", "нумер", "нурка", "нурок", "нурта", "нутро", "нюхар", "нюхач", "нюанс", "нявка", "няньо", "оазис", "обава", "обвал", "обвід", "обвіз", "обвіс", "обгін", "оберт", "обжин", "об'єм", "обзив", "обида", "обкат", "обкіс", "обком", "облав", "облаз", "облак", "обліг", "облій", "облік", "обліт", "облой", "облом", "обліч", "облов", "облук", "обман", "обмах", "обмел", "обмет", "обмін", "обмір", "обніж", "обора", "образ", "обрив", "обрис", "обріз", "обрій", "обрік", "обруб", "оброк", "обрус", "обруч", "окань", "окапі", "океан", "окіст", "окіян", "оклад", "окова", "оклик", "около", "окріл", "окріп", "окрик", "округ", "оксид", "оксія", "октет", "октан", "окуга", "окунь", "окуня", "олеїн", "олеум", "олень", "оленя", "олива", "оливо", "олімп", "оліфа", "олово", "омана", "олтар", "омега", "омела", "омлет", "омуль", "онагр", "онікс", "онова", "онука", "онуча", "ооліт", "опади", "опала", "опара", "опера", "опіка", "опіат", "опіум", "оплот", "оповз", "опліт", "опока", "опона", "опора", "опруг", "оптик", "опуда", "опука", "опуст", "опція", "орава", "орало", "орган", "оргія", "орден", "ордер", "ореол", "орель", "ореля", "орлан", "орлик", "оркан", "орлон", "орляк", "обряд", "обсів", "обсіч", "обсяг", "обтік", "обуда", "обуза", "обхід", "обцас", "обчас", "обшар", "обшир", "обшук", "об'яв", "овеча", "овоїд", "огень", "огида", "оглав", "огляд", "огонь", "огріх", "огром", "огуда", "огузи", "одвір", "одвіт", "одежа", "одеон", "одяга", "одура", "ожика", "ожина", "озеро", "озимі", "озирк", "ознак", "озноб", "ойкіт", "ойрот", "оромо", "ортит", "орхіт", "орчик", "оруда", "оршад", "осада", "осеїн", "оселя", "осика", "осина", "осінь", "оскал", "ослик", "ослін", "осліп", "ослюк", "осман", "осмол", "осмій", "осміх", "осмос", "оснач", "осоїд", "осока", "особа", "остит", "остов", "остюк", "остяк", "осуга", "осуда", "осьон", "отава", "отара", "отвір", "отець", "отеса", "отоса", "отрій", "отрок", "отруя", "отуха", "отчич", "офеня", "офіра", "офшор", "офорт", "офсет", "охват", "охиза", "охота", "очата", "очепа", "очерт", "очкур", "очиці", "очище", "очник", "ошада", "ошуст", "ощада", "ошука", "павза", "павич", "павук", "падіж", "паділ", "падко", "павун", "павур", "пагін", "падло", "падре", "падуб", "пазур", "пайда", "пайза", "пайка", "пайок", "палас", "пакер", "пакет", "пакіл", "палац", "палаш", "палій", "палка", "палуб", "палюх", "паляр", "памка", "пампа", "панас", "панва", "панда", "панія", "панич", "панна", "панно", "панок", "панти", "папая", "папір", "папка", "парад", "параф", "парез", "парик", "паріс", "парія", "парка", "парня", "парло", "парна", "парод", "парок", "паром", "парох", "парта", "пархи", "парча", "парша", "парші", "пасаж", "парус", "пасат", "пасив", "пасик", "пасія", "паска", "пасмо", "пасть", "пасок", "паста", "пасха", "патер", "патик", "патіо", "патли", "патуа", "пауза", "пафос", "пахан", "пахар", "пахва", "пахно", "пахощ", "пахта", "пацан", "пашня", "паюха", "пегас", "пацюк", "пачка", "пелех", "пекан", "пекар", "пекло", "пемза", "пенал", "пенат", "пеніс", "пенні", "перга", "перед", "перія", "перко", "перла", "перли", "перло", "перса", "перон", "перст", "перун", "перце", "песик", "петля", "петек", "петит", "печія", "п'єза", "пилав", "пилка", "п'єса", "пивко", "пивна", "пивце", "пижик", "пижмо", "пилок", "пиляк", "пиляр", "пинда", "писак", "писар", "пипка", "пиріг", "пирій", "писок", "питво", "пиття", "питун", "піала", "піано", "пичка", "пишка", "пищик", "пияка", "півка", "півча", "полба", "полив", "полик", "полин", "поліг", "полій", "поліп", "полір", "поліс", "політ", "полка", "полог", "полоз", "полох", "полом", "полон", "полюс", "поляк", "поляр", "помах", "помел", "помиї", "помин", "поміч", "помка", "помір", "помок", "помор", "помпа", "понос", "понур", "пончо", "понюх", "попас", "попал", "попар", "попик", "попит", "попіл", "попса", "порей", "порив", "поріг", "порід", "поріз", "порок", "пором", "порон", "порох", "поруб", "порти", "порто", "порух", "порча", "поряд", "посаг", "посад", "посів", "посіл", "посол", "посох", "посуд", "посуш", "поташ", "посюх", "потік", "потир", "потоп", "потур", "потяг", "поука", "похил", "похід", "поход", "почет", "почин", "почот", "пошуг", "пошук", "пошум", "пошта", "поява", "право", "прало", "праля", "прайс", "праця", "праща", "преса", "піїта", "пійло", "пікап", "піжон", "пікер", "пікет", "пікша", "пілат", "пілка", "пілон", "пілот", "пінія", "пінка", "пінта", "пірат", "пірит", "пірке", "піроп", "пірце", "пір'я", "пісок", "піспа", "пісня", "пітон", "піфія", "піфос", "піхва", "піхви", "піхта", "піхур", "пічка", "пішак", "пішка", "пішня", "плаїк", "плаке", "пласт", "плато", "плаун", "плата", "плаха", "плебс", "плеск", "плеєр", "плесо", "плече", "плісе", "пліть", "плита", "плиця", "пліва", "плова", "плоть", "площа", "плюск", "пляма", "плюта", "пнище", "побит", "побій", "побіл", "побір", "побут", "поваб", "поваг", "повал", "повар", "повів", "повід", "повіз", "повій", "повіт", "повія", "повня", "погар", "погін", "погон", "погук", "подив", "подих", "подій", "поділ", "подія", "подок", "подра", "подув", "подум", "поема", "пожед", "пожар", "позва", "позер", "позив", "позір", "позіх", "позов", "поїзд", "пойда", "показ", "покал", "покер", "покат", "покій", "покіс", "покіт", "покуп", "прима", "принц", "приск", "причт", "приют", "пріам", "пріль", "пріор", "проба", "прова", "проза", "просо", "профі", "прояв", "проща", "прусс", "пряжа", "пряля", "пряха", "псина", "псиця", "псише", "псище", "псота", "псюга", "псюка", "псюра", "псяка", "псяра", "птаха", "пташа", "пугар", "пугач", "птиця", "пуант", "пудик", "пудло", "пудра", "пужак", "пужка", "пузан", "пузир", "пузце", "пункт", "пульс", "пульт", "пупок", "пурга", "пурин", "пурка", "пуста", "путня", "путря", "путто", "пуття", "пуфик", "пухир", "пучка", "пучок", "пушка", "пушок", "пушта", "пушту", "пущик", "пшоно", "п'ядь", "п'яза", "п'яло", "п'ята", "рабат", "рабин", "радар", "раджа", "радій", "радіо", "радон", "радця", "разок", "раїна", "райно", "райок", "район", "райця", "раква", "ракша", "ракія", "ракло", "ракля", "рамен", "рамет", "рамка", "ранет", "рампа", "рамтя", "рамця", "рам'я", "ранка", "рання", "ранок", "ранчо", "рапак", "рапач", "рапід", "растр", "ратай", "ратин", "рафід", "рафія", "раунд", "рахва", "рахіт", "рацея", "рація", "рачок", "рвань", "рдест", "ребро", "ребус", "ревіт", "ревун", "регбі", "регіт", "редан", "редис", "редиф", "редут", "режим", "резол", "резон", "резус", "рейка", "рекет", "релін", "ремез", "реміз", "ренод", "рента", "ренет", "реній", "ренін", "репер", "репет", "розор", "ретро", "ретур", "ретуш", "решка", "решта", "рибак", "рибар", "рибас", "рибат", "рибка", "риб'я", "ривок", "рижик", "рижій", "рижок", "риззя", "ризик", "рийка", "рикша", "римар", "римач", "ринок", "ринва", "ринда", "риніт", "ринка", "рипус", "рисак", "ристь", "риска", "рифлі", "ритон", "ритор", "риття", "рихва", "рицар", "рицин", "рівня", "рідня", "рієль", "різка", "ріжок", "різак", "різня", "різун", "рійба", "рійок", "рілля", "ріска", "річка", "ріння", "ріпак", "ріпка", "робак", "робер", "робот", "ровик", "ровта", "рогач", "рогіз", "родео", "родак", "родит", "родич", "родій", "рожен", "роєць", "розум", "ройок", "рокер", "рокіт", "ролер", "ролик", "роман", "ромен", "ромок", "рондо", "ронжа", "ропак", "росіл", "ростр", "ротик", "рочок", "рояль", "роток", "ротор", "ртуть", "рубаї", "рубач", "рубок", "рубіж", "рубін", "рубка", "руб'я", "рудка", "рудня", "рудяк", "руїна", "рукав", "рулет", "рулон", "румак", "румба", "румун", "рурка", "русак", "русин", "рупія", "рупор", "русич", "русло", "рутил", "рутин", "руфія", "ручай", "рюмса", "рюмси", "ручка", "рушій", "рябко", "рябок", "рямка", "рямця", "ряска", "рядно", "рядок", "ряжка", "саамі", "сабан", "сабаш", "сабей", "савар", "сагиб", "сабза", "сабур", "саван", "саджа", "садка", "садно", "сажка", "сажок", "сазан", "сайга", "садок", "саєта", "сайда", "сайка", "сайра", "сакви", "сакля", "сакос", "салеп", "салій", "салат", "салол", "салон", "салоп", "саман", "самба", "салют", "самбо", "саміт", "самка", "самум", "санки", "сапер", "сапет", "сапка", "сапун", "сарай", "саржа", "сарна", "сарос", "сауна", "сатин", "сатир", "сафра", "сачок", "сваха", "свара", "сверб", "светр", "свиня", "свист", "свита", "свінг", "світа", "свіча", "свояк", "свято", "сеанс", "седан", "сезам", "сезон", "сейба", "сейша", "секта", "селен", "селех", "селюк", "селюх", "селфі", "сенжа", "семіт", "сенат", "сепія", "септа", "серга", "серин", "серія", "серен", "серна", "серсо", "сетер", "серум", "серце", "сесія", "сеунч", "сивуч", "сивак", "сиваш", "сивка", "сивко", "сигла", "сигма", "сидір", "сидні", "сидня", "сизар", "сизик", "сизяк", "сиква", "сикоз", "силак", "силан", "силач", "сморж", "смрад", "смуга", "смута", "снага", "сниця", "снище", "сноза", "собор", "совик", "совіт", "совка", "совок", "сойка", "сойот", "сокіл", "сокір", "содом", "солея", "солід", "солод", "солон", "соляр", "сонар", "сонет", "сонце", "сомик", "сомок", "сомон", "сонях", "сопіт", "сопка", "сопло", "сопля", "сорго", "сорит", "сорок", "сопун", "сопух", "сором", "сосок", "сосун", "сорус", "соска", "сосна", "сотка", "сотня", "софіт", "софія", "софка", "сохур", "сочка", "сошка", "спазм", "спаль", "спека", "спирт", "спина", "спиця", "співа", "сплав", "спіса", "сплін", "спліт", "сплюх", "спона", "спора", "спорт", "спрей", "сприт", "спрут", "спрят", "спуза", "спурт", "спуск", "спуст", "срака", "стадо", "стаєр", "стаза", "стала", "сталь", "станс", "станя", "старт", "ствол", "створ", "стать", "стежі", "стезя", "стейк", "стека", "стела", "стежа", "стеля", "стенд", "степс", "силка", "силом", "силур", "силон", "силос", "сильф", "сингл", "синап", "синаш", "синдх", "синик", "синод", "синок", "синус", "синюк", "синяк", "сипай", "сирин", "сироп", "сирок", "сирть", "сисак", "ситро", "ситце", "систр", "сисун", "ситал", "ситар", "ситко", "сифон", "сичик", "сичуг", "сищик", "сівня", "сівок", "сівці", "сідак", "сідач", "сіаль", "сівак", "сівач", "сівба", "сівер", "сідло", "сідок", "сієна", "сієра", "сійба", "сійка", "сійці", "сікар", "сікач", "сімка", "сім'я", "сінаж", "сінди", "сінки", "сінце", "сінці", "сіпак", "сірка", "сірко", "сіряк", "сітка", "сказа", "січка", "січна", "сішка", "скаба", "скала", "скань", "скарн", "скарб", "скаут", "сквар", "сквер", "скеля", "скена", "сквош", "скейт", "скетч", "скиба", "скіпа", "склад", "скіра", "склеп", "склик", "скляр", "скоба", "скопа", "скора", "скорб", "скорс", "скорц", "скотч", "скота", "скрап", "скреб", "скрес", "скрик", "скрип", "скрут", "скудо", "скунс", "скука", "скула", "слава", "слайд", "слань", "слизь", "слейд", "сленг", "слива", "слина", "слиня", "слище", "сліпи", "слово", "слоїк", "слоня", "слуга", "слюда", "смага", "смерд", "смерк", "смерч", "смисл", "сміха", "смолі", "сміюн", "смола", "стерх", "стило", "стиль", "стиск", "стіна", "стовп", "стоїк", "стокс", "стома", "стопа", "стояк", "стоян", "стота", "страж", "страз", "страм", "страх", "стрес", "стриб", "стриж", "стрий", "стрик", "стрим", "стрих", "стрій", "стріл", "стріп", "строп", "строк", "струг", "струм", "струк", "струп", "струс", "стуга", "стуко", "стужа", "стума", "ступа", "стьон", "стяга", "субір", "судак", "сувій", "сугак", "суддя", "судза", "судія", "судок", "судно", "суєта", "сукре", "сукія", "сукно", "сукня", "сулія", "сулой", "сумах", "суміш", "сумка", "суніт", "суомі", "супер", "супін", "сурик", "сурма", "сурна", "сурок", "сусак", "сусід", "сусік", "сусло", "сутки", "суття", "сутуж", "сутаж", "суфій", "суфіт", "суфле", "сухар", "сучка", "сучок", "суята", "суччя", "сушар", "сушка", "сушня", "сущик", "сфера", "схема", "схима", "схлип", "схова", "сходи", "схрон", "сцена", "сьєра", "сюжет", "сюїта", "сяєво", "сюрко", "сяйво", "сяння", "табло", "табес", "табін", "табір", "табун", "тавіт", "тавот", "таган", "тавро", "тазик", "тазіє", "тазок", "тайна", "таїна", "тайга", "такир", "таксі", "такос", "такса", "талан", "талер", "талес", "талик", "талиш", "таліб", "талій", "талір", "талія", "талон", "тальк", "таляр", "тамга", "таміл", "танго", "танід", "танін", "танка", "танок", "тапер", "тапір", "тарас", "таран", "тараф", "тариф", "татар", "тасун", "татка", "татко", "тафта", "тахва", "твань", "тахта", "тацет", "тачка", "ташка", "твіст", "театр", "тежик", "тезис", "тезка", "тезко", "теїзм", "теїст", "текст", "телій", "теліт", "телур", "тембр", "темка", "темня", "теніс", "тенно", "тенор", "тепло", "товща", "товча", "тодес", "тойон", "токай", "токан", "токар", "толай", "толар", "толок", "толос", "томат", "томик", "тондо", "тонер", "тонік", "тонна", "тонус", "топаз", "топір", "топка", "топос", "торба", "торит", "торій", "торок", "тороп", "торос", "тотем", "тохар", "точій", "точка", "точок", "трава", "тракт", "транс", "транш", "траса", "траст", "трата", "траур", "трель", "треба", "трема", "тренд", "трест", "трефа", "триба", "тризм", "трико", "терем", "терен", "терло", "терми", "терка", "терни", "терно", "терня", "терор", "тертя", "тесак", "тесан", "тесля", "тесла", "тесло", "тесть", "тетан", "теург", "техно", "течія", "течка", "тешка", "тибар", "тигря", "тижба", "тижик", "тибон", "тивун", "тиква", "тикер", "тимін", "тимол", "тимус", "тиння", "тинок", "тиньк", "типаж", "типик", "тираж", "тиран", "тирло", "тирка", "тирса", "титан", "титар", "титла", "титло", "титул", "тичка", "тичок", "тишко", "тичба", "тіара", "тікач", "тім'я", "тіпун", "тітка", "тісто", "тічка", "тічня", "тічок", "ткаля", "ткань", "ткаха", "тлінь", "товар", "трина", "трипс", "триух", "тріас", "трієр", "тріод", "тріск", "троль", "тромб", "тропа", "тромп", "троха", "троща", "трояк", "троян", "труба", "труна", "труси", "труск", "трупа", "труса", "трусь", "трута", "труха", "трюмо", "тсуга", "туаль", "тубик", "тубус", "тугаї", "тужба", "тулій", "тулія", "тулуб", "тукан", "тулук", "тулун", "тулуп", "тумак", "туман", "тумба", "тумен", "тумор", "тупак", "тупик", "тупій", "тупіт", "турач", "турба", "турка", "турма", "турне", "турун", "турча", "тусан", "турня", "турок", "турон", "туска", "тусок", "тутор", "туфіт", "туфля", "тушка", "тюбик", "тюжка", "тьотя", "тюнер", "тюрбо", "тютюн", "тюрма", "тючок", "тюшен", "тябло", "тягар", "тягач", "тягло", "тягун", "тямка", "тяжба", "тяжка", "тямок", "увага", "убрус", "увеїт", "увера", "угара", "углич", "угода", "угрин", "удача", "удеге", "удова", "ужака", "узанс", "узвар", "узвіз", "узбек", "узлик", "унтер", "унука", "унуча", "унція", "упліт", "упруг", "упряж", "упука", "упуст", "ураза", "урама", "уреїд", "урема", "урина", "урода", "уроки", "уртит", "уруно", "уйгур", "уймак", "уклад", "уклін", "уклон", "уколо", "укріп", "улива", "улиця", "улога", "ульва", "умбра", "умбри", "уміст", "умова", "унабі", "уніат", "уніон", "унізм", "усміх", "успіх", "устав", "усташ", "устид", "устка", "устої", "уступ", "утвір", "утека", "утеча", "утиль", "утиск", "утіки", "утіха", "утома", "учень", "учком", "ушкал", "ушкуй", "ушула", "ущерб", "фавор", "фабра", "фавус", "фагот", "фазан", "фазис", "файда", "файка", "факел", "факін", "факір", "факля", "фалда", "фалос", "фальц", "фальш", "фанат", "фанза", "фанта", "фантя", "фарба", "фасад", "фасет", "фаска", "фасон", "фатум", "фауна", "фацет", "фація", "фаянс", "фелах", "фелон", "феній", "феніл", "фенії", "феном", "фенол", "флейт", "флейц", "флінт", "флірт", "флокс", "флора", "флуєр", "флюїд", "фляга", "фобія", "фляки", "фокус", "фоліо", "фомоз", "фонон", "форма", "форте", "форум", "фоска", "ферії", "ферма", "ферзь", "ферит", "феска", "фетва", "фетиш", "фіакр", "фібра", "фідер", "фізик", "фізія", "фікус", "філей", "філер", "філіт", "філія", "фільм", "фільц", "фімоз", "фінал", "фініш", "фінка", "фінік", "фіноз", "фіорд", "фірма", "фітин", "фітол", "фішка", "фланг", "фланк", "фотон", "фофан", "фраєр", "фраза", "франк", "франт", "фрахт", "фреза", "фрейм", "фреон", "френч", "фрика", "фронт", "фрунт", "фрукт", "фугас", "фузея", "фузія", "фуете", "фужер", "фукус", "фуляр", "фураж", "фурія", "фурка", "фурик", "фурма", "фурор", "футор", "футро", "фуяра", "фюрер", "ф'яба", "хабаз", "хабар", "хабуз", "хавка", "хазія", "хаджі", "хазяй", "хакер", "хакім", "хакан", "хакас", "халал", "халва", "халат", "халаш", "халіф", "хамам", "хаміт", "хамка", "хамло", "хамон", "хамса", "ханжа", "ханти", "ханша", "хапка", "хапло", "хапун", "харем", "харза", "харло", "харон", "харчі", "харчо", "харящ", "хасид", "хаскі", "хатка", "хауса", "хафіз", "хвала", "хваст", "хвижа", "хвиля", "хвища", "хвіст", "хвора", "хедер", "хедив", "хлост", "хлюст", "хляґа", "хляка", "хляки", "хмара", "хміль", "хоана", "хобот", "ходик", "ходка", "ходня", "ходак", "ходжа", "ходок", "ходун", "хозар", "хокей", "холін", "холка", "холод", "холоп", "холуй", "хомут", "хопта", "хорал", "хопер", "хорда", "хорей", "хорея", "хосен", "хотар", "хохля", "хохма", "хохол", "херес", "хижак", "хижка", "хиндя", "хиряк", "хирій", "хисть", "хитар", "хитун", "хихіт", "хідня", "хіазм", "хілус", "хімік", "хімія", "хімус", "хінін", "хінді", "хінон", "хісен", "хітин", "хітон", "хлань", "хлист", "хлоня", "храпа", "хрест", "хрунь", "хруск", "хруст", "хряск", "худак", "худко", "худяк", "хунта", "хурал", "хурда", "хурія", "хурма", "хуста", "хурта", "хустя", "хутір", "хутра", "хутро", "цадик", "цапня", "цапок", "цанга", "цапик", "цапур", "цапфа", "царат", "царик", "царок", "цвіль", "цвіть", "цебер", "цебро", "цегея", "цегла", "цезар", "цедра", "цезій", "целіт", "целон", "ценоз", "центр", "ципки", "цирка", "цироз", "циста", "цитра", "цифір", "цифра", "цівка", "цілик", "цілка", "цепок", "церат", "церва", "церій", "цесар", "цесія", "цефей", "цехін", "цибок", "цибук", "цибух", "циган", "цикля", "цинга", "цинік", "цинія", "цинка", "ціпка", "ціпун", "ціпух", "ціпок", "цісар", "цнота", "цовта", "цокіт", "цуглі", "цукат", "цукор", "цупка", "цурка", "цуцик", "цур'я", "цьора", "цюпка", "цябро", "цямра", "цяпка", "цятка", "чабак", "чабан", "чабер", "чавун", "чадра", "чагар", "чагун", "чаєня", "чайок", "чайот", "чакан", "чайка", "чайна", "чакра", "чамур", "чалка", "чалма", "чангі", "чанді", "чапан", "чапаш", "чапля", "чарка", "чатні", "часть", "чашка", "чвань", "чвара", "чвиря", "чекан", "чекер", "чинок", "чинка", "чипси", "чирва", "чирок", "чирун", "чиряк", "чирка", "число", "читач", "читка", "чифір", "чихир", "чівка", "чівки", "чілка", "чичва", "чімка", "чіпок", "чічка", "чміль", "чмана", "чобан", "чобіт", "човен", "чокер", "чопик", "чопок", "чорба", "чорне", "чортя", "чотар", "чепак", "черви", "черва", "черга", "череп", "черес", "чернь", "честь", "чечіт", "четья", "чешка", "чигир", "чижик", "чикси", "чилим", "чинар", "чотки", "чохла", "чохол", "чтець", "чтиво", "чубик", "чубок", "чубак", "чубар", "чубук", "чувал", "чуваш", "чугай", "чудак", "чудар", "чудій", "чужак", "чуйка", "чукан", "чукча", "чулан", "чулка", "чумак", "чунок", "чупер", "чурок", "чурек", "чутка", "чуття", "чучхе", "чушка", "чухра", "шабас", "шабаш", "шаблі", "шабер", "шабля", "шабот", "шажок", "шавка", "шайба", "шайка", "шакал", "шалик", "шалон", "шалот", "шамот", "шаман", "шанин", "шапар", "шапка", "шаржа", "шарик", "шасла", "шатен", "шатія", "шатро", "шатун", "шафар", "шатня", "шафер", "шафір", "шафка", "шахва", "шахід", "шахта", "шваль", "шашка", "шваба", "шваля", "швара", "шварт", "шверт", "швець", "шевер", "швора", "шевня", "шевро", "шекер", "шелак", "шкіра", "шкляр", "шкода", "школа", "шкраб", "шкора", "шкура", "шланг", "шлейф", "шліпс", "шлюха", "шляга", "шляпа", "шмата", "шмига", "шнапс", "шнека", "шняга", "шобла", "шокер", "шолом", "шопка", "шорка", "шорня", "шорти", "шофер", "шофта", "шошон", "шпага", "шпала", "шпана", "шпара", "шпача", "шпень", "шпета", "шпиль", "шпиця", "шпіон", "шпола", "шпона", "шприц", "шпоня", "шпора", "шпрот", "шелеп", "шелон", "шелех", "шельф", "шелюг", "шеляг", "шемая", "шепіт", "шерех", "шерег", "шериф", "шефен", "шибер", "шибка", "шиїзм", "шийка", "шизик", "шинка", "шипах", "шипик", "шинок", "шипіт", "шипун", "ширка", "ширма", "шитво", "шитик", "шитки", "шиття", "шифер", "шифон", "шихта", "шишак", "шишка", "шияка", "шіпка", "шкала", "шкапа", "шкафа", "шквал", "шкиль", "шкерт", "шпуга", "шпуля", "шпунт", "шримс", "шрифт", "штаба", "шталт", "штама", "штамб", "штамп", "штани", "штейн", "штемп", "штиба", "штиль", "штиря", "штифт", "штола", "штора", "шторм", "шторх", "штраф", "штрих", "штрек", "штука", "штурм", "шубат", "шубка", "шувар", "шувир", "шувір", "шугай", "шукач", "шулер", "шудра", "шуйця", "шулик", "шулік", "шулка", "шуляк", "шумер", "шумка", "шумок", "шурин", "шурка", "шупас", "шурпа", "шуруп", "шурша", "шуряк", "шутер", "шутка", "шушон", "шушун", "шуфля", "шухер", "шхери", "шхуна", "щавій", "щамба", "щастя", "щебет", "щебіт", "щенюк", "щепій", "щепка", "щепко", "щерба", "щіпка", "щітка", "щічка", "щовба", "щогла", "щолба", "щигля", "щипак", "щипка", "щипок", "щипун", "щипці", "щитик", "щиток", "щілка", "щувак", "щупак", "щупик", "щупка", "щупта", "щурій", "щурка", "щурик", "щучка", "югурт", "юдоль", "юзист", "юрист", "юрода", "юїтка", "юкола", "юмізм", "юніор", "юнкер", "юнкор", "юннат", "юферс", "ябеда", "явида", "явище", "ягель", "ягода", "ягуар", "ядуха", "яєчко", "яєчня", "яєшня", "ямщик", "янгол", "янтар", "япина", "ярець", "ярига", "яриза", "яриця", "ярина", "ярлик", "ярміз", "ярміс", "ярота", "ярчак", "ярчук", "яруга", "ясина", "ясень", "яскір", "ялина", "ялець", "ялиця", "ялоза", "ямище", "ясмин", "яспис", "ясько", "ятвяг", "ятлик", "ятіль", "яхонт", "ячник", "яшник"].includes(w),
      answer: () => {const a=['\u0434\u0435\u0432\u0456\u0437','\u0431\u0440\u0435\u043d\u0434','\u0430\u043d\u043e\u043d\u0441','\u0442\u0430\u0439\u0433\u0430','\u043f\u0430\u043b\u043a\u0430','\u0434\u0440\u0430\u043c\u0430','\u043f\u043e\u0440\u043e\u0445','\u0431\u0430\u0437\u0430\u0440','\u0432\u0443\u043b\u0438\u043a','\u0434\u043e\u0441\u044c\u0454','\u043f\u0440\u043e\u0437\u0430','\u0441\u0443\u0444\u043b\u0435','\u043f\u0430\u043d\u043d\u043e','\u0430\u0442\u0430\u043a\u0430','\u0456\u0443\u0434\u0435\u0439','\u043e\u0431\u0441\u044f\u0433','\u0442\u0438\u0440\u0441\u0430','\u043f\u0430\u043d\u0434\u0430','\u0440\u0435\u0433\u0431\u0456','\u043b\u0456\u0430\u043d\u0430','\u0437\u0430\u0432\u043e\u0434','\u0437\u043c\u0456\u0441\u0442','\u043f\u0430\u0444\u043e\u0441','\u0431\u0456\u0434\u043e\u043d','\u043f\u0443\u043b\u044c\u0442','\u0432\u043e\u0440\u043e\u0433','\u0434\u043e\u0447\u043a\u0430','\u0434\u043e\u0448\u043a\u0430','\u043d\u0430\u043c\u0435\u0442','\u043d\u0438\u0440\u043a\u0430','\u043e\u0437\u0435\u0440\u043e','\u043a\u0443\u0445\u043d\u044f','\u043c\u044e\u0441\u043b\u0456','\u0434\u0437\u044e\u0434\u043e','\u043a\u043d\u0438\u0433\u0430','\u0440\u0456\u0437\u0430\u043a','\u043c\u0435\u0431\u043b\u0456','\u043d\u043e\u0440\u043c\u0430','\u043b\u0456\u043d\u0437\u0430','\u043e\u0433\u043b\u044f\u0434','\u0432\u0430\u043b\u0443\u043d','\u0437\u0430\u0432\u0443\u0447','\u0442\u0435\u043d\u0456\u0441','\u043f\u0440\u0438\u043c\u0430','\u0433\u043e\u043f\u0430\u043a','\u043a\u0430\u0440\u0442\u0430','\u0442\u0435\u043d\u043e\u0440','\u0442\u0430\u043a\u0441\u0456','\u0436\u043e\u043a\u0435\u0439','\u043b\u0430\u043d\u043a\u0430','\u043f\u0430\u043d\u0438\u0447','\u043d\u0430\u0440\u0434\u0438','\u0456\u043d\u0436\u0438\u0440','\u043a\u043d\u044f\u0437\u044c','\u0441\u043f\u0440\u0435\u0439','\u0434\u0435\u043a\u0430\u043d','\u0432\u0430\u043b\u044c\u0441','\u043f\u0456\u0440\u0430\u0442','\u043a\u0435\u043b\u0438\u0445','\u0436\u0438\u043b\u0435\u0442','\u0441\u0435\u043f\u0456\u044f','\u043e\u043f\u043e\u0440\u0430','\u0435\u043c\u0430\u043b\u044c','\u0448\u0442\u0430\u043d\u0438','\u043a\u043e\u043d\u0443\u0441','\u0445\u0443\u043d\u0442\u0430','\u0440\u0443\u0448\u0456\u0439','\u0442\u0438\u0440\u0430\u043d','\u043f\u0443\u043b\u044c\u0441','\u0437\u0431\u043e\u0440\u0438','\u0441\u0442\u0456\u043d\u0430','\u0440\u0456\u0434\u043d\u044f','\u043e\u0431\u0440\u0430\u0437','\u0440\u0435\u0436\u0438\u043c','\u0444\u043e\u0440\u0443\u043c','\u0442\u0435\u0430\u0442\u0440','\u0444\u0443\u0440\u043e\u0440','\u0442\u0456\u0441\u0442\u043e','\u043b\u0435\u043c\u0443\u0440','\u043b\u0456\u0446\u0435\u0439','\u043f\u0456\u043b\u043e\u043d','\u0431\u0435\u0440\u0435\u0433','\u0442\u0430\u043b\u043e\u043d','\u0433\u043d\u0438\u043b\u044c','\u0432\u0434\u0430\u0447\u0430','\u0442\u043e\u0432\u0449\u0430','\u043b\u0456\u043a\u0430\u0440','\u0433\u0430\u0440\u0435\u043c','\u0444\u043b\u044f\u0433\u0430','\u0433\u0435\u0439\u0448\u0430','\u0430\u0443\u0434\u0438\u0442','\u0430\u0442\u043b\u0430\u0441','\u0432\u0441\u0442\u0443\u043f','\u0432\u0440\u043e\u0434\u0430','\u043a\u0432\u0430\u043d\u0442','\u0491\u0440\u0430\u0442\u0438','\u043d\u044e\u0430\u043d\u0441','\u043f\u0443\u043d\u043a\u0442','\u0447\u0438\u0441\u043b\u043e','\u043f\u043e\u043b\u0456\u0442','\u0444\u043b\u0456\u0440\u0442','\u043b\u043e\u043f\u0443\u0445','\u0432\u0435\u0441\u043d\u0430','\u0434\u043e\u043b\u0430\u0440','\u0432\u0438\u043a\u0438\u0434','\u043a\u0430\u043a\u0430\u043e','\u043d\u0430\u0434\u0456\u044f','\u0441\u043b\u0438\u0432\u0430','\u043a\u044e\u0432\u0435\u0442','\u0441\u043f\u0438\u043d\u0430','\u0447\u0438\u0442\u0430\u0447','\u0432\u0438\u0432\u0438\u0445','\u0441\u0430\u043d\u043a\u0438','\u0430\u043d\u0456\u043c\u0435','\u0432\u0438\u0445\u0456\u0434','\u0442\u0440\u043e\u043f\u0430','\u043a\u043e\u0440\u043e\u043f','\u0444\u043e\u0442\u043e\u043d','\u0441\u043b\u0430\u0432\u0430','\u0434\u0456\u0434\u0443\u0445','\u0448\u0443\u0440\u0443\u043f','\u0430\u0440\u0435\u043d\u0430','\u0431\u0456\u0442\u0443\u043c','\u0432\u0456\u0437\u0438\u0442','\u043a\u0456\u043d\u0437\u0430','\u0441\u0442\u0430\u0434\u043e','\u0445\u0432\u0456\u0441\u0442','\u0441\u0442\u0440\u0456\u0439','\u0432\u0430\u0433\u043e\u043d','\u043f\u043b\u0438\u0442\u0430','\u0448\u043a\u043e\u0434\u0430','\u0434\u0435\u0444\u0456\u0441','\u043a\u0430\u044e\u0442\u0430','\u0441\u0430\u0434\u043e\u043a','\u0448\u043b\u0430\u043d\u0433','\u0434\u044f\u0442\u0435\u043b','\u043b\u0443\u043d\u043a\u0430','\u0441\u043e\u0431\u043e\u0440','\u0437\u0431\u0440\u0443\u044f','\u043a\u0430\u0441\u043a\u0430','\u043c\u0456\u0440\u0430\u0436','\u043c\u0438\u0441\u043a\u0430','\u043a\u043e\u043b\u0456\u044f','\u043a\u043e\u043d\u044e\u0445','\u0446\u0438\u0444\u0440\u0430','\u0433\u0430\u0447\u043e\u043a','\u043c\u0435\u0434\u0438\u043a','\u0437\u043c\u043e\u0432\u0430','\u043a\u043e\u0437\u0435\u043b','\u043b\u0443\u0431\u043e\u043a','\u043e\u0442\u0432\u0456\u0440','\u043b\u043e\u043a\u043e\u043d','\u043c\u0430\u0433\u0456\u044f','\u0441\u043e\u0444\u0456\u0442','\u0440\u0430\u043c\u043a\u0430','\u0456\u0434\u0435\u0430\u043b','\u043d\u0430\u0432\u0438\u043a','\u0444\u0430\u0440\u0431\u0430','\u0444\u0456\u043a\u0443\u0441','\u0432\u0438\u043b\u0456\u0442','\u0434\u0436\u0433\u0443\u0442','\u043a\u043e\u0437\u0438\u0440','\u043a\u0438\u0432\u043e\u043a','\u0434\u043e\u043c\u0435\u043d','\u0430\u0434\u0435\u043f\u0442','\u0440\u0435\u0439\u043a\u0430','\u0440\u0430\u0443\u043d\u0434','\u0446\u0435\u0434\u0440\u0430','\u043a\u0440\u0430\u043b\u044f','\u0441\u043a\u043b\u0430\u0434','\u0433\u043e\u0440\u043e\u0434','\u0448\u043b\u0435\u0439\u0444','\u043b\u0456\u043a\u0435\u0440','\u0430\u043c\u0431\u0430\u0440','\u0432\u0443\u0437\u043e\u043b','\u043f\u043e\u0441\u0443\u0434','\u043a\u0440\u0430\u0441\u0430','\u0441\u0435\u043a\u0442\u0430','\u0431\u0443\u0433\u043e\u0440','\u043a\u0430\u043f\u043e\u0442','\u043c\u043e\u043f\u0435\u0434','\u043e\u0440\u0434\u0435\u0440','\u0441\u0432\u0438\u043d\u044f','\u0432\u0438\u043f\u0438\u0441','\u043c\u0438\u0439\u043a\u0430','\u0433\u043e\u043b\u044c\u0444','\u043b\u0438\u0448\u0430\u0439','\u043f\u0456\u043b\u043e\u0442','\u0430\u0444\u0435\u043a\u0442','\u0456\u043a\u043e\u043d\u0430','\u0430\u0437\u0430\u0440\u0442','\u0433\u0430\u043c\u0430\u043a','\u0436\u0438\u0432\u0456\u0442','\u043b\u0430\u0437\u043d\u044f','\u0431\u043b\u0443\u0437\u0430','\u0431\u0440\u0443\u0445\u0442','\u0433\u043e\u043b\u043e\u0441','\u0434\u0438\u0432\u0430\u043a','\u043a\u0443\u043c\u0438\u0440','\u0456\u043c\u0456\u0434\u0436','\u043c\u0430\u0432\u043a\u0430','\u0432\u0438\u0448\u043d\u044f','\u043f\u043e\u0448\u0442\u0430','\u043e\u043a\u0435\u0430\u043d','\u043e\u043a\u0440\u0443\u0433','\u043c\u0456\u0448\u043e\u043a','\u043a\u0430\u0447\u043a\u0430','\u0491\u0430\u043d\u043e\u043a','\u0431\u043e\u043b\u0456\u0434','\u0442\u0435\u0440\u0435\u043d','\u043a\u043e\u0442\u0435\u043b','\u0434\u0440\u0435\u0439\u0444','\u0434\u0440\u0456\u0437\u0434','\u043d\u0438\u0442\u043a\u0430','\u043a\u0430\u0432\u0443\u043d','\u0441\u043e\u0441\u043a\u0430','\u043f\u0440\u0438\u043d\u0446','\u0448\u043f\u0430\u043b\u0430','\u0436\u0456\u043d\u043a\u0430','\u043c\u0456\u0441\u0442\u043e','\u0442\u043e\u0432\u0430\u0440','\u0443\u0447\u0435\u043d\u044c','\u043d\u043e\u0441\u0456\u0439','\u043a\u0435\u0440\u043c\u043e','\u043a\u043b\u0456\u0448\u0435','\u0434\u0443\u0431\u043b\u044c','\u043a\u0443\u0440\u043a\u0430','\u043d\u0443\u0442\u0440\u043e','\u0441\u0438\u043b\u0430\u0447','\u0432\u0435\u0440\u0431\u0430','\u0434\u0456\u0432\u043a\u0430','\u0442\u043e\u0440\u0431\u0430','\u0431\u0430\u043d\u043a\u0430','\u0442\u0440\u0430\u0441\u0430','\u0432\u0456\u0440\u0430\u0436','\u0437\u0430\u0433\u0430\u043b','\u043f\u0440\u0435\u0441\u0430','\u0456\u0441\u043a\u0440\u0430','\u0441\u0438\u0440\u043e\u043f','\u043f\u043e\u0448\u0443\u043a','\u043e\u0431\u043b\u0456\u043a','\u0443\u0441\u043c\u0456\u0445','\u0433\u043e\u0440\u043b\u043e','\u043f\u043e\u0440\u0456\u0437','\u043a\u0443\u043f\u0430\u0436','\u043c\u043e\u0448\u043a\u0430','\u043c\u0456\u043d\u043e\u0440','\u0434\u0456\u0440\u043a\u0430','\u0435\u0442\u0438\u043a\u0430','\u0440\u0435\u0433\u0456\u0442','\u0443\u0432\u0430\u0433\u0430','\u043f\x27\u0454\u0441\u0430','\u0442\u0435\u043f\u043b\u043e','\u0440\u043e\u044f\u043b\u044c','\u0434\u0443\u043f\u043b\u043e','\u043e\u043a\u0443\u043d\u044c','\u0448\u0438\u043d\u043e\u043a','\u043c\x27\u044f\u0441\u043e','\u0433\u0430\u0441\u043b\u043e','\u0431\u0430\u0440\u0432\u0430','\u0432\u0434\u043e\u0432\u0430','\u044f\u0454\u0447\u043d\u044f','\u043f\u043e\u043a\u0430\u0437','\u0444\u043e\u043a\u0443\u0441','\u043d\u0430\u0442\u044f\u0433','\u0446\u0438\u0433\u0430\u043d','\u0432\u0443\u0430\u043b\u044c','\u0444\u0456\u043d\u0430\u043b','\u0454\u0432\u043d\u0443\u0445','\u043f\u0430\u043f\u043a\u0430','\u043c\u043e\u0439\u0432\u0430','\u0448\u043a\u0430\u043b\u0430','\u043e\u043a\u0456\u0441\u0442','\u043a\u043e\u043a\u043e\u043d','\u0441\u0442\u0440\u0443\u0441','\u043c\u0430\u0433\u043c\u0430','\u043e\u043b\u0435\u043d\u044f','\u0430\u043a\u0446\u0438\u0437','\u0431\u043b\u0430\u0433\u043e','\u043a\u0430\u0441\u0438\u0440','\u0441\u043e\u0441\u043d\u0430','\u0448\u043e\u0440\u0442\u0438','\u0436\u043d\u0438\u0432\u0430','\u043e\u0442\u0430\u0440\u0430','\u0448\u0430\u0431\u043b\u044f','\u0441\u0432\u0430\u0445\u0430','\u0433\u0456\u043b\u043b\u044f','\u043b\u0456\u0442\u0430\u043a','\u043b\u0438\u043c\u043e\u043d','\u0431\u0443\u0442\u043e\u043d','\u043f\u0456\u043a\u0430\u043f','\u043b\u0438\u0436\u043d\u044f','\u0432\u0438\u0441\u0438\u043f','\u043a\u043e\u0440\u043e\u043a','\u043f\u0430\u043a\u0435\u0442','\u0442\u0443\u0444\u043b\u044f','\u043c\u0435\u0434\u0456\u0430','\u0441\u043a\u043e\u0431\u0430','\u0437\u043e\u0448\u0438\u0442','\u0433\u0432\u0438\u043d\u0442','\u043b\u0430\u043f\u043a\u0438','\u0431\u0430\u043d\u0434\u0430','\u0434\u0440\u043e\u0432\u0430','\u0435\u043a\u043b\u0435\u0440','\u0446\u0435\u0433\u043b\u0430','\u0441\u043e\u0442\u043d\u044f','\u0444\u043e\u0440\u043c\u0430','\u043f\u043b\u0430\u0442\u0430','\u0441\u0442\u0435\u043b\u0430','\u0442\u0438\u0442\u0443\u043b','\u0441\u043c\u0435\u0440\u0447','\u0436\u0443\u0440\u0431\u0430','\u0441\u0442\u0440\u0435\u0441','\u043e\u0434\u0440\u0443\u043a','\u043d\u0435\u043b\u044e\u0434','\u0441\u0456\u043c\x27\u044f','\u0432\u0442\u0456\u0445\u0430','\u0433\u0430\u0434\u043a\u0430','\u043b\u0438\u0446\u0430\u0440','\u0437\u0430\u0454\u0446\u044c','\u0444\u0430\u0441\u043a\u0430','\u0434\u0456\u0454\u0442\u0430','\u0434\u0435\u0431\u044e\u0442','\u0445\u043c\u0456\u043b\u044c','\u0431\u0443\u043a\u0432\u0430','\u043a\u043e\u0439\u043e\u0442','\u0436\u0438\u0442\u043b\u043e','\u043a\u0430\u0441\u0442\u0430','\u0441\u0430\u0440\u0430\u0439','\u0434\u0437\u0438\u0491\u0430','\u043e\u043f\u0456\u0443\u043c','\u0437\u0430\u0441\u0456\u0431','\u043a\u0438\u0439\u043e\u043a','\u043a\u043e\u0448\u0438\u043a','\u043a\u0440\u0438\u043b\u044c','\u043f\u043b\u0430\u0441\u0442','\u0441\u043b\u043e\u0432\u043e','\u0448\u0438\u0440\u043c\u0430','\u0440\u043e\u0442\u043e\u0440','\u043c\u043e\u0440\u044f\u043a','\u0431\u043b\u0438\u0441\u043a','\u0440\u0430\u0439\u043e\u043d','\u0434\u0437\u0432\u0456\u043d','\u0431\u0430\u0431\u0430\u043a','\u0444\u0430\u0443\u043d\u0430','\u0444\u0435\u0440\u043c\u0430','\u043a\u0435\u0433\u043b\u044f','\u043f\u0430\u0440\u0442\u0430','\u0437\u0430\u043f\u0438\u0442','\u043e\u043f\u0446\u0456\u044f','\u0443\u0441\u043f\u0456\u0445','\u043c\u0430\u0436\u043e\u0440','\u0431\u0438\u0442\u0432\u0430','\u043e\u0440\u0433\u0430\u043d','\u043b\u0435\u0436\u0430\u043a','\u043d\u0430\u043f\u0456\u0440','\u0441\u0442\u0430\u043b\u044c','\u043a\u043e\u0441\u044f\u043a','\u043a\u043e\u043b\u0430\u0436','\u0432\u043f\u043b\u0438\u0432','\u0445\u043e\u043c\u0443\u0442','\u0430\u0432\u0442\u043e\u0440','\u043b\u0430\u0434\u0430\u043d','\u043f\u043e\u044f\u0432\u0430','\u0449\u043e\u0433\u043b\u0430','\u0434\u043e\u043f\u0438\u0442','\u0446\u0443\u043a\u043e\u0440','\u0444\u043e\u0431\u0456\u044f','\u0437\u043c\u043e\u0433\u0430','\u043a\u0430\u0434\u0438\u043a','\u043c\u0456\u0442\u043a\u0430','\u0430\u0491\u0440\u0443\u0441','\u043f\u043e\u0441\u043e\u043b','\u043c\u0430\u043b\u044e\u043a','\u043a\u0443\u043f\u043e\u043b','\u0442\u0435\u0447\u0456\u044f','\u043a\u0430\u0442\u043e\u0434','\u0431\u0430\u043d\u0430\u043d','\u0432\u0438\u0440\u0430\u0437','\u043b\u044e\u0431\u043e\u0432','\u0440\u0438\u0432\u043e\u043a','\u043f\u0456\u0441\u043d\u044f','\u043c\u0430\u0441\u043e\u043d','\u0446\u0438\u043d\u0456\u043a','\u0448\u0442\u043e\u0440\u0430','\u0434\u043e\u0433\u043c\u0430','\u0431\u0456\u0439\u043a\u0430','\u043d\u0438\u0437\u043a\u0430','\u043a\u0440\u043e\u043d\u0430','\u043a\u0443\u0440\u0430\u0436','\u0442\u043e\u0447\u043a\u0430','\u0447\u043e\u0445\u043e\u043b','\u0434\u0438\u0447\u043a\u0430','\u043b\u0456\u043d\u0456\u044f','\u0432\u043e\u0440\u043e\u043d','\u0441\u0443\u0434\u0434\u044f','\u043f\u0438\u043b\u043a\u0430','\u043a\u0430\u043f\u0446\u0456','\u0441\u043a\u043e\u0442\u0447','\u043c\u0430\u0439\u043d\u043e','\u0431\u043e\u0431\u0435\u0440','\u043f\u043e\u043b\u0456\u0441','\u0434\u043e\u043f\u0438\u0441','\u0436\u0435\u0440\u0435\u0431','\u043f\u043e\u0432\u0456\u0434','\u0431\u0443\u0437\u043e\u043a','\u0434\u0432\u0435\u0440\u0456','\u043e\u0433\u0438\u0434\u0430','\u0432\u0438\u0434\u0440\u0430','\u0437\u0435\u0440\u043d\u043e','\u0442\u0438\u0442\u0430\u043d','\u0436\u0438\u0440\u0430\u0444','\u0436\u0438\u0442\u0442\u044f','\u0432\u0430\u0440\u0430\u043d','\u0434\u0443\u0436\u043a\u0430','\u044f\u0432\u0438\u0449\u0435','\u043f\u043e\u0434\u0456\u044f','\u0448\u0442\u0430\u043c\u043f','\u043a\u0443\u0440\u0447\u0430','\u044f\u0440\u043b\u0438\u043a','\u0431\u0430\u043b\u0438\u043a','\u0437\u043b\u0438\u0432\u0430','\u0440\u0430\u043c\u0435\u043d','\u043c\u0435\u0442\u0430\u043b','\u0441\u0432\u0435\u0442\u0440','\u043a\u043e\u0431\u0440\u0430','\u0440\u0443\u043b\u043e\u043d','\u0441\u0430\u043b\u044e\u0442','\u0434\u0438\u0432\u0430\u043d','\u043a\u043e\u0440\u043c\u0430','\u043f\u043e\u0440\u0456\u0433','\u0441\u0443\u043a\u043d\u044f','\u0430\u0440\u043a\u0430\u043d','\u043c\u0430\u0441\u0438\u0432','\u043e\u0431\u0440\u0443\u0447','\u0432\u0435\u0433\u0430\u043d','\u0443\u0442\u0438\u0441\u043a','\u0440\u0435\u0442\u0443\u0448','\u0432\u0456\u044f\u043b\u043e','\u0456\u043d\u0434\u0438\u043a','\u043b\u0438\u0441\u0442\u044f','\u0440\u0430\u0434\u0430\u0440','\u0432\u0438\u0431\u0456\u0440','\u043b\u0456\u0440\u0438\u043a','\u0437\u0431\u0440\u043e\u044f','\u0432\u0435\u0440\u0435\u0441','\u0433\u0443\u0434\u043e\u043a','\u043f\u043e\u0457\u0437\u0434','\u0447\u043e\u0432\u0435\u043d','\u0441\u043f\u0438\u0440\u0442','\u0447\u0443\u0442\u0442\u044f','\u043c\u043e\u043b\u043e\u0442','\u043f\u0430\u0439\u043e\u043a','\u0442\u0430\u0431\u0456\u0440','\u0432\u0438\u043a\u0443\u043f','\u043a\u043e\u043b\u0456\u0440','\u0441\u0435\u043d\u0430\u0442','\u0441\u0432\u0438\u0441\u0442','\u0441\u0445\u043e\u0434\u0438','\u043a\u0430\u0437\u043d\u0430','\u0432\u0456\u0434\u0435\u043e','\u043a\u0443\u0431\u043e\u043a','\u043f\u0456\u0440\x27\u044f','\u0440\u043e\u043c\u0430\u043d','\u0437\u043b\u043e\u0431\u0430','\u044f\u0433\u0443\u0430\u0440','\u0441\u043b\u0443\u0433\u0430','\u043a\u0440\u0438\u043b\u043e','\u0431\u0443\u0433\u0430\u0439','\u0430\u043a\u043e\u0440\u0434','\u0440\u0430\u0434\u0456\u043e','\u043e\u0441\u043e\u0431\u0430','\u043e\u0431\u043c\u0430\u043d','\u0433\u0430\u043b\u0430\u0441','\u043e\u043d\u0443\u043a\u0430','\u043f\u0438\u044f\u043a\u0430','\u0432\u0438\u0440\u0456\u0439','\u0437\u0435\u0431\u0440\u0430','\u043d\u0430\u043c\u0456\u0440','\u043e\u0444\u0448\u043e\u0440','\u0441\u043a\u0443\u043d\u0441','\u043e\u043a\u043b\u0430\u0434','\u043c\u0430\u043d\u0435\u0436','\u043d\u0430\u043f\u0430\u0434','\u0432\u0438\u0433\u0438\u043d','\u0430\u0440\u0435\u0430\u043b','\u0435\u0433\u0456\u0434\u0430','\u0441\u0438\u043d\u044f\u043a','\u0433\u0443\u0441\u0430\u043a','\u043d\u0430\u043a\u0430\u0437','\u0431\u0443\u0440\u044f\u043a','\u043f\u043e\u0437\u043e\u0432','\u0441\u0438\u043d\u043e\u043a','\u043b\u0430\u0441\u043a\u0430','\u0445\u0430\u043a\u0435\u0440','\u0434\u043e\u0431\u0440\u043e','\u0432\u0456\u0441\u043f\u0430','\u0445\u043e\u043a\u0435\u0439','\u0448\u0440\u0438\u0444\u0442','\u0448\u0430\u0439\u0431\u0430','\u0449\u0456\u0442\u043a\u0430','\u043c\u0430\u0442\u0456\u0440','\u0431\u0440\u043e\u043d\u044f','\u0441\u0435\u0441\u0456\u044f','\u0431\u0430\u0448\u0442\u0430','\u0433\u0435\u0442\u0442\u043e','\u0437\u043c\u0456\u043d\u0430','\u043f\u0435\u043a\u043b\u043e','\u0441\u0442\u0440\u0430\u0445','\u043f\u0443\u0434\u0440\u0430','\u043c\u0456\u0434\u0456\u044f','\u043a\u0430\u0440\u0430\u0442','\u0447\u0430\u0448\u043a\u0430','\u043f\u0456\u0448\u0430\u043a','\u043e\u0431\u0448\u0443\u043a','\u043f\u0430\u0441\u043a\u0430','\u0445\u0443\u043c\u0443\u0441','\u0433\u0440\u0430\u043d\u044c','\u0443\u0434\u0430\u0447\u0430','\u0437\u0430\u043c\u0430\u0445','\u0442\u044f\u0433\u0430\u0440','\u0454\u0432\u0440\u0435\u0439','\u0437\u0430\u0432\u0430\u043b','\u0440\u0456\u0447\u043a\u0430','\u043e\u043f\u0430\u0434\u0438','\u0431\u0430\u043b\u0435\u0442','\u043e\u0441\u0456\u043d\u044c','\u0431\u0456\u043b\u043e\u043a','\u0441\u0443\u0445\u0430\u0440','\u0431\u0443\u0442\u0442\u044f','\u043b\u043e\u0442\u043e\u043a','\u043f\u043e\u0432\u0456\u044f','\u0431\u0456\u043b\u044f\u0448','\u043d\u0430\u0431\u0456\u0439','\u0448\u043f\u0438\u043b\u044c','\u043e\u0437\u043d\u043e\u0431','\u043e\u0441\u0435\u043b\u044f','\u0434\u043e\u0442\u0438\u043a','\u0442\u044f\u0433\u0430\u0447','\u0432\u0456\u0442\u0435\u0440','\u043d\u0430\u0442\u044f\u043a','\u0440\u0456\u0436\u043e\u043a','\u0441\u0443\u043a\u043d\u043e','\u0433\u0440\u0438\u0436\u0430','\u0441\u0442\u0430\u0442\u044c','\u0441\u0430\u043c\u043a\u0430','\u043f\u043e\u0434\u0438\u0432','\u043d\u0430\u043f\u0456\u0439','\u0433\u043e\u0440\u043e\u0445','\u0442\u0440\u0430\u043d\u0441','\u043a\u0430\u0446\u0430\u043f','\u043f\u043e\u043f\u0438\u0442','\u043e\u0440\u0433\u0456\u044f','\u0431\u0443\u0431\u043e\u043d','\u043f\u043e\u0431\u0443\u0442','\u0442\u044e\u0442\u044e\u043d','\u043a\u0440\u0443\u0457\u0437','\u0445\u0456\u043c\u0456\u044f','\u043b\u043e\u0436\u043a\u0430','\u0436\u043c\u0435\u043d\u044f','\u0431\u043e\u043c\u0431\u0430','\u043c\u0430\u0441\u043b\u043e','\u0430\u0432\u0435\u043d\u044e','\u0437\u0430\u0457\u0437\u0434','\u0434\u0435\u0440\u0443\u043d','\u0432\u0438\u0442\u0456\u043a','\u0448\u0442\u0438\u043b\u044c','\u043f\u0430\u0440\u0430\u0434','\u0442\u0430\u043b\u0456\u044f','\u0443\u0440\u043e\u043a\u0438','\u043a\u0430\u043b\u0430\u0447','\u0437\u0430\u043c\u0448\u0430','\u0434\u0443\u043c\u043a\u0430','\u043e\u043c\u0435\u043b\u0430','\u043f\u0456\u0441\u043e\u043a','\u043d\u0438\u0442\u0442\u044f','\u0431\u0430\u0442\u0443\u0442','\u0440\u043e\u043b\u0438\u043a','\u0491\u0430\u0437\u0434\u0430','\u043a\u0430\u0442\u0435\u0442','\u0437\u0430\u0442\u043e\u0440','\u043a\u0430\u0431\u0430\u043d','\u0432\u0438\u0440\u0432\u0430','\u043f\u0430\u0446\u044e\u043a','\u043f\u0440\u0430\u0432\u043e','\u0431\u0456\u0433\u0443\u043d','\u043b\u044e\u0442\u043d\u044f','\u043d\u0430\u0434\u0440\u0430','\u0431\u0456\u0439\u043d\u044f','\u0440\u0435\u0434\u0443\u0442','\u0433\u0435\u043d\u043e\u043c','\u0432\u0430\u0445\u0442\u0430','\u0432\u0438\u0440\u0456\u0437','\u043f\u0430\u043b\u0430\u0446','\u0448\u043f\u0440\u0438\u0446','\u043c\u043e\u0442\u0438\u0432','\u043a\u043b\u044f\u0447\u0430','\u043d\u0430\u0431\u0456\u0440','\u043a\u043e\u0448\u0442\u0438','\u043f\u043e\u0435\u043c\u0430','\u0444\u0443\u0433\u0430\u0441','\u0442\u0430\u043a\u0441\u0430','\u043b\u0456\u043b\u0456\u044f','\u0445\u0432\u0430\u043b\u0430','\u0433\u0456\u0441\u0442\u044c','\u0441\u044f\u0439\u0432\u043e','\u043e\u0436\u0438\u043d\u0430','\u0431\u0430\u0431\u0430\u0439','\u0444\u0430\u043b\u044c\u0448','\u043c\u0430\u0434\u044f\u0440','\u0432\u0456\u0432\u0446\u044f','\u043c\u0430\u0437\u043e\u043a','\u0437\u0456\u043b\u043b\u044f','\u043c\u0430\u0441\u0430\u0436','\u0441\u043e\u0432\u043e\u043a','\u043f\u043b\u043e\u0449\u0430','\u0445\u0443\u0442\u0440\u043e','\u0447\u0430\u0440\u043a\u0430','\u0441\u043a\u0440\u0438\u043f','\u0434\u0443\u0434\u043a\u0430','\u043b\u044f\u043f\u0430\u0441','\u0434\u043e\u0432\u0456\u0434','\u0445\u0440\u0435\u0441\u0442','\u043a\u0430\u0440\u043c\u0430','\u0442\u0456\u0442\u043a\u0430','\u0430\u043a\u0446\u0456\u044f','\u043a\u043e\u0431\u0437\u0430','\u043f\u043e\u0440\u0438\u0432','\u0442\u0430\u0440\u0430\u043d','\u0432\u0456\u0441\u0442\u044c','\u0437\u0430\u0445\u0456\u0434','\u0447\u0430\u0432\u0443\u043d','\u0434\u0435\u043c\u043e\u043d','\u043e\u043f\u0435\u0440\u0430','\u043c\u043e\u0440\u043e\u043a','\u0443\u0441\u0442\u0430\u0432','\u0456\u043c\u0431\u0438\u0440','\u0433\u0456\u0440\u043a\u0430','\u0433\u043b\u0438\u0431\u0430','\u043e\u0431\u043c\u0456\u043d','\u0431\u0430\u0433\u0430\u0447','\u0435\u0441\u043a\u0456\u0437','\u0441\u0435\u0430\u043d\u0441','\u0430\u0433\u0435\u043d\u0442','\u043c\u043e\u0440\u043e\u0437','\u043a\u0430\u0437\u043a\u0430','\u043f\u0430\u043d\u043d\u0430','\u043f\u043e\u043a\u0435\u0440','\u0432\u0443\u0439\u043a\u043e','\u0435\u043b\u0456\u0442\u0430','\u043a\u043b\u0435\u043c\u0430','\u043a\u0443\u0445\u0430\u0440','\u0432\u0438\u0431\u0443\u0445','\u0440\u044f\u0434\u043e\u043a','\u0431\u0440\u043e\u0432\u0430','\u043d\u0456\u0447\u0438\u044f','\u043a\u043e\u043c\u0456\u043a','\u0433\u043b\u0430\u0432\u0430','\u0434\u0435\u043a\u043e\u0440','\u0442\u0435\u0440\u043e\u0440','\u0444\u0430\u043a\u0435\u043b','\u0432\u0438\u0442\u043e\u043a','\u0441\u043c\u043e\u043b\u0430','\u0433\u0456\u0434\u0440\u0430','\u043b\u0430\u0432\u043a\u0430','\u043e\u0431\u0445\u0456\u0434','\u0432\u043e\u044f\u043a\u0430','\u0441\u0442\u0443\u043f\u0430','\u0437\u0430\u0431\u0456\u0439','\u043c\u0440\u0435\u0446\u044c','\u043c\u043e\u0437\u043e\u043a','\u0430\u043b\u0438\u0447\u0430','\u0430\u0431\u043e\u0440\u0442','\u0433\u043b\u0443\u0437\u0434','\u043c\u0430\u0437\u0443\u0442','\u043f\u043e\u0434\u0438\u0445','\u0444\u0440\u0443\u043a\u0442','\u043e\u043c\u043b\u0435\u0442','\u0441\u043e\u043d\u0435\u0442','\u0443\u0437\u0432\u0456\u0437','\u0433\u0443\u043b\u044f\u0448','\u0433\u0430\u0437\u043e\u043d','\u0430\u043d\u0433\u0435\u043b','\u0448\u0430\u0445\u0442\u0430','\u043f\u043e\u043b\u043e\u043d','\u0432\u0435\u0447\u0456\u0440','\u043d\u043e\u0440\u043a\u0430','\u0441\u0443\u043c\u043a\u0430','\u0432\x27\u0457\u0437\u0434','\u0437\u0433\u0440\u0430\u044f','\u0437\u0430\u043a\u0438\u0434','\u043f\u0443\u0445\u0438\u0440','\u0448\u0442\u0440\u0430\u0444','\u0442\u0443\u043b\u0443\u0431','\u0441\u0445\u0435\u043c\u0430','\u043f\u0430\u043f\u0456\u0440','\u043e\u043f\u043b\u043e\u0442','\u0440\u0443\u0441\u043b\u043e','\u0491\u0432\u0430\u043b\u0442','\u043a\u0443\u0437\u043e\u0432','\u043a\u0430\u0437\u0443\u0441','\u0441\u0442\u0435\u043b\u044f','\u0432\u0430\u043f\u043d\u043e','\u0437\u0430\u043b\u0456\u043a','\u0431\u0440\u0438\u043b\u044c','\u0431\u0430\u0433\u0430\u0436','\u0432\u0456\u0434\u0440\u043e','\u0433\u043e\u043b\u043e\u0434','\u0444\u0435\u0440\u0437\u044c','\u0432\u043c\u0456\u0441\u0442','\u044e\u0440\u0438\u0441\u0442','\u0435\u0444\u0435\u043a\u0442','\u0437\u0434\u043e\u0431\u0430','\u043c\u0430\u0441\u043a\u0430','\u043a\u0430\u043d\u0430\u0442','\u0432\u0456\u0440\u0443\u0441','\u0433\u0440\u0443\u043f\u0430','\u0442\u043e\u0442\u0435\u043c','\u0447\u0443\u043c\u0430\u043a','\u0441\u0443\u043c\u0456\u0448','\u043f\u0435\u0447\u0456\u044f','\u043f\u043e\u0441\u043e\u0445','\u043a\u0443\u043b\u0456\u0448','\u0431\u043b\u043e\u0445\u0430','\u043f\u043e\u043b\u0438\u0432','\u0430\u043c\u0435\u0431\u0430','\u0437\u0430\u043d\u043e\u0441','\u043e\u043a\u043e\u0432\u0438','\u0432\u0430\u0440\u0442\u0430','\u0433\u0443\u043c\u0443\u0441','\u043d\u0430\u0443\u043a\u0430','\u0433\u043e\u043b\u0443\u0431','\u0432\u0430\u0444\u043b\u044f','\u0431\u0430\u0433\u0435\u0442','\u043a\u043e\u043b\u0431\u0430','\u0432\u043e\u043a\u0430\u043b','\u0432\u0438\u0442\u0442\u044f','\u043d\u0430\u0440\u043e\u0434','\u0440\u043e\u0434\u0438\u0447','\u043f\u0443\u0447\u043e\u043a','\u043f\u0438\u0441\u0430\u0440','\u043f\u043e\u043f\u0456\u043b','\u0445\u0443\u0440\u043c\u0430','\u0440\u043e\u0431\u043e\u0442','\u043e\u0441\u0438\u043a\u0430','\u043b\u0456\u043c\u0456\u0442','\u0432\u0456\u043d\u0438\u043a','\u043b\u0435\u0434\u0430\u0440','\u0442\u0443\u043c\u0430\u043d','\u0437\u0440\u0430\u0434\u0430','\u0441\u0443\u0441\u0456\u0434','\u043f\u043e\u0442\u043e\u043f','\u0436\u043e\u043b\u043e\u0431','\u043e\u043a\u0441\u0438\u0434','\u043c\u0456\u0442\u043b\u0430','\u0434\u0435\u0440\u0431\u0456','\u043f\u043e\u043c\u043f\u0430','\u043a\u0438\u0434\u043e\u043a','\u0432\u043b\u0430\u0434\u0430','\u043a\u043e\u043f\u0456\u044f','\u0447\u0435\u0441\u0442\u044c','\u0430\u043a\u0442\u043e\u0440','\u0437\u0435\u043c\u043b\u044f','\u0441\u0435\u0440\u0446\u0435','\u0441\u0442\u0438\u043b\u044c','\u043a\u0443\u043b\u043e\u043d','\u0433\u043b\u0438\u0441\u0442','\u043a\u043e\u043b\u043e\u0441','\u043c\u0443\u043c\u0456\u044f','\u0431\u0443\u043b\u043a\u0430','\u0441\u0446\u0435\u043d\u0430','\u043a\u043e\u0430\u043b\u0430','\u0441\u043a\u043b\u0435\u043f','\u0456\u0434\u0456\u043e\u0442','\u0436\u0435\u0442\u043e\u043d','\u0432\u0456\u043a\u043d\u043e','\u0447\u0430\u0439\u043a\u0430','\u043a\u0440\u0443\u0447\u0430','\u043c\u0430\u043a\u0435\u0442','\u0432\u0456\u043b\u043b\u0430','\u043b\u0430\u0439\u043a\u0430','\u0441\u043c\u0443\u0433\u0430','\u0444\u0456\u043d\u0456\u043a','\u0440\u0443\u043b\u0435\u0442','\u0431\u0435\u043a\u043e\u043d','\u043e\u0440\u0434\u0435\u043d','\u0440\u0435\u043d\u0442\u0430','\u0434\u043e\u043a\u0456\u0440','\u0491\u0440\u0443\u043d\u0442','\u0431\u0456\u0441\u0435\u0440','\u0444\u0456\u043b\u0456\u044f','\u043f\u0435\u0440\u043e\u043d','\u0448\u0430\u043f\u043a\u0430','\u043d\u0430\u043f\u0438\u0441','\u0432\u0442\u0435\u0447\u0430','\u043e\u043b\u0438\u0432\u0430','\u0441\u043e\u043f\u043a\u0430','\u0440\u0442\u0443\u0442\u044c','\u0433\u043b\u0438\u043d\u0430','\u043c\u0430\u0440\u043a\u0430','\u0442\u043e\u043d\u0443\u0441','\u0432\u0438\u043c\x27\u044f','\u044f\u043b\u0438\u043d\u0430','\u0432\u0430\u0441\u0430\u043b','\u043f\u043e\u0434\u0456\u043b','\u043e\u0431\u0433\u0456\u043d','\u0437\u0440\u0456\u0441\u0442','\u0441\u0442\u0440\u0443\u043c','\u0436\u0440\u0435\u0446\u044c','\u0448\u0435\u043f\u0456\u0442','\u0440\u0435\u0431\u0440\u043e','\u0440\u0435\u0448\u043a\u0430','\u043a\u043e\u0440\u0430\u043b','\u0441\u043e\u043a\u0456\u043b','\u0441\u0430\u043f\u0435\u0440','\u0442\u0440\u0443\u0431\u0430','\u043c\u0430\u0432\u043f\u0430','\u0456\u043d\u0442\u0438\u043c','\u0442\u044e\u0440\u043c\u0430','\u0444\u0440\u0430\u0437\u0430','\u0432\u0430\u0437\u043e\u043d','\u043e\u043b\u043e\u0432\u043e','\u0430\u043a\u0443\u043b\u0430','\u0430\u0432\u0435\u0440\u0441','\u0448\u0432\u0435\u0446\u044c','\u0442\u0435\u0441\u0442\u044c','\u043f\u0430\u0447\u043a\u0430','\u0430\u0440\u0435\u0448\u0442','\u0432\u043e\u0436\u0434\u044c','\u0442\u0430\u043d\u0433\u043e','\u043e\u0431\u0440\u044f\u0434','\u0454\u0437\u0443\u0457\u0442','\u043d\u043e\u043c\u0435\u0440','\u0440\u0438\u043d\u043e\u043a','\u043a\u043e\u043a\u043e\u0441','\u0442\u0435\u0441\u043b\u044f','\u043d\u0435\u0442\u0440\u0456','\u0432\u0443\u0441\u0442\u0430','\u0432\u0438\u0433\u0443\u043a','\u043c\u0443\u043b\u044f\u0436','\u0442\u0440\u0435\u043d\u0434','\u0441\u043e\u043b\u043e\u0434','\u0445\u0438\u0436\u0430\u043a','\u0442\u0430\u0432\u0440\u043e','\u0432\u0438\u0457\u0437\u0434','\u0433\u0443\u0431\u043a\u0430','\u0440\u043e\u0437\u0443\u043c','\u0442\u0430\u043f\u0456\u0440','\u0442\u0430\u0431\u0443\u043d','\u043e\u0431\x27\u0454\u043c','\u043a\u043b\u043e\u0443\u043d','\u043a\u0432\u043e\u0442\u0430','\u0432\u0435\u043b\u0438\u0447','\u043a\u0440\u0438\u0433\u0430','\u043a\u0440\u0435\u0434\u043e','\u043a\u0430\u0436\u0430\u043d','\u043f\u0435\u0442\u043b\u044f','\u0431\u0430\u0440\u0430\u043a','\u0444\u0430\u0441\u0430\u0434','\u0442\u0430\u043b\u0430\u043d','\u0442\u0443\u0440\u043a\u0430','\u043f\u043e\u043b\u044e\u0441','\u0445\u043e\u0431\u043e\u0442','\u0441\u0443\u0434\u043d\u043e','\u043a\u0443\u043f\u043e\u043d','\u0447\u0430\u0431\u0430\u043d','\u0445\u0443\u0442\u0456\u0440','\u0437\u0430\u043a\u043e\u043d','\u0433\u043e\u0440\u0456\u0445','\u0434\u043e\u043a\u0430\u0437','\u0448\u0438\u0448\u043a\u0430','\u043b\u0430\u0432\u0430\u0448','\u0442\u0440\u0443\u0441\u0438','\u0440\u0443\u043a\u0430\u0432','\u0431\u043e\u0454\u0446\u044c','\u043a\u0440\u0443\u043f\u0430','\u0431\u0430\u043b\u043e\u043d','\u043a\u0438\u0448\u043a\u0430','\u0433\u0440\u043e\u0437\u0430','\u0430\u0432\u0430\u043d\u0441','\u0444\u0440\u043e\u043d\u0442','\u043a\u043e\u043d\u0438\u043a','\u0430\u0440\u0445\u0456\u0432','\u043c\x27\u044f\u0442\u0430','\u043f\u0435\u043a\u0430\u0440','\u0433\u043e\u043d\u043a\u0430','\u0431\u0440\u0430\u043c\u0430','\u0433\u0435\u043d\u0456\u0439','\u0441\u043e\u0440\u043e\u043c','\u0431\u0440\u043e\u043d\u044c','\u0431\u043b\u0430\u043d\u043a','\u0432\u0430\u043b\u0435\u0442','\u0442\u0435\u0440\u0442\u044f','\u0448\u043e\u043b\u043e\u043c','\u0437\u0433\u043e\u0434\u0430','\u043a\u043e\u043b\u044c\u0454','\u0446\u044f\u0442\u043a\u0430','\u0433\u0456\u0454\u043d\u0430','\u0434\u043e\u043d\u043e\u0440','\u0442\u0443\u043f\u0438\u043a','\u0441\u043f\u0435\u043a\u0430','\u0430\u043b\u0456\u0431\u0456','\u0444\u0430\u0437\u0430\u043d','\u043a\u0456\u0441\u0442\u0430','\u0432\u0456\u0439\u043d\u0430','\u043e\u0441\u043e\u043a\u0430','\u043a\u0443\u043b\u044c\u0442','\u043b\u0430\u043c\u043f\u0430','\u043a\u043b\u0456\u0449\u0456','\u0441\u043f\u043b\u0430\u0432','\u0441\u0432\u043e\u044f\u043a','\u0432\u0430\u0440\u044f\u0433','\u0432\u0456\u0437\u043e\u043a','\u0442\u0440\u0430\u0432\u0430','\u043c\u0430\u0439\u043e\u0440','\u0432\u0437\u0432\u043e\u0434','\u043f\u0440\u043e\u0441\u043e','\u0437\u0456\u0440\u043a\u0430','\u0437\x27\u0457\u0437\u0434','\u043f\u043e\u0445\u0456\u0434','\u043a\u043e\u0437\u0430\u043a','\u0437\u0430\u0431\u0456\u0433','\u0430\u043a\u0442\u0438\u0432','\u0433\u0440\u0438\u0432\u0430','\u0440\u0443\u0431\u0456\u0436','\u043f\u0456\u043a\u0435\u0442','\u0442\u0435\u0441\u0430\u043a','\u0431\u0443\u0445\u0442\u0430','\u043c\u0435\u0442\u0440\u043e','\u0433\u043e\u043c\u0456\u043d','\u0446\u0443\u0446\u0438\u043a','\u0431\u0430\u0440\u0430\u043d','\u0435\u0441\u0442\u0435\u0442','\u043e\u0431\u0432\u0430\u043b','\u043d\u0430\u0444\u0442\u0430','\u0436\u043d\u0435\u0446\u044c','\u0441\u0456\u0442\u043a\u0430','\u0441\u0432\u044f\u0442\u043e','\u0432\u0435\u043b\u044e\u0440','\u043c\u043e\u043d\u0430\u0445','\u0442\u0438\u0440\u0430\u0436','\u0448\u0435\u0440\u0438\u0444','\u0434\u0435\u0431\u0435\u0442','\u043e\u043c\u0430\u043d\u0430','\u0431\u0430\u0431\u043a\u0430','\u0445\u0432\u0438\u043b\u044f','\u0431\u0438\u0442\u043e\u043a','\u0441\u0442\u043e\u0432\u043f','\u0434\u0430\u043c\u0431\u0430','\u043c\u0430\u043d\u0433\u043e','\u0444\u0456\u0440\u043c\u0430','\u0430\u0431\u0437\u0430\u0446','\u0441\u043b\u0438\u043d\u0430','\u0448\u043a\u043e\u043b\u0430','\u0431\u0443\u043a\u0435\u0442','\u043b\u0456\u0436\u043a\u043e','\u0437\u0430\u043f\u0438\u0441','\u043b\u043e\u0442\u043e\u0441','\u0431\u043b\u044f\u0445\u0430','\u043d\u0430\u043a\u0438\u043f','\u0431\u0438\u0434\u043b\u043e','\u0431\u0456\u043b\u0435\u0442','\u043b\u0456\u0432\u0435\u0440','\u043b\u0438\u043c\u0430\u043d','\u043e\u0442\u0435\u0446\u044c','\u0430\u043d\u0433\u0430\u0440','\u0433\u0440\u0430\u043d\u0442','\u0437\u0430\u0457\u043a\u0430','\u0437\u0430\u043f\u0430\u043b','\u0441\u043b\u0435\u043d\u0433','\u043b\u0430\u0437\u0443\u0440','\u043e\u043a\u0440\u0456\u043f','\u043a\u0443\u0437\u043d\u044f','\u043f\u0443\u0433\u0430\u0447','\u0435\u0442\u043d\u043e\u0441','\u0439\u043e\u043b\u043e\u043f','\u0441\u043a\u0432\u0435\u0440','\u0433\u0438\u0440\u043b\u043e','\u0436\u043e\u0440\u043d\u0430','\u0430\u0444\u0435\u0440\u0430','\u043d\u0430\u0441\u0438\u043f','\u043c\u043e\u0440\u0434\u0430','\u0433\u0430\u0439\u043a\u0430','\u0431\u043e\u0447\u043a\u0430','\u0434\u0456\u0432\u0447\u0430','\u0432\u0438\u0434\u0438\u0445','\u043a\u0456\u043e\u0441\u043a','\u0437\u0430\u044f\u0432\u0430','\u0437\u0430\u043f\u0430\u0445','\u043a\u0440\u0438\u0437\u0430','\u0432\u0443\u0434\u043a\u0430','\u0430\u0440\u043a\u0443\u0448','\u0433\u043e\u043b\u043a\u0430','\u0434\u0443\u0435\u043b\u044c','\u043b\u0430\u0442\u043a\u0430','\u0442\u0430\u0431\u043b\u043e','\u0440\u0443\u0457\u043d\u0430','\u043c\u0435\u0442\u043e\u0434','\u043a\u0443\u0442\u043e\u043a','\u0447\u0435\u0440\u0435\u043f','\u0441\u0430\u043b\u043e\u043d','\u0437\u0430\u043c\u043e\u043a','\u043e\u043b\u0435\u043d\u044c','\u043f\u0430\u0441\u043c\u043e','\u043d\u0430\u0445\u0438\u043b','\u044f\u0433\u043e\u0434\u0430','\u0431\u0435\u0442\u043e\u043d','\u0434\u0437\u044c\u043e\u0431','\u0433\u0430\u0440\u0430\u0436','\u0432\u0435\u0441\u043b\u043e','\u043f\u0448\u043e\u043d\u043e','\u0442\u0440\u0456\u0441\u043a','\u0454\u0440\u0435\u0441\u044c','\u0432\u0430\u043d\u043d\u0430','\u0433\u0435\u0440\u043e\u0439','\u0440\u0430\u043c\u043f\u0430','\u0445\u043e\u043b\u043e\u0434','\u0441\u043a\u0435\u043b\u044f','\u043f\u043b\u0435\u0447\u0435','\u043c\u0443\u0448\u043b\u044f','\u043a\u0435\u0444\u0456\u0440','\u0431\u0430\u0440\u0436\u0430','\u0432\u043e\u0432\u043d\u0430','\u0433\u0443\u043c\u043a\u0430','\u0430\u0441\u0442\u043c\u0430','\u0431\u0443\u0434\u043a\u0430','\u0448\u043a\u0456\u0440\u0430','\u043f\u0440\u043e\u044f\u0432','\u043c\u0430\u043b\u044f\u0440','\u0433\u0440\u0443\u0448\u0430','\u0437\u0430\u043f\u0430\u0441','\u043c\u0456\u043d\u0443\u0441','\u043a\u0432\u0456\u0442\u0438','\u0437\u0430\u0434\u0443\u043c','\u0433\u0443\u043c\u043e\u0440','\u043c\u0435\u0442\u0438\u0441','\u043b\u0456\u0439\u043a\u0430','\u0442\u0435\u043c\u0431\u0440','\u043f\u0430\u0441\u0442\u0430','\u0437\u0430\u0433\u0456\u043d','\u043c\u0430\u0439\u043a\u0430','\u043f\u0442\u0438\u0446\u044f','\u044e\u043d\u0456\u043e\u0440','\u0445\u043c\u0430\u0440\u0430','\u0441\u043f\u043e\u0440\u0442','\u0432\x27\u0457\u0437\u0434','\u043f\u043e\u0442\u044f\u0433','\u043f\u0430\u0432\u0443\u043a','\u0443\u043c\u043e\u0432\u0430','\u0431\u043e\u043d\u0443\u0441','\u043b\u0456\u0434\u0435\u0440','\u0445\u0430\u0431\u0430\u0440','\u0431\u0456\u0440\u0436\u0430','\u0443\u0437\u0432\u0430\u0440','\u043c\u0430\u0441\u0442\u044c','\u0442\u0430\u0447\u043a\u0430','\u0437\u0435\u0444\u0456\u0440','\u0440\u0430\u0446\u0456\u044f','\u043d\u0456\u0436\u043a\u0430','\u0434\u0438\u043b\u0435\u0440','\u0441\u043a\u0430\u0440\u0431','\u043f\u043b\u044f\u043c\u0430','\u043c\u0456\u0441\u0446\u0435','\u043f\u0438\u0440\u0456\u0433','\u0440\u043e\u0434\u0435\u043e','\u0430\u0440\u043c\u0456\u044f','\u043f\u043b\u043e\u0442\u044c','\u043d\u0430\u0446\u0456\u044f','\u0440\u0435\u0431\u0443\u0441','\u0447\u0435\u0440\u0433\u0430','\u043e\u0431\u0435\u0440\u0442','\u0432\u0438\u0442\u044f\u0433','\u0441\u0442\u0430\u0440\u0442','\u0437\u043e\u043c\u0431\u0456','\u043c\u0443\u0437\u0435\u0439','\u043f\u0430\u0443\u0437\u0430','\u0431\u0430\u0439\u043a\u0430','\u043a\u043e\u0436\u0443\u0445','\u043a\u0435\u0431\u0430\u0431','\u043f\u0430\u0440\u043e\u043c','\u0432\u043a\u043b\u0430\u0434','\u0430\u0444\u0456\u0448\u0430','\u043f\u0440\u0430\u0446\u044f','\u043a\u0430\u0442\u0435\u0440','\u0435\u043f\u043e\u0445\u0430','\u043a\u0430\u0434\u0435\u0442','\u0431\u0430\u0440\u043e\u043d','\u043f\x27\u044f\u0442\u0430','\u043a\u0430\u0437\u0430\u043d','\u0442\u0430\u0440\u0438\u0444','\u043c\u0435\u0440\u0456\u044f','\u043f\u043e\u0441\u0456\u0432','\u0444\u0456\u043b\u044c\u043c','\u0431\u0435\u0440\u0435\u0442','\u0448\u0442\u0443\u0440\u043c','\u0435\u043a\u0440\u0430\u043d','\u0442\u0440\u043e\u043c\u0431','\u0432\u043e\u0434\u0456\u0439','\u0431\u044e\u0432\u0435\u0442','\u0431\u0456\u043b\u043a\u0430','\u0431\u0430\u043b\u043a\u0430','\u043a\u0456\u0448\u043a\u0430','\u043e\u043f\u0430\u0440\u0430','\u0443\u0433\u043e\u0434\u0430','\u043f\u043b\u0430\u0442\u043e','\u0437\u0430\u0440\u044f\u0434','\u043f\u0440\u043e\u0431\u0430','\u043c\u0435\u0441\u0456\u044f','\u0433\u0443\u0446\u0443\u043b','\u0445\u043e\u0440\u0434\u0430','\u0448\u0442\u043e\u0440\u043c','\u0440\u0443\u043f\u043e\u0440','\u0440\u0443\u0431\u0456\u043d','\u043d\u0435\u0431\u0456\u0436','\u0440\u0438\u0437\u0438\u043a','\u0434\u043e\u0445\u0456\u0434','\u0441\u0430\u043b\u0430\u0442','\u0441\u043e\u043d\u0446\u0435','\u0441\u0442\u0432\u043e\u043b','\u043a\u043e\u043c\u0430\u0440','\u0456\u0441\u043f\u0438\u0442','\u0430\u043e\u0440\u0442\u0430','\u0441\u0435\u0437\u043e\u043d','\u0434\u0438\u043a\u0443\u043d','\u0441\u0444\u0435\u0440\u0430','\u043a\u0430\u043d\u0430\u043b','\u0431\u0456\u0437\u043e\u043d','\u043a\u0443\u0440\u043e\u043a','\u0445\u0430\u043b\u0430\u0442','\u0448\u043e\u0444\u0435\u0440','\u0437\u0435\u043d\u0456\u0442','\u0442\u0435\u043a\u0441\u0442','\u0430\u0442\u043b\u0435\u0442','\u043c\u0430\u0440\u0436\u0430','\u043e\u0431\u0440\u0456\u0439','\u043c\u0430\u0444\u0456\u044f','\u043d\u0430\u0441\u043e\u0441','\u043d\u0438\u0442\u0438\u043a','\u043f\u043e\u043c\u0456\u0447','\u043b\u0430\u043f\u0448\u0430','\u0433\u0440\u043e\u0448\u0456','\u043b\u0430\u0437\u0435\u0440','\u0442\u0430\u043d\u043e\u043a','\u0442\u0435\u0437\u043a\u0430','\u0432\u0438\u0440\u043e\u043a','\u0432\u0456\u0441\u043a\u0456','\u043a\u0435\u0448\x27\u044e','\u043a\u0443\u043b\u0430\u043a','\u0433\u0440\u0443\u0434\u0438','\u0432\u0456\u043d\u043e\u043a','\u0446\u0435\u043d\u0442\u0440','\u0436\u0443\u043f\u0430\u043d','\u043c\u043e\u0434\u0435\u043c','\u043d\u0430\u0437\u0432\u0430','\u0433\u0430\u043b\u043e\u043f','\u043a\u043e\u0444\u0442\u0430','\u0440\u0430\u043d\u043e\u043a','\u043a\u0438\u043b\u0438\u043c','\u0432\u0438\u043c\u0456\u0440','\u0432\u0438\u0440\u0456\u0431','\u0449\u0430\u0441\u0442\u044f','\u0447\u043e\u0431\u0456\u0442','\u0430\u043b\u043c\u0430\u0437','\u0441\u043e\u043f\u043b\u043e','\u043c\u0430\u0440\u043b\u044f','\u0441\u043f\u0443\u0441\u043a','\u0433\u0456\u043b\u043a\u0430','\u043a\u043e\u043c\u0456\u0440','\u0432\u0442\u043e\u043c\u0430','\u043a\u0430\u0447\u0430\u043d','\u043a\u0430\u043d\u043e\u0435','\u0431\u0430\u0442\u043e\u043d','\u0444\u0430\u043d\u0430\u0442','\u0434\u0456\u0436\u043a\u0430','\u0440\u0435\u043a\u0435\u0442','\u043c\u0456\u0441\u0456\u044f','\u043a\u0430\u043d\u043e\u043d','\u0441\u043f\u0430\u0437\u043c','\u043f\u043e\u043c\u0438\u0457','\u0432\u0438\u0445\u043e\u0440','\u0433\u0440\u0430\u0444\u0430','\u0441\u0456\u0434\u043b\u043e','\u0433\u0440\u0438\u043b\u044c','\u0440\u0435\u0448\u0442\u0430','\u043a\u0430\u043c\u0456\u043d','\u0448\u0438\u043d\u043a\u0430','\u0441\u044e\u0436\u0435\u0442','\u0432\u0443\u0433\u043e\u0440','\u0431\u0443\u0444\u0435\u0442','\u043c\u0430\u0442\u043a\u0430','\u0456\u0441\u043b\u0430\u043c','\u043c\u043e\u0442\u043e\u043a','\u0440\u0443\u0447\u043a\u0430'];return a[getIssueNumber(0x5)%a['\x6c\x65\x6e\x67\x74\x68']];}
    },
    {
      lettersLimit: 6,
      attemptsLimit: 6,
      firstDay: new Date("Thu Sep 11 2024 23:00:00 GMT+0200 (EET)"),
      promoMessage: "Все те ж саме, тільки на 20% цікавіше!",
      words: (w) => ["абажур","абсент","абсинт","абсурд","абсцес","абулія","август","аварія","аватар","авенір","аврора","агамія","агенда","агітка","агонія","адажіо","аденін","аджика","адитив","адреса","амплуа","ампула","амулет","амфора","аналіз","ананас","аналог","анатом","ангіна","анемія","анілін","анкета","аннали","анклав","анонім","анорак","антена","анурез","анурія","анчоус","аншлаг","аншлюс","апетит","апліке","апломб","апогей","аполог","апофіз","азбест","азбука","азимут","айкідо","академ","акання","акаунт","акація","акцент","акцепт","акушер","алалія","аланін","алатив","алегро","алніко","алоген","алотип","алофон","алювій","алюзія","аматор","амоній","аптека","апсида","арахіс","арійка","аркада","армада","арнаут","аромат","аронія","артист","артрит","артроз","арфіст","арф’яр","асесор","аскеза","асорті","аспект","астрал","атеїзм","атеїст","атипія","атитюд","атлант","атонія","атріум","аутизм","аутинг","аутлет","афазія","афгані","афелій","афінаж","афронт","ахання","ахінея","ацетат","ацетон","ацидоз","аятола","бабник","бабище","бабізм","багета","багнет","бажант","байдак","байдик","базука","байбак","байкер","байрак","баклан","балада","баланс","баласт","балкер","балкон","балощі","баляси","бамбук","бампер","банджо","бандит","бандаж","бандур","банкет","банник","бансай","бантик","банкір","баобаб","барбос","бар’єр","бариня","баркас","бармен","баріон","бароко","бартер","бартка","бархан","бархат","басейн","бахила","бахили","бацила","башкир","башмак","баштан","бедлам","бедуїн","бігуді","бідняк","бізант","бізнес","бікіні","білина","білуга","білуха","біндер","біолог","біофак","біотик","біотип","бісеня","бірюза","бісмут","бітник","бістро","біцепс","благач","бленда","блесна","блогер","блукач","блютус","бобина","бобіна","бляхар","бовдур","бовтун","богиня","богдан","бодега","бограч","бодяга","бозони","бойкот","бойлер","божоле","болван","болеро","боксер","боксит","болото","бомонд","бондар","бонсай","бондон","бордюр","борода","борона","бездна","бездух","безлад","безліч","безмен","безсуд","безцін","бензин","бензен","бензил","бензол","бенкет","бентос","бербер","береза","берест","беркут","бесіда","бескид","бешкет","билина","бівуак","біблія","борсук","бортик","босняк","босота","ботокс","боцман","боягуз","боярин","брання","братва","браток","братик","брахма","бревіс","брелок","бретон","брехіт","брехня","брехтя","бризки","брикет","бритва","бровар","бриття","бричка","брівка","бровка","брокер","бронза","бронхи","брошка","брукіт","брусок","брюнет","брутто","бублик","будова","будуар","бузина","буйвіл","буксир","булава","буклет","булгур","бункер","бунтар","бурбон","бурдон","буржуа","буржуй","буриме","буркут","бурлак","буркіт","буртик","бусина","бусідо","бустер","бур’ян","бушлат","бушмен","бюджет","бюргер","вагіна","вакуум","валіза","валюта","вандал","вампір","вантуз","варвар","вапняк","вар’ят","васабі","ватман","ватага","ватник","ваучер","вахтер","вбивця","вбирач","вгіддя","ведизм","везуха","вектор","вендор","вербка","вереда","вереск","вермут","вертел","вертеп","версія","верста","весляр","вечеря","вжиток","взуття","вибрик","вибори","виверт","вигляд","вигода","виграш","видача","видрук","вігвам","вівтар","вівчар","відбив","відбій","відбір","відвал","відвід","відвар","відвіз","відгин","відгін","відгук","відгул","відділ","відзив","відкат","відкид","відкол","відкуп","відлив","відлік","відліт","відлов","відпад","відпил","відпис","відрив","відріз","відруб","відсік","відсіч","відсип","відсів","відтин","відтік","відхил","відхід","відчай","відшиб","візаві","вікінг","віконт","вінчик","вінтаж","віріон","вірмен","віршик","вістря","віслюк","вісмут","вісник","вітраж","вітряк","вітчим","визвіл","визгін","виїмка","виклик","виклад","викрик","викрій","викрут","вилиця","вилога","вимова","вимога","вимпел","винайм","винник","виплат","виплід","випуск","виріст","вислів","виспів","висота","виступ","витвір","виторг","виучка","вихлоп","вишина","вишкіл","вишник","віадук","віялка","віяння","віячка","вмикач","вміння","внесок","вогник","водило","водиця","вокзал","волока","воркіт","ворона","вороня","ворота","вояжер","вписка","вправа","врізка","врожай","втікач","втрата","втретє","втулка","вудило","вуглик","вулиця","вулкан","вуркіт","вусища","вчення","вчинок","в’язка","в’юрок","гавкіт","гагауз","гаєчка","гадина","гаївка","гайдай","галеон","галера","гамаші","гамбіт","гамета","гаплик","гарбуз","гарант","гаркіт","гарига","гармаш","гарпія","гарпун","гарнір","гарсон","гасник","гафній","гейзер","геймер","гексил","гексин","гектар","гірник","гірняк","гітара","глазур","глечик","глобус","глотка","глухар","глютен","глядач","гнилля","гніздо","гниття","гнуття","година","гоєння","голова","голота","гонада","гончар","гопник","гонщик","гендер","генсек","геолог","гепард","гептил","геркон","героїн","герпес","герцог","гетера","гидота","гібрид","гігант","гідрид","гідроз","гінкго","гіпноз","горбун","горган","гордій","горила","горище","гормон","горожа","горщик","госпел","готика","грабіж","грабар","граблі","гравер","гравій","гравіс","градус","гранат","грандж","граніт","гранка","граття","графин","графік","графіт","грація","гребля","гребок","гречка","гривня","гризня","гризун","гример","грифон","грілка","грінго","грінка","грішок","грохот","грубер","грубка","грудка","грузин","грядка","гуанін","гудрон","гуляка","гурман","гуркіт","гусеня","гусляр","гутник","ґонтар","ґудзик","давина","дайвер","данина","датчик","дачник","дбання","дверці","двигун","двійня","двійця","двірка","двозуб","дворик","деісус","декада","декрет","делікт","демарш","денник","денщик","депеша","дервіш","дергач","дерево","діаліз","діалог","діарея","діатез","діваха","дігтяр","дієпис","діоптр","діорит","дітлах","діурез","діяння","діячка","добряк","довбня","довжик","довіра","догана","догляд","догмат","догода","додача","дозвіл","доїння","дойник","докора","доктор","долина","долоня","долото","доміно","допінг","дереза","держак","деркач","десант","десерт","деспот","дефект","дефіле","дефолт","дещиця","джезва","джерсі","джигіт","джокер","дзвони","дзюрок","дивина","дигліф","диграф","дизайн","диктат","диктор","дикція","дилема","динамо","диплом","диптих","диспут","дитина","дихало","дичина","диявол","диякон","діабет","допуск","дорадо","дорога","досвід","дослід","доспіх","доступ","дотепа","доцент","доярка","драгун","дранка","дракон","древко","драхма","дренаж","дримба","дрібка","дрібок","дрівця","дрізки","дротик","дружба","дублер","дубляж","дуплет","дундук","дурепа","дурман","духота","дюжина","дядина","дячиха","ебоніт","еврика","егоїзм","егоїст","екзема","еківок","екіпаж","еколог","економ","екоцид","експат","екстаз","емірат","емісар","емісія","емітер","емоція","ендуро","енігма","енурез","епатаж","епігон","епізод","епілог","епіфіз","епітет","еполет","епопея","ексцес","елегія","елевон","елерон","елювій","ерозія","ерудит","есеїзм","есеїст","ескімо","ескорт","естамп","еталон","етанол","етикет","етруск","ешафот","ехолот","ешелон","єкання","єралаш","єретик","єхидна","жабеня","жадоба","жалоба","жалощі","жалюзі","жаргон","жасмин","жбанок","жебрак","жевжик","жирафа","житник","жмурки","жнивар","жердка","жертва","живина","живиця","живчик","жиголо","жиклер","жовток","жожоба","журкіт","журнал","забава","завада","завала","завгар","завіса","завмаг","завлаб","задача","задира","задник","задуха","заклик","заклад","захват","захист","зачепа","заявка","збирач","збитки","збиток","збиття","збіжжя","збірка","зблиск","зброяр","зварка","звання","звичай","звичка","звірка","зворот","згадка","згарок","згірок","зговір","здобич","здогад","земляк","зенкер","зигзаг","зигота","залізо","залоза","заміна","заплив","запуск","зараза","заслін","заслон","заспів","застій","заступ","засуха","затвор","затока","зівака","зіниця","зйомка","зливок","злидар","злидні","злиток","злиття","зліпок","злодій","злочин","змазка","змилок","змінна","змієїд","змійка","зміюка","знадіб","знадоб","знання","знахар","значок","знижка","знімок","знімач","зняття","зодіак","зозуля","золото","зонтик","зондаж","зоолог","зразок","зрізка","зубило","зубчик","зшивач","зяблик","ігуана","ігумен","ідейка","ідилія","ідіома","ієрарх","ізобар","ізогон","ізомер","ізотоп","інженю","інкасо","інсайд","інсайт","інтерн","іконка","ікорка","ілюзія","імпала","імпорт","інвойс","індекс","індиго","інцест","іридій","іриній","іриска","ірокез","іронія","істина","істмат","істота","іхтіоз","ішемія","їжачок","йогурт","йоржик","йоруба","кабала","кабіна","каблук","кабаре","кав’яр","кадило","казеїн","казино","кайдан","казкар","какаду","кактус","калібр","калина","каліка","калоша","калкан","калюжа","камбуз","камзол","камера","кампус","канава","канапа","канапе","канкан","кантик","кантон","кантор","кантрі","капела","каолін","капама","каперс","капкан","каплун","капрал","капсид","караїм","карате","караул","карбід","карбон","кардан","карета","кар’єр","каркас","карієс","карлик","карниз","картер","картеч","картка","картон","картуз","картуш","касета","каскад","карцер","кастет","кастор","катана","катіон","катран","кафтан","кахляр","каченя","кашиця","кашкет","каштан","квазаг","квазар","квакер","квакша","коліно","колода","колоїд","колона","колчан","коляда","комаха","комбат","комдив","комета","комізм","комікс","комора","компас","компот","комуна","конвой","кондом","кондор","конина","конкур","консул","контур","конура","конфуз","коняка","копито","копиця","копняк","кордит","кордон","корвет","корида","корито","кориця","корнет","короїд","корова","корона","корсар","корсет","кортеж","кортик","корпус","корсаж","корунд","корчма","космос","костел","косуля","косуха","косяка","костюм","котедж","котляр","кварта","квиток","квітка","кворум","квочка","кевлар","кемпер","кетчуп","киргиз","кисляк","кишлак","кишмиш","кишеня","киянин","киянка","ківшик","кігтик","кімоно","кіндза","кінчик","кістяк","клапан","кладка","клейка","клеймо","клекіт","клепач","клепка","кликун","клинок","клімат","клієнт","клізма","кліпер","кліпса","клірик","клірос","кліщик","клоака","клобук","клумба","клювок","клятва","кнайпа","кнесет","книгар","книжка","кнопка","княжич","княжна","кобзар","кобила","кобура","ковдра","ковзан","ковток","ковтун","ковчег","кодеїн","кодекс","козлик","козуля","козеня","коїтус","кокаїн","колдун","колега","коледж","колапс","колесо","колиба","кошара","коцюба","кошеня","кошмар","крадіж","крадій","країна","крамар","краник","крапка","крапля","кратер","кредит","крейда","крекер","крекіт","кретин","кречет","кривич","крижмо","крикет","крикун","крилан","кринка","кришка","крихта","крівля","кріпак","крісло","крокет","крокус","кролик","кромка","круп’є","крупка","кружка","кружок","кряква","крякіт","ксенон","ксиліт","кубізм","кубіст","кубрик","кузина","куліса","кунгфу","куплет","купина","купюра","курага","курган","курдюк","курйоз","курсив","курник","курорт","курсор","куртаж","куртка","кустар","кускус","кучері","кушнір","кшталт","лавина","лавиця","лавсан","лагман","лагуна","ладога","лайнер","лакмус","лактат","лакуна","ламела","лампас","лангет","лантан","лантух","ланцет","ланцюг","лаоска","лапище","ласощі","ластик","латекс","лацкан","лаяння","левада","лебедя","левеня","левиця","легато","легені","легеня","легіон","лізинг","ліквід","ліквор","лінощі","лінкор","ліпаза","лірник","ліризм","лірика","лісник","літера","літраж","літфак","ліфтер","ліфчик","ліхтар","ліщина","лобізм","лобіст","лобода","лобзик","ловкач","логізм","логіка","логіст","лоджія","лозунг","лозина","ледащо","лезгин","лейкоз","лекало","лектор","лекція","лелека","лелеча","лемінг","лепеха","лептон","лещата","летяга","лижник","лисеня","лисина","лисиця","листва","листик","литвин","лихвар","личина","лиштва","лібідо","ліврея","ломота","лопата","лорнет","лордоз","лосеня","лосини","лосиця","лоскіт","лохина","лощина","лоцман","лошеня","лошиця","луддит","лудизм","лускіт","лучина","лучник","люверс","людина","людоїд","люстра","люмпен","лютеїн","лютняр","ляпсус","ляскіт","магнат","магній","магніт","магура","мадера","маєток","мазило","майдан","маївка","макака","макіяж","маклер","макрос","макуха","маленя","малеча","малина","мамуля","мангри","мандат","маневр","мандри","манера","манжет","маніяк","мантія","мантра","маоїзм","маоїст","марабу","марево","маркер","маркіз","мармур","маршал","мар’яж","маскот","маслюк","мастит","мастиф","минтай","митник","мишеня","міазма","мідник","мієлін","мікроб","мікрон","міксер","мікшер","міледі","мілина","мілорд","міміка","мімоза","мінога","мінора","міопія","місиво","містер","місток","мітинг","мітчик","мішура","мічман","млинар","мовчун","могила","модник","мозоля","матрац","матрос","махина","мачуха","машина","маячня","маячок","меандр","мебляр","мегера","медіум","медуза","меланж","меліса","меніск","ментол","ментор","менует","менора","мережа","месник","метеор","метраж","мечник","мийник","милиця","молоко","монада","монарх","молюск","момент","монгол","монета","монізм","моніст","монтер","монстр","монтаж","мордва","морква","мормон","морфій","морфін","москіт","мотлох","моціон","мочало","музика","муліне","мундир","мураха","мурена","муркіт","мускат","муфлон","муфтій","мутант","мушкет","мюзикл","муштра","м’якуш","м’ясце","м’ячик","набряк","навага","навала","нагляд","нагода","нагота","нагрів","надкус","надлом","надпил","надпис","надруб","надрив","надріз","наждак","нажива","найдух","наймач","наймит","наклад","наклеп","неволя","невроз","негода","неділя","недоля","недруг","нейлон","нейрон","нектар","некроз","неодим","неозой","неоліт","неофіт","напалм","наплив","напрям","нарада","нарвал","нарзан","наріст","наркоз","наруга","нарцис","наскок","наспів","настил","настій","наступ","натиск","натовп","натрій","натура","нахаба","нацизм","нацист","начерк","небеса","небога","нерест","нероба","несмак","нефрит","нефроз","нехлюй","неявка","низина","ніздря","німота","нічліг","новела","новина","ножиці","нокаут","нужник","нудизм","нудист","нудота","нутрія","обабок","обапіл","оберіг","об’єкт","обжера","обідня","обійми","об’їзд","облава","облога","обмова","обнова","ободок","обойма","оборот","образа","обрида","окатиш","окисел","округа","октава","окуляр","оладка","оливка","оляпка","омметр","омонім","онучка","онучок","описка","опікун","опілля","опіоїд","опічок","оплата","оплеск","опосум","оправа","оптика","опціон","орання","оранта","оратор","оракул","оргазм","оренда","орленя","орлиця","обтиск","обхват","обшлаг","община","об’ява","овечка","овація","огарок","овчина","огірок","огниво","огнище","огород","огузок","одесит","одинак","однина","оздоба","озерце","ознака","оказія","окання","орудар","орудка","освіта","осердя","осетин","осічка","ослиця","основа","острах","острів","отаман","отрута","оферта","офіцер","офсайд","охання","оцелот","оцінка","оцупок","очерет","очіпок","очмана","очитка","ошийок","павіан","павлин","паддок","пазуха","пайщик","палата","палиця","палета","паливо","палтус","палуба","пандан","паніка","пандус","панцир","папайя","папуас","папуга","паркан","паркет","паркур","парник","парсек","парсер","партер","партія","пастка","пастор","пастух","патина","патока","патрон","паштет","паяння","педфак","пейзаж","пейзан","пелена","пенсія","пенсне","пентод","перила","перина","період","персик","перука","перчик","пестун","петинг","пилюка","писака","пиячка","піастр","півник","північ","пігмей","підбір","підбор","підвал","підвіс","підвид","підгин","підгін","полива","полиця","поліно","полова","пологи","помада","помело","поміха","поміст","помпаж","помпон","помреж","помста","поножі","понтон","понука","попадя","попона","попурі","попуск","порада","пороги","порода","порося","пороша","портал","портик","порука","порція","посада","послід","послух","посміх","поспів","поспіх","постав","постер","поступ","посуха","потіха","потиск","потрох","потуга","почерк","пошана","пошляк","пощада","поштар","прабог","правда","праліс","прання","прадід","прачка","пращур","предок","премія","прерія","прибой","прибор","прибій","привал","привіз","привіт","привид","привід","привод","піддон","піджак","підйом","підкат","підкіп","підкоп","підкуп","підліт","підмет","підмив","піднос","підпал","підпис","підпір","підрив","підріз","підруб","підсів","підсос","підтип","підхід","пієтет","піжама","пінцет","пінчер","піонер","пірнач","пірога","пірует","пістон","пісуар","пічник","плакса","планер","планка","платіж","платня","плаття","плафон","платан","плебей","плевра","плем’я","пленер","пленум","плеяда","плойка","пломба","плошка","плотва","пляшка","повага","поверх","повтор","погляд","погода","погоня","погріб","погром","подача","подвиг","подіум","подоба","подяка","поезія","пожежа","пожива","позика","поїлка","поїння","поквап","покіст","поклад","поклеп","поклик","поклін","покора","покрив","покрій","призер","призма","призов","прийом","приїзд","прикол","прикуп","прикус","прилад","приліт","прилив","примат","примус","примха","припис","припій","присід","притон","притча","прихід","приціл","причіп","прищик","прірва","пробіг","провал","провис","провід","прогин","прогін","прогон","прогул","продаж","продих","проект","проєкт","продув","проїзд","пройда","прокат","проліт","пролог","пролом","промах","пропан","пропил","прорив","проруб","проріз","пророк","просів","протей","протез","протік","протон","протяг","профан","прохід","процес","прочіс","пруток","психоз","пструг","пташка","пугало","пупсик","пурпур","п’ятак","п’ятка","равлик","рабиня","радіан","радист","радіус","радник","радощі","ракета","ракорд","ракурс","раліст","ранжир","рапорт","рапіра","расизм","ратник","ратуша","рашизм","раціон","реверс","реванш","регата","регент","регіон","реглан","регрес","реєстр","резерв","резюме","рекорд","рекрут","ректор","релікт","релінг","ремікс","ремонт","реноме","репиця","розгул","розділ","роздум","розета","роз’єм","розкіш","розлад","розлив","розліт","розлом","розмах","розмив","розмін","розмір","розпад","розпал","розпач","розпис","розпил","розрив","ресора","реп’ях","ретина","ресурс","рефері","рефрен","рецепт","речник","решето","рештка","рештки","рибник","рибина","ридван","ризото","римейк","ритуал","рідина","різдво","різник","робота","родина","розбіг","розбій","розбір","розвал","розгін","розріз","розряд","розсіл","розсип","розсуд","розтин","розчин","розшук","рокита","ролета","романс","ропуха","росток","ротанг","роутер","рохкіт","рудник","рукола","рундук","русизм","рутина","рюкзак","рушник","рябина","рябчик","садист","сайгак","салган","сакура","салака","салямі","самоїд","самота","самоук","сандал","сапсан","сармат","сатана","сварка","свинка","свідок","свіжак","світло","свічка","світоч","святки","секвоя","секрет","сектор","секція","селера","селище","сенсор","сепсис","септик","сервер","сервіз","серіал","сестра","сивуха","сигара","сивина","сигнал","сиквел","сморід","смуток","смужка","сніжок","собака","сокира","солдат","соліст","солома","соната","сонник","сорока","состав","сотник","софізм","сошник","соціум","спадок","спайка","спалах","спамер","спектр","сперма","спеція","спинка","список","співак","спілка","спікер","сплайн","сплата","сплеск","спогад","спокій","сполох","спомин","спосіб","спрага","справа","спринт","спроба","срібло","ставня","ставок","ставка","стайєр","стайня","стакан","станок","станум","статки","статок","статор","стаття","статус","статут","статуя","стебло","стежка","стелаж","стегно","стеноз","силует","символ","синапс","синиця","синтол","синтез","сирена","сирота","сирник","сироїд","ситник","сієста","сірник","сіялка","сіяння","скабка","скакун","скалка","скаляр","сканер","скарга","сквайр","скелет","скибка","скіпка","склера","склока","скотар","скрипт","скриня","скроня","скрута","слабак","скутер","слалом","слівце","сліпак","слоган","слойка","слоник","служба","слюсар","слухач","смегма","смирна","смичок","смішок","стимул","стійка","стогін","столик","столяр","стойка","стопка","стопор","сторож","страва","страйк","страта","страус","стріла","стріха","стропа","строфа","струна","стукач","стукіт","студія","ступня","ступор","стюард","субота","суглоб","судина","судома","суїцид","сумнів","сумбур","суниця","сунізм","супорт","суржик","сургуч","суслик","сутана","суфлер","сфінкс","схизма","східці","сходка","сценка","сюртук","таджик","таймер","таїння","тайник","тайфун","таксон","тактик","талант","талмуд","тамада","тамбур","тампон","тамтам","тангаж","тандем","тандир","танкер","тантал","тапчан","тарган","тарпан","тартак","тартар","тархун","татамі","татуаж","тахіон","тахмис","тачпад","тевтон","текіла","телиця","темник","тендер","тензор","теолог","теорія","теософ","токсин","толока","толуол","тонарм","тоннаж","тополя","торакс","тореро","тороїд","тортик","тостер","торшер","точило","травма","трагік","тралер","трасер","трафік","трахея","трекер","тремор","тренер","тригер","тризна","тризуб","теракт","тераса","тер’єр","термін","терміт","термос","терція","тесляр","тестер","тетрод","тетроз","тефлон","технар","технік","тим’ян","тирада","тіамін","ткання","ткачка","трилер","тримач","тример","трипер","тритій","тритон","тріада","трійня","трійця","тріска","тріумф","тролей","тропік","тросик","тротил","трофей","трубач","трубка","трюїзм","трюкач","туалет","туарег","тугрик","тупиця","тунгус","тундра","туніка","туризм","турист","туркіт","турнік","турнір","тюбінг","тюнінг","тюрбан","тятива","убивця","угіддя","удмурт","унціал","ураган","уремія","уретан","уретра","уривок","уролог","усадка","уламок","умисел","умляут","унікум","унісон","унітаз","устрій","усушка","утопія","утроба","ухвала","уфолог","уцінка","ушуїст","фабула","фавела","фаетон","фактор","фактаж","фанера","фантик","фантом","фараон","фартух","фасоля","фасція","фашизм","фашист","феєрія","фектор","фейхоа","флейта","флюгер","фовізм","фонема","фондан","фонтан","форзац","форинт","формат","форсаж","фосфат","фосфор","феодал","фермер","фіалка","фіаско","фіброз","фібула","фігляр","фігура","фієста","фізика","фізфак","фіксаж","фікція","філіал","філфак","фінвал","фінгал","фітинг","фітнес","флакон","флебіт","фрегат","фреска","фритюр","фторид","фуксія","фундук","фургон","футбол","фуршет","футзал","хазяїн","халепа","халупа","халява","хандра","хапуга","харіус","хартія","хвойда","хлюпіт","ходики","холера","хом’як","хорват","хорист","хороми","хоспіс","хостес","химера","хитрун","хіджаб","хірург","хлопак","хлорид","хлорка","хребет","хробак","хронік","хрящик","худоба","хустка","цариця","царизм","царина","цемент","цензор","циркач","циркон","цистит","цитата","цитрус","цілина","цінник","церква","цибуля","цикада","циклоп","циклон","цимбал","цинізм","цунамі","цуценя","чагарі","чайові","чайник","чаклун","чартер","часник","частка","чахлик","чеддер","чекіст","чинуша","чинник","чипсет","човник","човняр","черево","черкес","четвер","чужина","чучело","шаблон","шампур","шантаж","шапіто","шарада","шаріат","шарнір","шаурма","шафран","шахиня","шахіст","шахтар","шахрай","швабра","шашлик","швачка","шведка","швелер","швидка","шеврон","шедевр","шкіпер","шкірка","школяр","шлейка","шлунок","шлюпка","шлягер","шляхта","шматок","шмаття","шнурок","шомпол","шопінг","шоумен","шпагат","шпажка","шпація","шпигун","шпинат","шплінт","шпонка","шелест","шерхіт","шиїтка","шизоїд","шикана","шилінг","шинкар","ширина","широта","шістка","шредер","штанга","штатив","штанці","штекер","шторка","штопор","штуцер","шумиха","шурхіт","щедрик","щелепа","щетина","щілина","ювелір","ювілей","ювіляр","юдаїзм","юдаїка","юдейка","юдофоб","яблуня","яблуко","яванка","ягдташ","ягідка","яглиця","ягниця","ядриця","яєчник","язичок","ямочка","янголя","яничар","японка","ярунок","якудза","якутка","ялинка","яструб","ятаган","яхтинг","ящірка","абетка","аномал","апатит","апарат","апатія","арабка","арбітр","арф'яр","бабуїн","бабуля","бабуся","банщик","бар'єр","бардак","бардаш","барига","батрак","бджола","біогаз","біоген","біплан","блузка","блюдце","бляшка","бобрик","богема","бойчук","болещі","боржок","бестія","биндюг","бренді","брехун","бриджі","бринза","буєрак","буквар","бурдюк","бурмак","бур'ян","вантаж","вапняр","вариво","вар'ят","верб'я","веризм","верист","вертій","водник","вузлик","в'язка","в'юнок","в'юрок","в'язок","в'ятич","гаврик","гагара","гадюка","газета","галета","галіфе","гламур","гланда","гланди","гоблін","говбур","горбач","горбик","грибок","гризлі","гробар","гробик","гробки","гробок","гровер","гурток","движок","двобій","діджей","джинси","джихад","друкар","дубняк","дурник","дурощі","екання","звір'я","згір'я","кав'яр","кайзен","кайзер","кайман","калмик","капрон","кар'єр","каучук","каяття","кашлюк","кашмір","коп'як","кофеїн","кендюх","кіборг","кілоом","кістка","класик","клозет","клітка","клітор","клішня","клопіт","клубок","ключик","кляуза","ковбир","ковбой","ковпак","кривда","круп'є","крутон","крючок","крюшон","кугуар","кунжут","кумлик","кумпан","куниця","купрум","кур'єр","курант","кураре","куриво","кутник","мамлюк","мамонт","мангал","маразм","мар'яж","миш'як","мірило","мірина","матуся","махаон","мачете","мачизм","мускус","м'язик","м'якуш","м'ясце","м'ятка","м'ячик","нігтик","ніндзя","ніобій","нітрат","нітрид","нітрил","нітрит","об'єкт","об'їзд","олів'є","орбіта","об'ява","осавул","осадка","пагода","пагорб","панама","папаха","пасіка","паства","пастир","патент","патика","педант","педвуз","пеленг","пектин","пеплум","пептид","пептон","первак","печеня","печера","печиво","п'єска","пискіт","пискля","пискун","півбог","пончик","прапор","прарід","праска","пікнік","пілюля","пілінг","пітчер","піхота","плавун","плагін","плазма","піщина","плавки","плавні","плазун","плакат","плашка","плем'я","плетка","плітка","плитка","плівка","плотер","плотик","плужок","прикіл","пробій","пробіл","пряник","прядло","пряжка","прясло","псалом","псарня","пудинг","пурген","пуризм","пурист","пустир","пустка","пуштун","пфеніг","пшонка","пюпітр","п'янка","п'ятак","п'ятка","райком","расист","рвання","роз'єм","реп'ях","роялті","ротяка","савана","садиба","садизм","сапфір","сарана","сатира","сафарі","свайка","свекор","сервіс","середа","сефард","снаряд","снігир","снігур","совеня","соколя","стадія","стажер","сідуха","слимак","словак","сміття","стигма","стирол","стійло","стихія","стінка","стяжка","султан","суфізм","суфікс","суфіст","сходня","тондир","торгаш","тер'єр","тим'ян","тління","тлумач","футляр","хом'як","шансон","агнець","альбом","альков","альянс","арієць","ательє","бадьян","баньян","барель","батько","більмо","біполь","бобиль","борець","бивень","ботель","боязнь","бугель","будень","бульба","булька","важіль","ваніль","відьма","вільха","вінець","витязь","вогонь","водень","вольєр","вульва","гавань","газель","галузь","галька","гальмо","гальюн","ганьба","гольфи","гонець","герань","гибель","гільза","горець","готель","грааль","груздь","гусінь","дельта","дідусь","дідько","донька","деталь","джміль","джоуль","дивень","дизель","диполь","дурень","дюбель","дягель","дядько","дюраль","жальце","жилець","житець","живець","жолудь","жульєн","заводь","зелень","злість","кабель","калька","кальян","камедь","камінь","капель","карась","касаль","кахель","кашель","коньяк","корінь","король","кегель","кефаль","кисень","кисіль","кицька","кіготь","кілька","кільце","кінець","кітель","коваль","кокіль","кулька","кульок","купець","курець","кухоль","ламель","ларець","лапоть","ларьок","латинь","латунь","лебідь","лікоть","ловець","линька","липень","лосось","люлька","лютень","лялька","мальва","мальок","митець","місяць","мішень","модель","модуль","мозоль","медаль","метіль","мечеть","молодь","мольба","мораль","мотель","мотиль","мулька","нежить","ненька","ніготь","нікель","німець","ніпель","нудьга","нянька","обміль","падаль","паелья","палець","пальба","пальма","пальне","пальто","панель","пароль","педаль","пеньок","перець","песець","печаль","печать","писець","письмо","півень","помісь","портьє","похіть","пільга","пітьма","повідь","повінь","пудель","пульпа","рагуль","ранець","рантьє","ревінь","редька","рельєф","ремінь","ригель","рильце","рівень","різець","різьба","рубець","рулька","сажень","сальдо","сальса","сальто","самець","сельва","сидень","снасть","соболь","сопіль","синець","синька","сирець","ситець","сільпо","січень","скальп","сльоза","смерть","сутінь","сьогун","сьомга","табель","танець","татусь","твердь","телець","темінь","торець","тигель","тильда","тільце","трость","тунель","тунець","тюлень","тюлька","участь","фольга","форель","фільтр","ходьба","цицька","цоколь","чверть","челядь","ченець","шашіль","шекель","шельма","шерсть","шинель","шульга","щабель","щавель","щебінь","щиголь","щитень","юність","якість","ямаєць","ячмінь"].includes(w),
      answer: () => {const a=['\u0430\u043f\u043e\u0433\u0435\u0439','\u0437\u0456\u043d\u0438\u0446\u044f','\u043f\u0440\u0438\u0437\u043e\u0432','\u043a\u0438\u0441\u0435\u043d\u044c','\u0440\u0438\u0442\u0443\u0430\u043b','\u0441\u043f\u0456\u043b\u043a\u0430','\u043c\u0430\u043d\u0442\u0456\u044f','\u0434\u0438\u043a\u0442\u043e\u0440','\u0441\u0435\u0440\u0432\u0456\u0437','\u0443\u0440\u043e\u043b\u043e\u0433','\u0434\u0438\u044f\u0432\u043e\u043b','\u043a\u043d\u043e\u043f\u043a\u0430','\u043a\u043e\u043c\u043f\u0430\u0441','\u0431\u043e\u043a\u0441\u0435\u0440','\u0437\u0430\u0442\u0432\u043e\u0440','\u0456\u043d\u0434\u0435\u043a\u0441','\u0434\u0456\u0430\u0440\u0435\u044f','\u0440\u0430\u0434\u043d\u0438\u043a','\u043b\u044e\u043b\u044c\u043a\u0430','\u043f\u0440\u043e\u0442\u044f\u0433','\u043a\u0440\u0438\u0445\u0442\u0430','\u0432\u0431\u0438\u0432\u0446\u044f','\u043b\u0435\u0431\u0456\u0434\u044c','\u0437\u043b\u0456\u0441\u0442\u044c','\u043f\u043e\u043c\u0435\u043b\u043e','\u043a\u043b\u0443\u043c\u0431\u0430','\u0445\u043e\u043c\x27\u044f\u043a','\u0442\u0430\u0440\u0433\u0430\u043d','\u0440\u0435\u0441\u0443\u0440\u0441','\u0434\u0456\u0430\u043b\u043e\u0433','\u0441\u0442\u0430\u0442\u0443\u0441','\u0432\u0430\u0436\u0456\u043b\u044c','\u0431\u0456\u0434\u043d\u044f\u043a','\u043d\u0430\u043a\u043b\u0435\u043f','\u0456\u0441\u0442\u043e\u0442\u0430','\u0444\u0456\u0437\u0438\u043a\u0430','\u0441\u043b\u044c\u043e\u0437\u0430','\u043f\u0456\u0434\u043a\u043e\u043f','\u0441\u0442\u043e\u043f\u043a\u0430','\u0432\u0430\u0433\u0456\u043d\u0430','\u043d\u0435\u0440\u0435\u0441\u0442','\u043c\u043e\u043d\u0441\u0442\u0440','\u0430\u0441\u043f\u0435\u043a\u0442','\u0430\u043a\u0430\u0446\u0456\u044f','\u0431\u0443\u0440\x27\u044f\u043d','\u043a\u0430\u043b\u044c\u043a\u0430','\u0440\u043e\u0437\u043f\u0430\u0434','\u0434\u044e\u0431\u0435\u043b\u044c','\u043f\u043e\u0436\u0435\u0436\u0430','\u043d\u0435\u0436\u0438\u0442\u044c','\u043a\u0430\u0440\u0430\u0443\u043b','\u0447\u0435\u0442\u0432\u0435\u0440','\u043f\u0430\u0448\u0442\u0435\u0442','\u043f\u0430\u0442\u0435\u043d\u0442','\u043b\u0430\u043d\u0446\u044e\u0433','\u0441\u043f\u0438\u0441\u043e\u043a','\u0433\u0435\u0440\u0430\u043d\u044c','\u0431\u0443\u0439\u0432\u0456\u043b','\u043b\u0456\u0449\u0438\u043d\u0430','\u0431\u0430\u0439\u043a\u0435\u0440','\u0434\u0432\u0456\u0439\u043d\u044f','\u0431\u043e\u0433\u0435\u043c\u0430','\u043a\u043e\u0440\u0438\u0446\u044f','\u043f\u043e\u0434\u0430\u0447\u0430','\u0434\u0435\u0440\u0435\u0432\u043e','\u043c\u0456\u0441\u0438\u0432\u043e','\u043f\u043b\u0435\u043c\x27\u044f','\u0437\u0433\u0430\u0434\u043a\u0430','\u0431\u044e\u0434\u0436\u0435\u0442','\u043f\u0456\u0434\u0440\u0438\u0432','\u044f\u0431\u043b\u0443\u043d\u044f','\u0432\u0430\u043b\u0456\u0437\u0430','\u0442\u0443\u0440\u0438\u0441\u0442','\u043c\u0435\u0434\u0443\u0437\u0430','\u0432\u0438\u0431\u043e\u0440\u0438','\u043a\u043e\u0440\u0441\u0435\u0442','\u043f\u0440\u0430\u0434\u0456\u0434','\u0441\u043a\u0430\u043b\u044f\u0440','\u0437\u043b\u043e\u0434\u0456\u0439','\u043f\u0440\u0430\u0432\u0434\u0430','\u0431\u0440\u043e\u043a\u0435\u0440','\u0434\u043e\u0440\u043e\u0433\u0430','\u043b\u0456\u043a\u043e\u0442\u044c','\u0449\u0456\u043b\u0438\u043d\u0430','\u0434\u043e\u0441\u043b\u0456\u0434','\u0432\u0442\u0440\u0430\u0442\u0430','\u0433\u043e\u0442\u0435\u043b\u044c','\u0441\u043a\u0430\u043d\u0435\u0440','\u043a\u0443\u0445\u043e\u043b\u044c','\u043f\x27\u044f\u0442\u0430\u043a','\u043f\u043e\u0441\u043f\u0456\u0445','\u043a\u0456\u043c\u043e\u043d\u043e','\u043d\u0435\u0441\u043c\u0430\u043a','\u043f\u043e\u0440\u043e\u0433\u0438','\u043b\u044f\u0441\u043a\u0456\u0442','\u043a\u0440\u0430\u0457\u043d\u0430','\u0437\u043e\u0437\u0443\u043b\u044f','\u0441\u043f\u0440\u0430\u0432\u0430','\u0430\u0440\u0442\u0438\u0441\u0442','\u0441\u0435\u043b\u0435\u0440\u0430','\u043f\u0435\u043d\u0441\u043d\u0435','\u0432\u0438\u0441\u0442\u0443\u043f','\u0432\u0456\u0442\u0440\u0430\u0436','\u043f\u043e\u0440\u043e\u0441\u044f','\u043c\u0430\u0442\u0440\u043e\u0441','\u043a\u0430\u0447\u0435\u043d\u044f','\u043a\u0443\u0440\x27\u0454\u0440','\u043b\u0430\u0442\u0438\u043d\u044c','\u043f\u043e\u0433\u0440\u0456\u0431','\u043f\u0456\u0432\u0435\u043d\u044c','\u043c\u0430\u0433\u043d\u0456\u0442','\u0440\u043e\u0437\u043f\u0438\u0441','\u0435\u043a\u043e\u043b\u043e\u0433','\u043a\u043e\u0440\u043e\u043b\u044c','\u0430\u043d\u0442\u0435\u043d\u0430','\u0441\u043f\u043e\u0441\u0456\u0431','\u0441\u0435\u0440\u0456\u0430\u043b','\u043a\u0443\u043f\u043b\u0435\u0442','\u0444\u043b\u0435\u0439\u0442\u0430','\u0442\u043e\u0440\u0435\u0446\u044c','\u043b\u0456\u0445\u0442\u0430\u0440','\u043a\u043e\u043c\u043f\u043e\u0442','\u043c\u0430\u043d\u0442\u0440\u0430','\u043a\u043b\u0456\u0454\u043d\u0442','\u043a\u043e\u043c\u0435\u0442\u0430','\u043a\u0430\u043c\u0435\u0440\u0430','\u043f\u043e\u043c\u0441\u0442\u0430','\u043a\u043e\u0448\u0435\u043d\u044f','\u0440\u043e\u0437\u043f\u0430\u0447','\u043f\u043e\u0433\u043e\u0434\u0430','\u043a\u0430\u0431\u0430\u0440\u0435','\u0434\u0438\u0437\u0435\u043b\u044c','\u0441\u0430\u0440\u0430\u043d\u0430','\u043c\u0443\u0440\u043a\u0456\u0442','\u043a\u043b\u043e\u043f\u0456\u0442','\u0447\u0430\u043a\u043b\u0443\u043d','\u0441\u0442\u0430\u043d\u043e\u043a','\u043d\u0443\u0434\u0438\u0441\u0442','\u0441\u0443\u0444\u0456\u043a\u0441','\u0443\u0433\u0456\u0434\u0434\u044f','\u0440\u0430\u0434\u0456\u0443\u0441','\u0444\u0443\u0440\u0448\u0435\u0442','\u043c\u0443\u0440\u0430\u0445\u0430','\u043c\u0430\u0447\u0443\u0445\u0430','\u0448\u043b\u044f\u0433\u0435\u0440','\u043f\u0440\u043e\u043c\u0430\u0445','\u0441\u043e\u0440\u043e\u043a\u0430','\u0434\u0443\u0440\u043e\u0449\u0456','\u043a\u043e\u0432\u0431\u043e\u0439','\u0433\u0435\u043d\u0434\u0435\u0440','\u0441\u0430\u043b\u044f\u043c\u0456','\u0434\u0440\u043e\u0442\u0438\u043a','\u043f\u0430\u0440\u0442\u0435\u0440','\u0445\u0430\u043b\u0443\u043f\u0430','\u043f\u0435\u0434\u0430\u043d\u0442','\u0440\u0435\u043c\u043e\u043d\u0442','\u043a\u0430\u0441\u043a\u0430\u0434','\u0441\u0430\u043c\u0435\u0446\u044c','\u0456\u043c\u043f\u043e\u0440\u0442','\u0440\u044f\u0431\u0438\u043d\u0430','\u0440\u043e\u043c\u0430\u043d\u0441','\u0433\u043e\u0440\u0438\u043b\u0430','\u043a\u0432\u0438\u0442\u043e\u043a','\u0441\u043e\u043b\u0434\u0430\u0442','\u043c\u043e\u0441\u043a\u0456\u0442','\u043d\u0435\u0433\u043e\u0434\u0430','\u043a\u043e\u043d\u0432\u043e\u0439','\u043b\u044f\u043b\u044c\u043a\u0430','\u0431\u0443\u043a\u0432\u0430\u0440','\u043f\u0456\u0434\u043d\u043e\u0441','\u0440\u0430\u0434\u0456\u0430\u043d','\u043f\u043e\u0440\u043e\u0434\u0430','\u0433\u0440\u044f\u0434\u043a\u0430','\u0444\u0456\u0430\u0441\u043a\u043e','\u0440\u0435\u043a\u0440\u0443\u0442','\u0441\u043f\u0430\u0434\u043e\u043a','\u0437\u043e\u043d\u0442\u0438\u043a','\u0448\u043d\u0443\u0440\u043e\u043a','\u0433\u043e\u043b\u043e\u0432\u0430','\u043f\u0440\u0438\u0439\u043e\u043c','\u0431\u0435\u0440\u0435\u0437\u0430','\u043f\u0440\u043e\u0440\u043e\u043a','\u043d\u043e\u0436\u0438\u0446\u0456','\u0431\u0430\u043c\u043f\u0435\u0440','\u0434\u0443\u0440\u0435\u043d\u044c','\u043c\u0456\u0448\u0435\u043d\u044c','\u043f\u0435\u0440\u0441\u0438\u043a','\u0434\u0440\u0443\u0436\u0431\u0430','\u043e\u0447\u0435\u0440\u0435\u0442','\u043f\u0435\u0440\u0438\u043b\u0430','\u0441\u0438\u043d\u0438\u0446\u044f','\u043a\u0456\u0431\u043e\u0440\u0433','\u043e\u043f\u043b\u0435\u0441\u043a','\u043c\u043e\u0440\u043a\u0432\u0430','\u044f\u0449\u0456\u0440\u043a\u0430','\u043a\u043e\u0442\u0435\u0434\u0436','\u0442\u0443\u0440\u043d\u0456\u043a','\u043e\u043c\u043e\u043d\u0456\u043c','\u043a\u043e\u043b\u0435\u0441\u043e','\u0441\u0443\u0457\u0446\u0438\u0434','\u0430\u043d\u0433\u0456\u043d\u0430','\u043c\u043e\u043d\u0430\u0440\u0445','\u0431\u0443\u043d\u0442\u0430\u0440','\u043c\u0443\u0442\u0430\u043d\u0442','\u0431\u0443\u043b\u0430\u0432\u0430','\u0430\u043c\u043f\u0443\u043b\u0430','\u043f\u043e\u0434\u0456\u0443\u043c','\u0433\u043e\u0440\u0431\u0443\u043d','\u0432\u0438\u043a\u043b\u0438\u043a','\u0435\u0448\u0435\u043b\u043e\u043d','\u043a\u0440\u0456\u0441\u043b\u043e','\u0441\u0430\u0442\u0438\u0440\u0430','\u0432\u0456\u043d\u0442\u0430\u0436','\u0432\u0435\u0447\u0435\u0440\u044f','\u043f\u0440\u043e\u0433\u0438\u043d','\u0441\u043f\u0440\u0430\u0433\u0430','\u0448\u0430\u0440\u043d\u0456\u0440','\u0433\u0435\u0440\u043f\u0435\u0441','\u043f\u0456\u0434\u0432\u0430\u043b','\u0431\u0430\u0440\x27\u0454\u0440','\u0430\u043f\u0430\u0442\u0456\u044f','\u0444\u043e\u0440\u043c\u0430\u0442','\u0433\u0456\u043b\u044c\u0437\u0430','\u043b\u0435\u043a\u0430\u043b\u043e','\u043f\u0430\u0437\u0443\u0445\u0430','\u0431\u0430\u043d\u0434\u0430\u0436','\u0431\u043e\u0440\u0441\u0443\u043a','\u0442\u0440\u043e\u0442\u0438\u043b','\u043f\u0440\u043e\u0432\u0456\u0434','\u0444\u0456\u0442\u043d\u0435\u0441','\u043a\u0443\u0440\u043e\u0440\u0442','\u0441\u043d\u0430\u0440\u044f\u0434','\u043d\u0430\u0434\u0440\u0456\u0437','\u043a\u0435\u0432\u043b\u0430\u0440','\u043a\u0430\u043b\u043e\u0448\u0430','\u043f\u0440\u0438\u0432\u0456\u0442','\u0431\u0435\u0437\u043b\u0456\u0447','\u0431\u0440\u0435\u0445\u043d\u044f','\u0444\u0440\u0435\u0441\u043a\u0430','\u0433\u0430\u0440\u043d\u0456\u0440','\u0441\u0443\u043c\u043d\u0456\u0432','\u043a\u0440\u0443\u043f\x27\u0454','\u043c\u0443\u0448\u043a\u0435\u0442','\u0442\u0440\u0435\u043d\u0435\u0440','\u0440\u043e\u0437\u0431\u0456\u0433','\u043c\u043e\u043b\u044e\u0441\u043a','\u0449\u0430\u0432\u0435\u043b\u044c','\u0431\u0430\u043d\u0434\u0438\u0442','\u043a\u0430\u0439\u0434\u0430\u043d','\u0440\u043e\u0431\u043e\u0442\u0430','\u0442\u0440\u043e\u0444\u0435\u0439','\u0441\u043f\u0435\u043a\u0442\u0440','\u043f\u0440\u0438\u043b\u0456\u0442','\u043f\u043b\u0430\u043a\u0430\u0442','\u043e\u0440\u0430\u043a\u0443\u043b','\u0448\u0430\u0431\u043b\u043e\u043d','\u043d\u0435\u0432\u0440\u043e\u0437','\u0433\u0440\u0456\u043b\u043a\u0430','\u0441\u0438\u043b\u0443\u0435\u0442','\u0446\u0438\u0442\u0430\u0442\u0430','\u043b\u043e\u043c\u043e\u0442\u0430','\u0433\u0440\u0430\u0444\u0456\u0442','\u0437\u0432\u0430\u043d\u043d\u044f','\u043f\u0440\u043e\u0434\u0430\u0436','\u0444\u0443\u0442\u0431\u043e\u043b','\u0441\u0442\u0440\u0443\u043d\u0430','\u0441\u0443\u0444\u043b\u0435\u0440','\u0432\u0456\u0434\u0431\u0456\u0439','\u0430\u0442\u043b\u0430\u043d\u0442','\u0442\u0430\u0440\u0445\u0443\u043d','\u0440\u043e\u0437\u0440\u044f\u0434','\u043f\u0430\u043d\u0430\u043c\u0430','\u043f\u043e\u043a\u0440\u0438\u0432','\u0440\u0435\u0432\u0430\u043d\u0448','\u0437\u0432\u0438\u0447\u043a\u0430','\u0437\u0431\u0456\u0440\u043a\u0430','\u0431\u043b\u0435\u0441\u043d\u0430','\u0442\u0435\u0440\x27\u0454\u0440','\u0430\u043d\u0430\u043b\u043e\u0433','\u0441\u0442\u0435\u0436\u043a\u0430','\u0448\u043b\u044e\u043f\u043a\u0430','\u0432\u0438\u0457\u043c\u043a\u0430','\u0440\u043e\u0437\u043c\u0430\u0445','\u0448\u0430\u0443\u0440\u043c\u0430','\u0441\u0435\u043b\u0438\u0449\u0435','\u043f\u0430\u0442\u043e\u043a\u0430','\u0435\u0433\u043e\u0457\u0441\u0442','\u043c\u0435\u043d\u0456\u0441\u043a','\u0436\u0435\u0431\u0440\u0430\u043a','\u0432\u0430\u0440\u0432\u0430\u0440','\u0445\u0456\u0440\u0443\u0440\u0433','\u0434\u0443\u0440\u0435\u043f\u0430','\u043f\u043e\u0447\u0435\u0440\u043a','\u043c\u0430\u0448\u0438\u043d\u0430','\u043a\u043b\u0456\u0437\u043c\u0430','\u043c\u0456\u043a\u0441\u0435\u0440','\u0432\u0456\u0434\u0442\u0438\u043d','\u043f\u0456\u0445\u043e\u0442\u0430','\u0431\u043e\u0440\u0434\u044e\u0440','\u043f\u0430\u043d\u0435\u043b\u044c','\u043a\u0430\u0443\u0447\u0443\u043a','\u043f\u0440\u044f\u043d\u0438\u043a','\u043f\u0440\u0435\u043c\u0456\u044f','\u043a\u0430\u0440\u0442\u043e\u043d','\u0434\u0440\u0430\u043a\u043e\u043d','\u0434\u0430\u0447\u043d\u0438\u043a','\u043e\u0431\u043e\u0440\u043e\u0442','\u043a\u0432\u043e\u0440\u0443\u043c','\u0442\u0430\u043c\u043f\u043e\u043d','\u0441\u043e\u0431\u0430\u043a\u0430','\u0433\u0440\u0438\u0437\u043d\u044f','\u043f\u0443\u0434\u0435\u043b\u044c','\u0430\u0442\u0435\u0457\u0441\u0442','\u0432\u0435\u043a\u0442\u043e\u0440','\u0433\u0456\u043f\u043d\u043e\u0437','\u0432\u0430\u0445\u0442\u0435\u0440','\u0431\u0456\u0440\u044e\u0437\u0430','\u043f\u0440\u0438\u0437\u043c\u0430','\u043c\x27\u044f\u043a\u0443\u0448','\u0448\u0430\u0445\u0442\u0430\u0440','\u043e\u0440\u0433\u0430\u0437\u043c','\u043d\u0430\u0439\u043c\u0438\u0442','\u0441\u0442\u0440\u0456\u043b\u0430','\u0431\u0430\u043d\u043a\u0456\u0440','\u0443\u0447\u0430\u0441\u0442\u044c','\u043a\u0435\u0442\u0447\u0443\u043f','\u043e\u0431\u0435\u0440\u0456\u0433','\u0437\u043c\u0456\u043d\u043d\u0430','\u043a\u043b\u0430\u0441\u0438\u043a','\u0433\u0443\u0440\u043c\u0430\u043d','\u043a\u043e\u043d\u0438\u043d\u0430','\u0431\u043e\u0439\u043b\u0435\u0440','\u0437\u0430\u043b\u0456\u0437\u043e','\u0432\u0456\u0434\u0432\u0430\u0440','\u0447\u0438\u043d\u043d\u0438\u043a','\u0434\u0438\u043f\u0442\u0438\u0445','\u043f\u0430\u043b\u0435\u0442\u0430','\u0431\u0435\u0441\u0442\u0456\u044f','\u0444\u043e\u043d\u0442\u0430\u043d','\u0443\u0431\u0438\u0432\u0446\u044f','\u043a\u0440\u0435\u043a\u0435\u0440','\u043f\u0443\u0434\u0438\u043d\u0433','\u044f\u0431\u043b\u0443\u043a\u043e','\u043f\u0456\u0434\u043c\u0435\u0442','\u044f\u0447\u043c\u0456\u043d\u044c','\u0434\u043e\u0434\u0430\u0447\u0430','\u043e\u0446\u0456\u043d\u043a\u0430','\u0441\u043b\u044e\u0441\u0430\u0440','\u043e\u0440\u0435\u043d\u0434\u0430','\u043b\u043e\u0433\u0456\u043a\u0430','\u0441\u043b\u043e\u0433\u0430\u043d','\u0431\u0456\u0446\u0435\u043f\u0441','\u043f\u043e\u0433\u043e\u043d\u044f','\u043a\u043b\u0435\u0439\u043c\u043e','\u0432\u0435\u0440\u0441\u0456\u044f','\u043a\u0430\u043d\u0430\u0432\u0430','\u0437\u0431\u0438\u0440\u0430\u0447','\u043a\u043e\u0440\u0456\u043d\u044c','\u0433\u0438\u0434\u043e\u0442\u0430','\u0430\u043f\u0435\u0442\u0438\u0442','\u043f\u043e\u0432\u0442\u043e\u0440','\u0440\u0435\u043c\u0456\u043a\u0441','\u0432\u0456\u0434\u044c\u043c\u0430','\u0433\u0430\u043c\u0431\u0456\u0442','\u043a\u0456\u043d\u0434\u0437\u0430','\u0435\u043f\u043e\u043f\u0435\u044f','\u0445\u0443\u0441\u0442\u043a\u0430','\u0432\u0456\u0434\u0440\u0438\u0432','\u0432\u0443\u043b\u043a\u0430\u043d','\u0444\u0456\u043b\u044c\u0442\u0440','\u0431\u0435\u0434\u0443\u0457\u043d','\u043b\u0438\u0441\u0438\u0446\u044f','\u043f\u043e\u043d\u0447\u0438\u043a','\u0434\u0456\u0434\u0443\u0441\u044c','\u0449\u0435\u0434\u0440\u0438\u043a','\u0437\u0430\u0441\u0443\u0445\u0430','\u043a\u043e\u0432\u0434\u0440\u0430','\u043e\u043f\u0456\u043a\u0443\u043d','\u043e\u0442\u0440\u0443\u0442\u0430','\u043f\u0440\u043e\u0431\u0456\u043b','\u0448\u0430\u043d\u0442\u0430\u0436','\u043c\u0430\u0440\u043c\u0443\u0440','\u0456\u0437\u043e\u0442\u043e\u043f','\u0441\u043f\u0440\u0438\u043d\u0442','\u0442\u0435\u0445\u043d\u0456\u043a','\u0432\u0435\u0440\u043c\u0443\u0442','\u043a\u043e\u043c\u0456\u043a\u0441','\u0433\u043b\u0435\u0447\u0438\u043a','\u0431\u0440\u0443\u0441\u043e\u043a','\u043f\u0430\u043b\u0435\u0446\u044c','\u0440\u0430\u043f\u043e\u0440\u0442','\u043f\u043e\u043a\u043b\u0438\u043a','\u0434\u0436\u0438\u043d\u0441\u0438','\u043f\u0456\u0434\u0439\u043e\u043c','\u043f\u0456\u0432\u043d\u0456\u0447','\u043c\u0430\u043d\u0435\u0432\u0440','\u044e\u0432\u0456\u043b\u044f\u0440','\u043f\u0443\u0433\u0430\u043b\u043e','\u0433\u0430\u0437\u0435\u043b\u044c','\u0437\u0434\u043e\u0431\u0438\u0447','\u0433\u0435\u0440\u0446\u043e\u0433','\u043f\u043e\u0441\u0442\u0435\u0440','\u043a\u0432\u0456\u0442\u043a\u0430','\u0432\u0435\u0440\u0442\u0435\u043f','\u043d\u0430\u0440\u0430\u0434\u0430','\u0440\u043e\u0437\u0434\u0456\u043b','\u0441\u0430\u043b\u044c\u0442\u043e','\u043c\u0443\u0441\u043a\u0430\u0442','\u043f\u0440\u0430\u043d\u043d\u044f','\u043a\u0430\u0440\u043a\u0430\u0441','\u0431\u0435\u0437\u0446\u0456\u043d','\u0440\u043e\u0437\u043b\u0438\u0432','\u0434\u043e\u043c\u0456\u043d\u043e','\u043c\u0456\u043c\u0456\u043a\u0430','\u0432\u0456\u0442\u0440\u044f\u043a','\u043e\u0432\u0430\u0446\u0456\u044f','\u043a\u0440\u0443\u043f\x27\u0454','\u0432\u0430\u043d\u0434\u0430\u043b','\u0430\u043f\u0430\u0440\u0430\u0442','\u0440\u043e\u0437\u0441\u0443\u0434','\u043b\u0435\u043b\u0435\u043a\u0430','\u0433\u043b\u0430\u043d\u0434\u0438','\u0432\u0430\u043d\u0442\u0443\u0437','\u043f\u0440\u0438\u0442\u0447\u0430','\u043f\u043b\u0430\u0432\u043a\u0438','\u0444\u043b\u044e\u0433\u0435\u0440','\u0442\u0430\u0439\u0444\u0443\u043d','\u0434\u044e\u0436\u0438\u043d\u0430','\u043f\u043b\u044f\u0448\u043a\u0430','\u0441\u0442\u0430\u0432\u043a\u0430','\u0431\u043e\u0440\u043e\u0434\u0430','\u043a\u043e\u043d\u0434\u043e\u0440','\u043c\u0430\u043c\u043e\u043d\u0442','\u0430\u0442\u0435\u0457\u0437\u043c','\u043c\u0435\u0441\u043d\u0438\u043a','\u043f\u043b\u0430\u0442\u0456\u0436','\u0440\u0435\u043c\u0456\u043d\u044c','\u043c\u0435\u0447\u0435\u0442\u044c','\u0437\u0435\u043c\u043b\u044f\u043a','\u0437\u0430\u0434\u0430\u0447\u0430','\u043f\u0456\u0434\u0445\u0456\u0434','\u043f\u043e\u043b\u0456\u043d\u043e','\u0432\u0456\u043a\u0456\u043d\u0433','\u0432\u0437\u0443\u0442\u0442\u044f','\u0433\u043e\u043f\u043d\u0438\u043a','\u043f\u0430\u043d\u0446\u0438\u0440','\u0430\u043b\u044e\u0437\u0456\u044f','\u043a\u043e\u043d\u0441\u0443\u043b','\u043f\u0440\u0438\u0437\u0435\u0440','\u0430\u043c\u0444\u043e\u0440\u0430','\u0432\u0430\u0442\u043c\u0430\u043d','\u043a\u0430\u043f\u043a\u0430\u043d','\u0442\u0435\u043e\u0440\u0456\u044f','\u0440\u0435\u0448\u0442\u043a\u0438','\u043f\u0430\u0432\u043b\u0438\u043d','\u0433\u043b\u043e\u0431\u0443\u0441','\u0446\u0435\u043c\u0435\u043d\u0442','\u0434\u043e\u043b\u0438\u043d\u0430','\u0430\u043f\u043b\u043e\u043c\u0431','\u0430\u0437\u0438\u043c\u0443\u0442','\u0442\u0430\u043d\u043a\u0435\u0440','\u0433\u0435\u043e\u043b\u043e\u0433','\u0440\u043e\u0434\u0438\u043d\u0430','\u0432\u043f\u0440\u0430\u0432\u0430','\u0442\u0435\u0440\u043c\u0456\u0442','\u043f\u0435\u0447\u0438\u0432\u043e','\u0430\u0440\u043e\u043d\u0456\u044f','\u0437\u0430\u043f\u0443\u0441\u043a','\u0448\u0443\u0440\u0445\u0456\u0442','\u0431\u0443\u0440\u043a\u0456\u0442','\u0440\u0430\u043a\u0443\u0440\u0441','\u043c\u0435\u0442\u0440\u0430\u0436','\u043f\u043b\u0435\u044f\u0434\u0430','\u0456\u0434\u0438\u043b\u0456\u044f','\u0444\u0456\u0433\u0443\u0440\u0430','\u0434\u0430\u043d\u0438\u043d\u0430','\u0437\u043d\u0456\u043c\u043e\u043a','\u0432\u0443\u043b\u0438\u0446\u044f','\u0445\u043b\u044e\u043f\u0456\u0442','\u0442\u0430\u043c\u0430\u0434\u0430','\u043f\u043e\u0432\u0435\u0440\u0445','\u0447\u0430\u0439\u043d\u0438\u043a','\u0433\u0443\u0441\u0435\u043d\u044f','\u0433\u0430\u0440\u0431\u0443\u0437','\u043d\u0430\u0436\u0434\u0430\u043a','\u043f\u0440\u043e\u043a\u0430\u0442','\u0446\u0438\u0431\u0443\u043b\u044f','\u0435\u043a\u0456\u043f\u0430\u0436','\u0441\u0435\u0440\u0432\u0456\u0441','\u0442\u043e\u043b\u043e\u043a\u0430','\u0448\u043b\u044f\u0445\u0442\u0430','\u043f\u043e\u0441\u0430\u0434\u0430','\u0432\u043e\u0440\u043e\u0442\u0430','\u0434\u0438\u043a\u0446\u0456\u044f','\u043f\u0440\u043e\u0454\u043a\u0442','\u0433\u043e\u043d\u0449\u0438\u043a','\u0444\u043e\u0440\u0435\u043b\u044c','\u0442\u043e\u0440\u0448\u0435\u0440','\u0448\u043f\u0438\u043d\u0430\u0442','\u0441\u0430\u0434\u0438\u0441\u0442','\u0433\u0430\u043b\u044c\u043c\u043e','\u0433\u0430\u0437\u0435\u0442\u0430','\u0440\u0435\u0433\u0430\u0442\u0430','\u0456\u0437\u043e\u043c\u0435\u0440','\u0433\u0430\u043b\u0443\u0437\u044c','\u0433\u0440\u0430\u043d\u0430\u0442','\u043f\u0430\u043b\u0438\u0432\u043e','\u043a\u043e\u043b\u0434\u0443\u043d','\u043c\u043e\u0442\u043b\u043e\u0445','\u0430\u043d\u043a\u043b\u0430\u0432','\u043f\u043e\u0440\u0430\u0434\u0430','\u0440\u043e\u0437\u0431\u0456\u0439','\u0441\u043b\u0443\u0445\u0430\u0447','\u0431\u0435\u043d\u0437\u0438\u043d','\u0430\u043f\u0442\u0435\u043a\u0430','\u043a\u043e\u043c\u0430\u0445\u0430','\u043a\u043e\u0441\u0443\u043b\u044f','\u043f\u043e\u043b\u0438\u0446\u044f','\u0441\u043b\u0438\u043c\u0430\u043a','\u043d\u043e\u0432\u0435\u043b\u0430','\u0442\u044e\u043b\u0435\u043d\u044c','\u0432\u0456\u0432\u0442\u0430\u0440','\u043a\u0456\u0441\u0442\u043a\u0430','\u043c\u043e\u0433\u0438\u043b\u0430','\u043a\u0438\u0448\u0435\u043d\u044f','\u0441\u0432\u0456\u0434\u043e\u043a','\u0433\u0456\u0433\u0430\u043d\u0442','\u043f\u043e\u0434\u0432\u0438\u0433','\u0442\u0440\u0456\u0430\u0434\u0430','\u043a\u0430\u0440\u0446\u0435\u0440','\u0444\u043e\u0440\u0441\u0430\u0436','\u0440\u043e\u0437\u0442\u0438\u043d','\u0445\u0440\u0435\u0431\u0435\u0442','\u0441\u043a\u0430\u0440\u0433\u0430','\u043e\u043f\u0442\u0438\u043a\u0430','\u043a\u0430\u043b\u044e\u0436\u0430','\u0440\u0443\u043b\u044c\u043a\u0430','\u0448\u0430\u043c\u043f\u0443\u0440','\u043c\u0438\u043b\u0438\u0446\u044f','\u0448\u0432\u0430\u0447\u043a\u0430','\u043d\u0430\u0440\u043a\u043e\u0437','\u043f\u0440\u0438\u0431\u043e\u0440','\u0446\u0438\u043a\u043b\u043e\u043f','\u0430\u043b\u044c\u0431\u043e\u043c','\u043f\u0430\u0440\u043a\u0430\u043d','\u043a\u043e\u043d\u0442\u0443\u0440','\u043a\u043b\u044f\u0442\u0432\u0430','\u043f\u0435\u0440\u0435\u0446\u044c','\u0441\u0438\u0433\u043d\u0430\u043b','\u043b\u043e\u0437\u0443\u043d\u0433','\u0432\u0456\u0434\u0442\u0456\u043a','\u0444\u0435\u043a\u0442\u043e\u0440','\u0440\u0435\u043f\x27\u044f\u0445','\u043f\u0430\u0442\u0438\u043d\u0430','\u0433\u0440\u0435\u0431\u043b\u044f','\u0437\u0435\u043b\u0435\u043d\u044c','\u043c\u0430\u0442\u0440\u0430\u0446','\u043b\u0438\u0441\u0438\u043d\u0430','\u043b\u0456\u0440\u0438\u043a\u0430','\u043f\u0435\u043d\u0441\u0456\u044f','\u043a\u0430\u043b\u044c\u044f\u043d','\u043a\u0438\u0441\u0456\u043b\u044c','\u0434\u0440\u0430\u043d\u043a\u0430','\u0443\u0442\u043e\u043f\u0456\u044f','\u0448\u0442\u0430\u043d\u0433\u0430','\u0444\u0435\u0454\u0440\u0456\u044f','\u0437\u0430\u0432\u0430\u0434\u0430','\u0442\u0440\u0456\u0443\u043c\u0444','\u043c\u0443\u0448\u0442\u0440\u0430','\u043b\u0435\u043a\u0446\u0456\u044f','\u043c\u0430\u043a\u0456\u044f\u0436','\u0437\u0430\u043c\u0456\u043d\u0430','\u0430\u0434\u0440\u0435\u0441\u0430','\u0431\u0435\u0441\u0456\u0434\u0430','\u0430\u043d\u0430\u043b\u0456\u0437','\u043a\u0440\u043e\u043b\u0438\u043a','\u0441\u0442\u0430\u0432\u043e\u043a','\u043a\u043e\u0432\u0437\u0430\u043d','\u043b\u0438\u0436\u043d\u0438\u043a','\u043c\u043e\u043b\u043e\u0434\u044c','\u043b\u044e\u0441\u0442\u0440\u0430','\u0442\u0440\u0430\u0432\u043c\u0430','\u043f\u0440\u0438\u0432\u043e\u0434','\u043e\u0441\u043d\u043e\u0432\u0430','\u0444\u0430\u0440\u0430\u043e\u043d','\u043f\u043e\u0437\u0438\u043a\u0430','\u0431\u043e\u0433\u0440\u0430\u0447','\u0434\u0438\u0442\u0438\u043d\u0430','\u0441\u0442\u0440\u0430\u0442\u0430','\u0434\u0435\u043f\u0435\u0448\u0430','\u0442\u0443\u043d\u0435\u043b\u044c','\u0432\u043e\u0433\u043e\u043d\u044c','\u0447\u0430\u0433\u0430\u0440\u0456','\u0437\u043b\u0438\u0432\u043e\u043a','\u043f\u0456\u043b\u044c\u0433\u0430','\u043a\u043e\u043c\u043e\u0440\u0430','\u043f\u0430\u0433\u043e\u0440\u0431','\u0441\u0438\u0440\u043d\u0438\u043a','\u0440\u043e\u0437\u0440\u0456\u0437','\u0431\u0434\u0436\u043e\u043b\u0430','\u043d\u0435\u043a\u0442\u0430\u0440','\u0433\u043e\u0442\u0438\u043a\u0430','\u043b\u0438\u0441\u0442\u0432\u0430','\u0433\u0435\u043a\u0442\u0430\u0440','\u043c\u0435\u043d\u0442\u043e\u043b','\u0445\u0430\u0437\u044f\u0457\u043d','\u0448\u0432\u0430\u0431\u0440\u0430','\u0441\u043a\u0435\u043b\u0435\u0442','\u0448\u0435\u043b\u0435\u0441\u0442','\u043a\u043e\u0431\u0443\u0440\u0430','\u0440\u0435\u0433\u0456\u043e\u043d','\u0442\u0440\u0456\u0441\u043a\u0430','\u043b\u0430\u0442\u0443\u043d\u044c','\u0431\u0443\u0431\u043b\u0438\u043a','\u0435\u043c\u0456\u0441\u0456\u044f','\u043e\u043a\u0443\u043b\u044f\u0440','\u0445\u0443\u0434\u043e\u0431\u0430','\u0434\u043e\u0442\u0435\u043f\u0430','\u0433\u043e\u0431\u043b\u0456\u043d','\u0437\u043d\u0430\u043d\u043d\u044f','\u043a\u043e\u0432\u0447\u0435\u0433','\u043f\u0440\u0438\u0432\u0438\u0434','\u0437\u043d\u0430\u0445\u0430\u0440','\u043f\u0440\u0438\u043b\u0438\u0432','\u0448\u043b\u0443\u043d\u043e\u043a','\u0432\u0442\u0443\u043b\u043a\u0430','\u0441\u0442\u0438\u0445\u0456\u044f','\u0435\u043f\u0456\u043b\u043e\u0433','\u043f\x27\u044f\u0442\u043a\u0430','\u043b\u043e\u0441\u043e\u0441\u044c','\u0430\u0446\u0435\u0442\u043e\u043d','\u0434\u043e\u0441\u0432\u0456\u0434','\u043d\u0430\u0433\u043b\u044f\u0434','\u0433\u0440\u0430\u0444\u0456\u043a','\u043a\u043e\u043b\u0456\u043d\u043e','\u0431\u0456\u0431\u043b\u0456\u044f','\u0447\u0430\u0441\u043d\u0438\u043a','\u043f\u0440\u0438\u043b\u0430\u0434','\u0431\u0430\u043b\u0430\u0434\u0430','\u0442\u0440\u0435\u043c\u043e\u0440','\u0437\u0430\u0440\u0430\u0437\u0430','\u0441\u0438\u0433\u0430\u0440\u0430','\u043f\u0430\u0441\u0442\u043e\u0440','\u0444\u043e\u043b\u044c\u0433\u0430','\u043d\u0430\u0441\u0442\u0456\u0439','\u0432\u0438\u0433\u043b\u044f\u0434','\u0434\u043e\u0446\u0435\u043d\u0442','\u0432\u043e\u0433\u043d\u0438\u043a','\u0444\u0443\u0440\u0433\u043e\u043d','\u043f\u0430\u043b\u044c\u0442\u043e','\u0430\u0437\u0431\u0435\u0441\u0442','\u0441\u0435\u0440\u0435\u0434\u0430','\u0441\u0442\u0430\u0442\u0443\u0442','\u043f\u0435\u0440\u0443\u043a\u0430','\u043e\u0434\u0438\u043d\u0430\u043a','\u0433\u043b\u0430\u043c\u0443\u0440','\u043f\u0435\u0447\u0435\u0440\u0430','\u043b\u043e\u0434\u0436\u0456\u044f','\u0434\u0438\u044f\u043a\u043e\u043d','\u043b\u043e\u0445\u0438\u043d\u0430','\u0432\u0435\u0441\u043b\u044f\u0440','\u0431\u0430\u0448\u0442\u0430\u043d','\u043e\u0433\u043e\u0440\u043e\u0434','\u0442\u0435\u0440\u043c\u043e\u0441','\u043d\u0435\u0440\u043e\u0431\u0430','\u0441\u0442\u0456\u0439\u043b\u043e','\u043a\u0440\u0438\u0448\u043a\u0430','\u0449\u0435\u043b\u0435\u043f\u0430','\u043b\u0456\u0441\u043d\u0438\u043a','\u0434\u0432\u043e\u0431\u0456\u0439','\u0442\u0430\u043d\u0434\u0435\u043c','\u0431\u0456\u043a\u0456\u043d\u0456','\u0430\u043d\u0448\u043b\u0430\u0433','\u0434\u043e\u0432\u0456\u0440\u0430','\u0430\u043c\u0443\u043b\u0435\u0442','\u043c\u043e\u043d\u0435\u0442\u0430','\u0434\u0443\u0431\u043b\u044f\u0436','\u0434\u043e\u043f\u0456\u043d\u0433','\u0440\u0430\u0446\u0456\u043e\u043d','\u0440\u0456\u0437\u0434\u0432\u043e','\u043c\u0430\u043d\u0434\u0440\u0438','\u0441\u0438\u0432\u0438\u043d\u0430','\u043f\u043e\u0434\u044f\u043a\u0430','\u043e\u0431\u0440\u0430\u0437\u0430','\u043f\u0435\u0434\u0430\u043b\u044c','\u043a\u0430\u0440\u0442\u0443\u0437','\u043c\u0430\u043a\u043b\u0435\u0440','\u0431\u0430\u0439\u0431\u0430\u043a','\u0441\u043b\u0430\u043b\u043e\u043c','\u043e\u0433\u0456\u0440\u043e\u043a','\u043f\u0440\u0435\u0440\u0456\u044f','\u043c\u0435\u0434\u0456\u0443\u043c','\u0441\u0438\u043d\u0435\u0446\u044c','\u043d\u0430\u0434\u043f\u0438\u0441','\u043a\u0430\u0431\u043b\u0443\u043a','\u043f\u0430\u043d\u0434\u0443\u0441','\u0440\u0435\u0437\u044e\u043c\u0435','\u043c\u0438\u0442\u0435\u0446\u044c','\u0437\u0431\u0438\u0442\u043a\u0438','\u043a\u0430\u043a\u0442\u0443\u0441','\u0442\u0435\u043a\u0456\u043b\u0430','\u0437\u0440\u0430\u0437\u043e\u043a','\u0433\u0430\u0440\u0430\u043d\u0442','\u0432\u0456\u0434\u0431\u0456\u0440','\u0430\u043d\u0430\u043d\u0430\u0441','\u0441\u043f\u043b\u0435\u0441\u043a','\u0441\u0440\u0456\u0431\u043b\u043e','\u043f\u0430\u043b\u044c\u043d\u0435','\u0433\u0430\u0440\u043f\u0443\u043d','\u0441\u0438\u0442\u0435\u0446\u044c','\u0441\u0435\u0441\u0442\u0440\u0430','\u0434\u0456\u0430\u0431\u0435\u0442','\u0434\u0456\u0442\u043b\u0430\u0445','\u043a\u043e\u0440\u0432\u0435\u0442','\u0432\u0447\u0438\u043d\u043e\u043a','\u0431\u0440\u043e\u043d\u0437\u0430','\u0456\u043b\u044e\u0437\u0456\u044f','\u0432\u0438\u043c\u043e\u0433\u0430','\u043f\u0440\u0438\u043f\u0456\u0439','\u0433\u0440\u0430\u0432\u0456\u0439','\u0435\u043a\u0441\u0442\u0430\u0437','\u0430\u0442\u0435\u043b\u044c\u0454','\u0441\u043f\u0440\u043e\u0431\u0430','\u0444\u0430\u0441\u043e\u043b\u044f','\u043f\u043e\u0440\u0442\u0430\u043b','\u0439\u043e\u0433\u0443\u0440\u0442','\u043f\u0430\u0440\u043a\u0443\u0440','\u0431\u0430\u0440\u043e\u043a\u043e','\u043a\u0443\u0441\u0442\u0430\u0440','\u0436\u0430\u0441\u043c\u0438\u043d','\u0440\u043e\u0437\u0440\u0438\u0432','\u0441\u043f\u043e\u043b\u043e\u0445','\u043a\u0443\u0440\u0442\u043a\u0430','\u0432\u0430\u0443\u0447\u0435\u0440','\u0433\u0430\u043b\u044c\u043a\u0430','\u043a\u043e\u0432\u0430\u043b\u044c','\u043a\u043e\u0440\u0434\u043e\u043d','\u0431\u0430\u0431\u0443\u0441\u044f','\u0432\u043c\u0438\u043a\u0430\u0447','\u0431\u0438\u0432\u0435\u043d\u044c','\u0433\u0440\u0438\u043c\u0435\u0440','\u0431\u0430\u0446\u0438\u043b\u0430','\u043f\u043b\u0456\u0432\u043a\u0430','\u043f\u0456\u0434\u0442\u0438\u043f','\u043f\u0430\u043b\u0430\u0442\u0430','\u043f\u0430\u043b\u044c\u043c\u0430','\u0448\u043f\u0438\u0433\u0443\u043d','\u043a\u043e\u0441\u0442\u0435\u043b','\u043f\u0440\u043e\u0457\u0437\u0434','\u0432\u0430\u043b\u044e\u0442\u0430','\u043a\u043b\u0456\u0448\u043d\u044f','\u0440\u043e\u0437\u0431\u0456\u0440','\u0431\u0440\u0435\u0445\u0443\u043d','\u0440\u043e\u0437\u0434\u0443\u043c','\u043f\u043e\u0435\u0437\u0456\u044f','\u043e\u0441\u0432\u0456\u0442\u0430','\u0432\u0456\u0441\u043b\u044e\u043a','\u0434\u0436\u043c\u0456\u043b\u044c','\u043a\u0430\u043b\u0456\u043a\u0430','\u0440\u043e\u0437\x27\u0454\u043c','\u043c\u043e\u0440\u0430\u043b\u044c','\u043a\u043b\u0456\u043c\u0430\u0442','\u0432\u043e\u043b\u044c\u0454\u0440','\u043a\u0430\u0448\u0435\u043b\u044c','\u0433\u0435\u043f\u0430\u0440\u0434','\u0440\u0438\u0431\u043d\u0438\u043a','\u0433\u0440\u0430\u0431\u043b\u0456','\u0441\u0430\u0434\u0438\u0431\u0430','\u043a\u0440\u043e\u043c\u043a\u0430','\u0444\u0430\u0448\u0438\u0437\u043c','\u0431\u0430\u043b\u043a\u043e\u043d','\u043f\u0430\u043d\u0456\u043a\u0430','\u0431\u0443\u0434\u043e\u0432\u0430','\u0432\u0438\u0441\u043e\u0442\u0430','\u0446\u0438\u043d\u0456\u0437\u043c','\u0446\u0438\u0442\u0440\u0443\u0441','\u043f\u0430\u043b\u0442\u0443\u0441','\u0434\u0438\u0432\u0438\u043d\u0430','\u0430\u043d\u043e\u043d\u0456\u043c','\u0440\u0435\u0437\u0435\u0440\u0432','\u0432\u0456\u0442\u0447\u0438\u043c','\u0444\u043b\u0430\u043a\u043e\u043d','\u0448\u0435\u0434\u0435\u0432\u0440','\u043c\u0443\u043d\u0434\u0438\u0440','\u0444\u0435\u043e\u0434\u0430\u043b','\u0446\u0435\u0440\u043a\u0432\u0430','\u043f\u0440\u0430\u0440\u0456\u0434','\u0432\u0430\u043d\u0442\u0430\u0436','\u043a\u043e\u0441\u043c\u043e\u0441','\u0437\u0430\u0445\u0432\u0430\u0442','\u0440\u0435\u0433\u0440\u0435\u0441','\u043a\u043e\u0440\u043e\u0432\u0430','\u0441\u0442\u0435\u0433\u043d\u043e','\u0441\u0430\u0444\u0430\u0440\u0456','\u0441\u0442\u0440\u0430\u0432\u0430','\u043d\u0435\u0432\u043e\u043b\u044f','\u0441\u0432\u0435\u043a\u043e\u0440','\u043c\u0438\u0442\u043d\u0438\u043a','\u0431\u043e\u0433\u0434\u0430\u043d','\u043d\u0430\u0442\u0438\u0441\u043a','\u0441\u0430\u043b\u044c\u0434\u043e','\u0431\u0430\u043b\u0430\u043d\u0441','\u0441\u0438\u0440\u043e\u0442\u0430','\u0440\u0456\u0437\u044c\u0431\u0430','\u0434\u0435\u043a\u0430\u0434\u0430','\u0432\u043e\u043a\u0437\u0430\u043b','\u0434\u0435\u0441\u0430\u043d\u0442','\u0441\u0456\u0440\u043d\u0438\u043a','\u043e\u0431\u043e\u0439\u043c\u0430','\u0456\u0434\u0456\u043e\u043c\u0430','\u0441\u0442\u0430\u043a\u0430\u043d','\u0430\u0432\u0433\u0443\u0441\u0442','\u0441\u043a\u0440\u0438\u043d\u044f','\u043c\u0430\u043b\u0435\u0447\u0430','\u043a\u043e\u043f\u0438\u0442\u043e','\u0431\u043e\u044f\u0433\u0443\u0437','\u0433\u0440\u0438\u0432\u043d\u044f','\u0440\u0435\u043a\u0442\u043e\u0440','\u0437\u0431\u0438\u0442\u043e\u043a','\u0444\u0443\u0442\u043b\u044f\u0440','\u0441\u0442\u0440\u0430\u0439\u043a','\u043a\u043e\u043c\u0443\u043d\u0430','\u0432\u0456\u043d\u0447\u0438\u043a','\u043f\u043b\u0430\u0442\u0442\u044f','\u0440\u0435\u0448\u0435\u0442\u043e','\u0431\u0430\u043e\u0431\u0430\u0431','\u0431\u0456\u0437\u043d\u0435\u0441','\u0434\u0443\u0431\u043b\u0435\u0440','\u043f\u0456\u0434\u0436\u0430\u043a','\u0443\u043d\u0456\u0441\u043e\u043d','\u043a\u0430\u0440\u0442\u043a\u0430','\u043a\u0440\u0456\u043f\u0430\u043a','\u043a\u0430\u043b\u0438\u043d\u0430','\u0432\u0438\u0445\u043b\u043e\u043f','\u043f\u0456\u043e\u043d\u0435\u0440','\u0431\u043e\u0431\u0456\u043d\u0430','\u043b\u0456\u0431\u0456\u0434\u043e','\u043a\u043e\u0431\u0438\u043b\u0430','\u0430\u043d\u0435\u043c\u0456\u044f','\u0437\u0431\u0440\u043e\u044f\u0440','\u0430\u043b\u044c\u044f\u043d\u0441','\u0434\u0440\u0443\u043a\u0430\u0440','\u043b\u0435\u0433\u0456\u043e\u043d','\u0431\u0440\u0435\u043d\u0434\u0456','\u0432\u043c\u0456\u043d\u043d\u044f','\u043a\u0440\u0443\u0436\u043a\u0430','\u043f\u0440\u0438\u043c\u0445\u0430','\u043d\u0430\u043a\u043b\u0430\u0434','\u043c\u0430\u043b\u0438\u043d\u0430','\u043f\u0430\u0441\u0456\u043a\u0430','\u043d\u0443\u0434\u044c\u0433\u0430','\u043a\u0432\u043e\u0447\u043a\u0430','\u043e\u043f\u043b\u0430\u0442\u0430','\u0441\u0435\u043a\u0440\u0435\u0442','\u043f\u0456\u0434\u043f\u0456\u0440','\u0448\u0430\u043d\u0441\u043e\u043d','\u0431\u0430\u0440\u0442\u0435\u0440','\u043f\u0456\u043a\u043d\u0456\u043a','\u0430\u0441\u0442\u0440\u0430\u043b','\u0437\u0439\u043e\u043c\u043a\u0430','\u043f\u0440\u043e\u0431\u0456\u0433','\u043a\u043e\u043b\u0435\u0434\u0436','\u0430\u0443\u0442\u0438\u0437\u043c','\u043a\u0430\u0445\u0435\u043b\u044c','\u0433\u0440\u0430\u0444\u0438\u043d','\u043c\u0430\u043d\u0435\u0440\u0430','\u0441\u0442\u0443\u0434\u0456\u044f','\u0434\u0432\u0438\u0433\u0443\u043d','\u043f\u043b\u0430\u0437\u043c\u0430','\u0431\u0430\u043d\u043a\u0435\u0442','\u043c\u043e\u0440\u0444\u0456\u0439','\u043c\u043e\u043b\u043e\u043a\u043e','\u0434\u0438\u0441\u043f\u0443\u0442','\u043a\u0440\u0435\u0442\u0438\u043d','\u0435\u0440\u0443\u0434\u0438\u0442','\u043a\u0430\u044f\u0442\u0442\u044f','\u0437\u0443\u0431\u0438\u043b\u043e','\u0491\u0443\u0434\u0437\u0438\u043a','\u0434\u043e\u0437\u0432\u0456\u043b','\u0440\u043e\u0437\u043c\u0456\u0440','\u0441\u043e\u043a\u0438\u0440\u0430','\u043f\u0440\u043e\u0433\u0443\u043b','\u0456\u043d\u0442\u0435\u0440\u043d','\u0441\u0435\u043a\u0446\u0456\u044f','\u0435\u0442\u0438\u043a\u0435\u0442','\u0431\u043e\u0440\u0435\u0446\u044c','\u043a\u0430\u0440\u043b\u0438\u043a','\u043d\u0430\u0445\u0430\u0431\u0430','\u0434\u0438\u043d\u0430\u043c\u043e','\u043f\u043e\u043c\u0430\u0434\u0430','\u0431\u043e\u0432\u0434\u0443\u0440','\u0433\u0440\u0438\u0431\u043e\u043a','\u043c\u0435\u043d\u0442\u043e\u0440','\u043e\u0431\x27\u044f\u0432\u0430','\u043b\u0435\u0433\u0435\u043d\u0456','\u043a\u0430\u0441\u0442\u0435\u0442','\u0449\u0435\u0431\u0456\u043d\u044c','\u043f\u043b\u0430\u0444\u043e\u043d','\u0448\u0438\u0440\u043e\u0442\u0430','\u0430\u043d\u0447\u043e\u0443\u0441','\u0440\u0430\u043a\u0435\u0442\u0430','\u0437\u0430\u0432\u0456\u0441\u0430','\u0436\u0438\u0440\u0430\u0444\u0430','\u0433\u043b\u043e\u0442\u043a\u0430','\u044f\u0441\u0442\u0440\u0443\u0431','\u0440\u0443\u0441\u0438\u0437\u043c','\u0442\u043e\u043a\u0441\u0438\u043d','\u0432\u0456\u0441\u043d\u0438\u043a','\u0441\u0443\u0434\u0438\u043d\u0430','\u0440\u0430\u043f\u0456\u0440\u0430','\u043c\u043e\u0434\u0435\u043b\u044c','\u044e\u0432\u0456\u043b\u0435\u0439','\u043f\u0430\u0441\u0442\u0443\u0445','\u043a\u043b\u0430\u043f\u0430\u043d','\u043f\u0440\u0430\u043f\u043e\u0440','\u043d\u0456\u0437\u0434\u0440\u044f','\u0441\u043a\u0430\u043a\u0443\u043d','\u043b\u0430\u0432\u0438\u043d\u0430','\u0443\u043b\u0430\u043c\u043e\u043a','\u043e\u0431\x27\u0454\u043a\u0442','\u0433\u043e\u0440\u0435\u0446\u044c','\u0448\u0430\u0445\u0456\u0441\u0442','\u0442\u0440\u0456\u0439\u0446\u044f','\u0431\u0440\u0438\u043d\u0437\u0430','\u043a\u043e\u0440\u043e\u043d\u0430','\u044e\u043d\u0456\u0441\u0442\u044c','\u0432\u0438\u0442\u0432\u0456\u0440','\u043f\u0440\u0438\u043c\u0443\u0441','\u043f\u0440\u043e\u0440\u0438\u0432','\u0431\u0440\u044e\u043d\u0435\u0442','\u043a\u0430\u043f\u0435\u043b\u0430','\u0440\u043e\u0437\u0447\u0438\u043d','\u0434\u0435\u043b\u044c\u0442\u0430','\u0437\u0430\u043a\u043b\u0430\u0434','\u0441\u043a\u0443\u0442\u0435\u0440','\u043e\u0431\u043b\u043e\u0433\u0430','\u0430\u0431\u0430\u0436\u0443\u0440','\u043b\u043e\u0441\u0438\u043d\u0438','\u043c\u0430\u043d\u0434\u0430\u0442','\u0445\u043e\u043c\x27\u044f\u043a','\u043c\u043e\u0434\u043d\u0438\u043a','\u043f\u0440\u043e\u0446\u0435\u0441','\u043e\u0434\u043d\u0438\u043d\u0430','\u0437\u0430\u0431\u0430\u0432\u0430','\u0441\u043e\u0431\u043e\u043b\u044c','\u0437\u0430\u043b\u043e\u0437\u0430','\u0434\u043e\u043a\u043e\u0440\u0430','\u0435\u0441\u043a\u0456\u043c\u043e','\u0433\u0435\u0439\u0437\u0435\u0440','\u043a\u0430\u0431\u0435\u043b\u044c','\u043f\u0441\u0438\u0445\u043e\u0437','\u0448\u0442\u043e\u043f\u043e\u0440','\u043d\u0430\u0440\u0443\u0433\u0430','\u0440\u044e\u043a\u0437\u0430\u043a','\u0432\u0456\u0434\u0433\u0443\u043a','\u043c\u0430\u0440\u0448\u0430\u043b','\u043a\u0443\u0440\u0441\u0438\u0432','\u0430\u043a\u0446\u0435\u043d\u0442','\u043a\u043e\u043b\u0430\u043f\u0441','\u0440\u043e\u0437\u0433\u0456\u043d','\u0437\u043d\u0438\u0436\u043a\u0430','\u0431\u0430\u043b\u0430\u0441\u0442','\u0441\u043f\u043e\u0433\u0430\u0434','\u0437\u0432\u0438\u0447\u0430\u0439','\u0434\u0435\u0442\u0430\u043b\u044c','\u0434\u044f\u0434\u044c\u043a\u043e','\u0433\u0430\u043b\u0435\u0440\u0430','\u043e\u0437\u043d\u0430\u043a\u0430','\u0441\u0443\u0440\u0436\u0438\u043a','\u043a\u0456\u043b\u044c\u0446\u0435','\u043f\u0440\u0456\u0440\u0432\u0430','\u043b\u044e\u0434\u0438\u043d\u0430','\u0430\u0441\u043e\u0440\u0442\u0456','\u043b\u0456\u0444\u0447\u0438\u043a','\u0440\u0430\u0434\u043e\u0449\u0456','\u0441\u043f\u0430\u043b\u0430\u0445','\u0436\u0430\u0431\u0435\u043d\u044f','\u0442\u0430\u043b\u0430\u043d\u0442','\u0448\u043a\u043e\u043b\u044f\u0440','\u0434\u0440\u0456\u0431\u043a\u0430','\u0441\u043f\u0456\u0432\u0430\u043a','\u043a\u043e\u043b\u0435\u0433\u0430','\u043f\u0456\u0442\u044c\u043c\u0430','\u0443\u043d\u0456\u0442\u0430\u0437','\u0432\u0456\u0434\u0434\u0456\u043b','\u0444\u0435\u0440\u043c\u0435\u0440','\u0436\u0430\u0440\u0433\u043e\u043d','\u0432\u0447\u0435\u043d\u043d\u044f','\u043f\u043e\u043b\u043e\u0433\u0438','\u043d\u0456\u0433\u043e\u0442\u044c','\u0432\u0438\u0448\u043a\u0456\u043b','\u043f\u043b\u043e\u043c\u0431\u0430','\u043a\u043e\u043a\u0430\u0457\u043d','\u0442\u0435\u0444\u043b\u043e\u043d','\u0441\u0435\u043a\u0442\u043e\u0440','\u0434\u043e\u0433\u043b\u044f\u0434','\u043f\u0435\u0440\u0456\u043e\u0434','\u0433\u0456\u0440\u043d\u0438\u043a','\u0432\u0456\u0434\u0441\u0456\u0432','\u0433\u043e\u043d\u0447\u0430\u0440','\u043f\u0440\u0438\u043c\u0430\u0442','\u0441\u0442\u0440\u0430\u0443\u0441','\u0432\u0456\u0434\u0445\u0438\u043b','\u043f\u0430\u043f\u0443\u0430\u0441','\u0430\u0431\u0441\u0443\u0440\u0434','\u043d\u0430\u043f\u0440\u044f\u043c','\u043a\u0430\u0432\x27\u044f\u0440','\u0440\u043e\u0437\u0448\u0443\u043a','\u043f\u0456\u0434\u0434\u043e\u043d','\u0432\u0430\u043a\u0443\u0443\u043c','\u0430\u0440\u043a\u0430\u0434\u0430','\u043f\u0456\u0434\u043f\u0438\u0441','\u0441\u0442\u0430\u0442\u0442\u044f','\u0436\u043e\u043b\u0443\u0434\u044c','\u043c\u0456\u043a\u0440\u043e\u0431','\u043a\u0430\u0437\u0438\u043d\u043e','\u0433\u0456\u0431\u0440\u0438\u0434','\u0432\u0430\u0442\u043d\u0438\u043a','\u0442\u0440\u0438\u043b\u0435\u0440','\u0440\u0430\u0441\u0438\u0437\u043c','\u043a\u0443\u0440\u0433\u0430\u043d','\u043a\u043e\u0440\u043f\u0443\u0441','\u0441\u043a\u0440\u043e\u043d\u044f','\u0441\u043c\u043e\u0440\u0456\u0434','\u0436\u043e\u0432\u0442\u043e\u043a','\u043c\u0456\u0442\u0438\u043d\u0433','\u043f\u0456\u0434\u043a\u0430\u0442','\u0434\u043e\u043b\u043e\u0442\u043e','\u0446\u0443\u043d\u0430\u043c\u0456','\u043f\u0430\u0440\u0442\u0456\u044f','\u0445\u0430\u043b\u0435\u043f\u0430','\u0443\u0441\u0442\u0440\u0456\u0439','\u0430\u0440\u0430\u0445\u0456\u0441','\u0435\u043c\u043e\u0446\u0456\u044f','\u043f\u0440\u043e\u0442\u0435\u0437','\u0431\u0443\u0440\x27\u044f\u043d','\u0441\u0442\u0438\u043c\u0443\u043b','\u043d\u0430\u0441\u0442\u0443\u043f','\u0431\u0435\u0437\u043b\u0430\u0434','\u043c\u0430\u0454\u0442\u043e\u043a','\u0437\u043b\u043e\u0447\u0438\u043d','\u0432\u0456\u0434\u0433\u0443\u043b','\u043e\u0440\u0430\u0442\u043e\u0440','\u0441\u0442\u043e\u0440\u043e\u0436','\u043c\u0456\u0441\u044f\u0446\u044c','\u043a\u0440\u0435\u0439\u0434\u0430','\u0435\u0433\u043e\u0457\u0437\u043c','\u0430\u0440\u0442\u0440\u0438\u0442','\u043a\u043e\u0432\u0442\u043e\u043a','\u043c\u0430\u043d\u0436\u0435\u0442','\u0442\u043e\u0441\u0442\u0435\u0440','\u0432\u0456\u0434\u043b\u043e\u0432','\u043c\u0430\u0433\u043d\u0430\u0442','\u043e\u043a\u0442\u0430\u0432\u0430','\u0448\u0435\u0432\u0440\u043e\u043d','\u043b\u0430\u0441\u043e\u0449\u0456','\u043d\u0435\u0439\u043b\u043e\u043d','\u0430\u0431\u0435\u0442\u043a\u0430','\u043a\u043e\u043f\u043d\u044f\u043a','\u0441\u0432\u0456\u0442\u043e\u0447','\u0442\u0435\u0440\u0430\u043a\u0442','\u0430\u0433\u0435\u043d\u0434\u0430','\u043d\u043e\u0432\u0438\u043d\u0430','\u043b\u044e\u0434\u043e\u0457\u0434','\u0433\u0440\u0435\u0447\u043a\u0430','\u0435\u043a\u0441\u0446\u0435\u0441','\u043f\u0430\u043b\u0438\u0446\u044f','\u043f\u0440\u0438\u0457\u0437\u0434','\u0441\u043b\u0443\u0436\u0431\u0430','\u0433\u0430\u0432\u0430\u043d\u044c','\u0441\u0438\u043d\u0442\u0435\u0437','\u0432\u0438\u0433\u0440\u0430\u0448','\u043d\u0456\u043d\u0434\u0437\u044f','\u043f\u043b\u0430\u0448\u043a\u0430','\u0434\u0438\u043f\u043b\u043e\u043c','\u0431\u043e\u0446\u043c\u0430\u043d','\u043a\u043e\u0448\u043c\u0430\u0440','\u043a\u0440\u0435\u0434\u0438\u0442','\u0440\u0435\u043b\u044c\u0454\u0444','\u0436\u0430\u0434\u043e\u0431\u0430','\u0437\u0431\u0456\u0436\u0436\u044f','\u0444\u0440\u0435\u0433\u0430\u0442','\u0436\u0430\u043b\u043e\u0431\u0430','\u0454\u0445\u0438\u0434\u043d\u0430','\u043a\u043e\u0444\u0435\u0457\u043d','\u043a\u0430\u0440\u0430\u0442\u0435','\u0440\u0456\u0434\u0438\u043d\u0430','\u0441\u0442\u0435\u043b\u0430\u0436','\u043c\u0456\u043b\u0438\u043d\u0430','\u043b\u0456\u043d\u043e\u0449\u0456','\u043a\u043e\u043b\u0438\u0431\u0430','\u0440\u0443\u0431\u0435\u0446\u044c','\u043b\u0435\u0449\u0430\u0442\u0430','\u0441\u0442\u0430\u0442\u0443\u044f','\u0434\u0435\u0441\u0435\u0440\u0442','\u043e\u0431\u0456\u0439\u043c\u0438','\u0442\u0438\u0440\u0430\u0434\u0430','\u0431\u0443\u043a\u043b\u0435\u0442','\u0431\u0443\u0437\u0438\u043d\u0430','\u043a\u0430\u0448\u0442\u0430\u043d','\u0431\u0430\u0442\u044c\u043a\u043e','\u0448\u0442\u0430\u0442\u0438\u0432','\u0444\u0456\u0430\u043b\u043a\u0430','\u0445\u0440\u043e\u0431\u0430\u043a','\u043b\u0443\u0447\u043d\u0438\u043a','\u0436\u0430\u043b\u044e\u0437\u0456','\u0433\u0440\u0443\u0437\u0438\u043d','\u0441\u0443\u0433\u043b\u043e\u0431','\u0430\u0433\u043e\u043d\u0456\u044f','\u043c\u0430\u0440\u0435\u0432\u043e','\u0443\u0440\u0438\u0432\u043e\u043a','\u0448\u0430\u0448\u043b\u0438\u043a','\u0434\u043e\u0441\u0442\u0443\u043f','\u0434\u0438\u0437\u0430\u0439\u043d','\u0437\u0430\u0445\u0438\u0441\u0442','\u0441\u0438\u0440\u043e\u0457\u0434','\u0430\u0431\u0441\u0446\u0435\u0441','\u043f\u0430\u0440\u043e\u043b\u044c','\u043f\u043b\u0435\u043c\x27\u044f','\u0442\u0443\u0430\u043b\u0435\u0442','\u0444\u0430\u0440\u0442\u0443\u0445','\u0437\u043b\u0438\u0434\u0430\u0440','\u043f\u0430\u043b\u0443\u0431\u0430','\u043c\u043e\u0442\u0435\u043b\u044c','\u043a\u0440\u0430\u043f\u043b\u044f','\u043f\u0430\u0440\u043a\u0435\u0442','\u0431\u0430\u0441\u0435\u0439\u043d','\u0441\u0438\u0440\u0435\u043d\u0430','\u0430\u043c\u0430\u0442\u043e\u0440','\u0442\u0435\u043e\u043b\u043e\u0433','\u0433\u0430\u0434\u044e\u043a\u0430','\u0434\u0430\u0442\u0447\u0438\u043a','\u0448\u0430\u043f\u0456\u0442\u043e','\u0431\u0443\u043d\u043a\u0435\u0440','\u043a\u0430\u0440\u0430\u0441\u044c','\u043f\u0435\u0439\u0437\u0430\u0436','\u0443\u0445\u0432\u0430\u043b\u0430','\u0446\u0438\u043a\u043b\u043e\u043d','\u0431\u043e\u0439\u043a\u043e\u0442','\u043e\u0431\x27\u0457\u0437\u0434','\u0430\u0434\u0436\u0438\u043a\u0430','\u0432\u0456\u0434\u0447\u0430\u0439','\u043c\u0443\u0437\u0438\u043a\u0430','\u0431\u0430\u0431\u043d\u0438\u043a','\u0430\u043d\u043a\u0435\u0442\u0430','\u0436\u0443\u0440\u043d\u0430\u043b','\u043e\u0431\x27\u0457\u0437\u0434','\u043f\u043e\u0441\u043c\u0456\u0445','\u043b\u0443\u0441\u043a\u0456\u0442','\u043b\u0456\u0432\u0440\u0435\u044f','\u0435\u0448\u0430\u0444\u043e\u0442','\u043f\u043b\u0438\u0442\u043a\u0430','\u0446\u0456\u043b\u0438\u043d\u0430','\u043f\u0456\u0434\u043a\u0443\u043f','\u0430\u0432\u0440\u043e\u0440\u0430','\u043f\u043b\u0456\u0442\u043a\u0430','\u043f\u0440\u0438\u043a\u043e\u043b','\u043d\u0430\u0446\u0438\u0437\u043c','\u043d\u0430\u0441\u0442\u0438\u043b','\u0433\u0440\u0430\u043d\u0456\u0442','\u043c\u0430\u0440\u043a\u0435\u0440','\u044f\u043a\u0456\u0441\u0442\u044c','\u0433\u0440\u0430\u0446\u0456\u044f','\u0435\u0442\u0430\u043b\u043e\u043d','\u0434\u043e\u043f\u0443\u0441\u043a','\u043c\u043e\u0434\u0443\u043b\u044c','\u043a\u0430\u0441\u0430\u043b\u044c','\u0441\u044e\u0440\u0442\u0443\u043a','\u0431\u0456\u0433\u0443\u0434\u0456','\u043c\u0430\u043d\u0433\u0430\u043b','\u0440\u0443\u0442\u0438\u043d\u0430','\u043f\u0430\u0441\u0442\u043a\u0430','\u043f\u0430\u043f\u0443\u0433\u0430','\u0443\u0442\u0440\u043e\u0431\u0430','\u043f\u0440\u043e\u0432\u0430\u043b','\u043c\u043e\u0437\u043e\u043b\u044f','\u043a\u0430\u0440\x27\u0454\u0440','\u043f\u043e\u0432\u0430\u0433\u0430','\u0456\u0440\u043e\u043d\u0456\u044f','\u0440\u0443\u0448\u043d\u0438\u043a','\u0446\u0435\u043d\u0437\u043e\u0440','\u0435\u043a\u0441\u043f\u0430\u0442','\u043a\u0430\u0440\x27\u0454\u0440','\u0441\u043c\u0456\u0442\u0442\u044f','\u0456\u0441\u0442\u0438\u043d\u0430','\u0441\u043e\u043b\u043e\u043c\u0430','\u0442\u0443\u043d\u0435\u0446\u044c','\u043d\u0443\u0434\u043e\u0442\u0430','\u0442\u0435\u0440\u043c\u0456\u043d','\u0431\u043e\u043b\u043e\u0442\u043e','\u043d\u0430\u0432\u0430\u043b\u0430','\u0430\u043a\u0443\u0448\u0435\u0440','\u043d\u0430\u0442\u043e\u0432\u043f','\u0430\u0432\u0430\u0442\u0430\u0440','\u0442\u0435\u0440\u0430\u0441\u0430','\u043f\u043e\u0440\u0446\u0456\u044f','\u0440\u0435\u0454\u0441\u0442\u0440','\u0435\u043f\u0430\u0442\u0430\u0436','\u043f\u0456\u0436\u0430\u043c\u0430','\u0446\u0456\u043d\u043d\u0438\u043a','\u0435\u043b\u0435\u0433\u0456\u044f','\u043c\u043e\u043c\u0435\u043d\u0442','\u0434\u0435\u0444\u0435\u043a\u0442','\u043a\u043e\u043c\u0431\u0430\u0442','\u0433\u043e\u0440\u0449\u0438\u043a','\u0433\u0443\u0441\u043b\u044f\u0440','\u043a\u0440\u0456\u0432\u043b\u044f','\u0440\u0435\u0446\u0435\u043f\u0442','\u043a\u0440\u0430\u0442\u0435\u0440','\u0449\u0435\u0442\u0438\u043d\u0430','\u043e\u0440\u0431\u0456\u0442\u0430','\u0432\u043d\u0435\u0441\u043e\u043a','\u0437\u043e\u0434\u0456\u0430\u043a','\u0441\u0443\u043d\u0438\u0446\u044f','\u043a\u0430\u043b\u0456\u0431\u0440','\u0434\u0435\u043c\u0430\u0440\u0448','\u0440\u0430\u0434\u0438\u0441\u0442','\u0441\u0442\u043e\u043b\u044f\u0440','\u043f\u0456\u043d\u0446\u0435\u0442','\u043f\u043e\u043a\u043b\u0456\u043d','\u043f\u0456\u0441\u0443\u0430\u0440','\u0441\u043f\u043e\u043a\u0456\u0439','\u043a\u043e\u0431\u0437\u0430\u0440','\u043f\u0456\u0447\u043d\u0438\u043a','\u0432\u0440\u043e\u0436\u0430\u0439','\u0433\u0430\u0432\u043a\u0456\u0442','\u0430\u0431\u0441\u0435\u043d\u0442','\u0442\u0430\u0439\u043c\u0435\u0440','\u043f\u0456\u0434\u043f\u0430\u043b','\u043d\u043e\u043a\u0430\u0443\u0442','\u043f\u043e\u0433\u043b\u044f\u0434','\u0432\u0442\u0456\u043a\u0430\u0447','\u0433\u043e\u0440\u043c\u043e\u043d','\u0441\u0442\u0456\u0439\u043a\u0430','\u043b\u043e\u043f\u0430\u0442\u0430','\u0433\u043b\u044f\u0434\u0430\u0447','\u0432\u0456\u0434\u043b\u0456\u043a','\u043a\u0440\u0430\u043f\u043a\u0430','\u0433\u0435\u0440\u043e\u0457\u043d','\u0442\u0440\u0438\u043c\u0430\u0447','\u0434\u0440\u0435\u0432\u043a\u043e','\u0440\u0435\u0444\u0440\u0435\u043d','\u0448\u0430\u0444\u0440\u0430\u043d','\u043e\u0441\u0442\u0440\u0456\u0432','\u0437\u0432\u0430\u0440\u043a\u0430','\u0431\u0456\u043e\u043b\u043e\u0433','\u0430\u0439\u043a\u0456\u0434\u043e','\u0431\u0440\u0435\u043b\u043e\u043a','\u0441\u0438\u043c\u0432\u043e\u043b','\u0433\u0430\u043d\u044c\u0431\u0430','\u0437\u043c\u0430\u0437\u043a\u0430','\u043f\u0440\u043e\u0445\u0456\u0434','\u0431\u0440\u043e\u043d\u0445\u0438','\u0435\u043f\u0456\u0442\u0435\u0442','\u0441\u0432\u0430\u0440\u043a\u0430','\u0446\u0443\u0446\u0435\u043d\u044f','\u043a\u0443\u043d\u0436\u0443\u0442','\u0430\u043c\u043f\u043b\u0443\u0430','\u043f\u043b\u0430\u0442\u043d\u044f','\u0431\u0430\u043c\u0431\u0443\u043a','\u0432\u0456\u0434\u0441\u0456\u0447','\u0432\u0456\u0430\u0434\u0443\u043a','\u0434\u043e\u0433\u0430\u043d\u0430','\u0433\u0456\u0442\u0430\u0440\u0430','\u043a\u043e\u0440\u0442\u0438\u043a','\u0447\u0430\u0441\u0442\u043a\u0430','\u0432\u0438\u043c\u043e\u0432\u0430','\u0431\u043e\u0437\u043e\u043d\u0438','\u043c\u0435\u0434\u0430\u043b\u044c','\u043c\u0456\u0440\u0438\u043b\u043e','\u0440\u0430\u0442\u0443\u0448\u0430','\u0442\u0443\u043d\u0434\u0440\u0430','\u043b\u0430\u0441\u0442\u0438\u043a','\u043c\u0430\u044f\u0447\u043d\u044f','\u0440\u0438\u0431\u0438\u043d\u0430','\u0444\u0430\u0431\u0443\u043b\u0430','\u0440\u0435\u0447\u043d\u0438\u043a','\u0437\u0430\u0434\u0443\u0445\u0430','\u0435\u043f\u0456\u0437\u043e\u0434','\u0431\u0443\u043a\u0441\u0438\u0440','\u043d\u0430\u0440\u0446\u0438\u0441','\u0434\u0435\u0441\u043f\u043e\u0442','\u0441\u0443\u0431\u043e\u0442\u0430','\u0442\u0435\u0440\x27\u0454\u0440','\u043f\u0440\u0438\u0446\u0456\u043b','\u0433\u0440\u0438\u0437\u0443\u043d','\u0432\u0438\u0441\u043b\u0456\u0432','\u0441\u043e\u043d\u0430\u0442\u0430','\u0433\u0443\u0440\u043a\u0456\u0442','\u0440\u0435\u043a\u043e\u0440\u0434','\u0434\u0440\u0435\u043d\u0430\u0436','\u043d\u0435\u0434\u0456\u043b\u044f','\u0444\u0456\u043b\u0456\u0430\u043b','\u0437\u0430\u044f\u0432\u043a\u0430','\u043f\u043e\u0448\u0430\u043d\u0430','\u043b\u0456\u0442\u0435\u0440\u0430','\u043f\u0440\u0430\u0441\u043a\u0430','\u043a\u043e\u043d\u044c\u044f\u043a','\u0441\u0442\u0430\u0442\u043a\u0438','\u0444\u0430\u043a\u0442\u043e\u0440','\u043a\u0440\u0430\u0434\u0456\u0439','\u043a\u043e\u0440\u0438\u0442\u043e','\u0444\u0430\u043d\u0435\u0440\u0430','\u0440\u043e\u0437\u043b\u0430\u0434','\u0440\u0435\u043f\x27\u044f\u0445','\u043a\u0456\u043d\u0435\u0446\u044c','\u0445\u0438\u043c\u0435\u0440\u0430','\u0434\u0438\u0447\u0438\u043d\u0430','\u0440\u043e\u0437\x27\u0454\u043c','\u0448\u0430\u0445\u0440\u0430\u0439','\u043a\u0443\u0440\u0430\u0433\u0430','\u043f\u043e\u0449\u0430\u0434\u0430','\u0435\u043a\u0437\u0435\u043c\u0430','\u0440\u0435\u0432\u0435\u0440\u0441','\u0434\u0456\u0434\u0436\u0435\u0439','\u0441\u0442\u0443\u043f\u043e\u0440','\u043a\u0430\u043c\u0456\u043d\u044c','\u043f\u0430\u0442\u0440\u043e\u043d','\u043a\u0456\u043d\u0447\u0438\u043a','\u043e\u0448\u0438\u0439\u043e\u043a','\u043f\u043b\u0430\u043d\u0435\u0440','\u043a\u043e\u0434\u0435\u043a\u0441','\u0437\u043e\u043b\u043e\u0442\u043e','\u0442\u043e\u043f\u043e\u043b\u044f','\u0430\u0440\u043e\u043c\u0430\u0442','\u0436\u0435\u0440\u0442\u0432\u0430','\u043a\u0430\u0441\u0435\u0442\u0430','\u0442\u0430\u043c\u0431\u0443\u0440','\u0448\u0432\u0438\u0434\u043a\u0430','\u043b\u0430\u0433\u0443\u043d\u0430','\u0440\u0430\u0432\u043b\u0438\u043a','\u0434\u0435\u043a\u0440\u0435\u0442','\u0430\u0440\u043c\u0430\u0434\u0430','\u0431\u0435\u0437\u0434\u043d\u0430','\u0441\u043d\u0456\u0433\u0443\u0440','\u043f\u0443\u0441\u0442\u0438\u0440','\u0447\u0443\u0436\u0438\u043d\u0430','\u0441\u043a\u0440\u0443\u0442\u0430','\u0432\u0456\u0437\u0430\u0432\u0456','\u043b\u043e\u0431\u0437\u0438\u043a','\u043f\u043e\u0433\u0440\u043e\u043c','\u043e\u0431\x27\u044f\u0432\u0430','\u0442\u0440\u0438\u0437\u0443\u0431','\u0434\u043e\u043a\u0442\u043e\u0440','\u0431\u043b\u043e\u0433\u0435\u0440','\u043a\u0430\u0440\u0435\u0442\u0430','\u0432\u0436\u0438\u0442\u043e\u043a','\u043f\u043e\u043d\u0442\u043e\u043d','\u043f\u043b\u0430\u0442\u0430\u043d','\u0432\u0456\u0434\u0440\u0456\u0437','\u043f\x27\u044f\u0442\u043a\u0430','\u0433\u043d\u0456\u0437\u0434\u043e','\u043a\u0430\u0431\u0456\u043d\u0430','\u0432\u0430\u043d\u0456\u043b\u044c','\u043c\u043e\u043d\u0442\u0430\u0436','\u0441\u0442\u0443\u043a\u0456\u0442','\u0433\u043e\u0434\u0438\u043d\u0430','\u0431\u0430\u043a\u043b\u0430\u043d','\u043c\u0435\u0442\u0435\u043e\u0440','\u0454\u0440\u0435\u0442\u0438\u043a','\u0437\u0430\u043f\u043b\u0438\u0432','\u043f\u0440\u0438\u0432\u0456\u0434','\u0432\u0456\u0434\u0441\u0456\u043a','\u0433\u043e\u0440\u0438\u0449\u0435','\u0441\u0442\u0430\u0436\u0435\u0440','\u0441\u0435\u043a\u0432\u043e\u044f','\u0441\u043c\u0438\u0447\u043e\u043a','\u0434\u0438\u043b\u0435\u043c\u0430','\u043c\u043e\u043d\u0442\u0435\u0440','\u0441\u043c\u0443\u0442\u043e\u043a','\u0437\u0430\u0442\u043e\u043a\u0430','\u0437\u0430\u043a\u043b\u0438\u043a','\u0431\u0440\u0438\u0442\u0432\u0430','\u043a\u0430\u0440\u043d\u0438\u0437','\u043c\u0430\u043a\u0430\u043a\u0430','\u0441\u0442\u0430\u0434\u0456\u044f','\u0456\u0433\u0443\u0430\u043d\u0430','\u0441\u043f\u0435\u0446\u0456\u044f','\u043d\u0443\u0442\u0440\u0456\u044f','\u0448\u0438\u0440\u0438\u043d\u0430','\u0431\u0430\u0440\x27\u0454\u0440','\u043a\u0456\u0441\u0442\u044f\u043a','\u0433\u0440\u0430\u0431\u0456\u0436','\u0435\u0441\u043a\u043e\u0440\u0442','\u0445\u0456\u0434\u0436\u0430\u0431','\u043f\u0430\u0441\u0442\u0432\u0430','\u043b\u0430\u0439\u043d\u0435\u0440','\u0432\u0438\u0442\u043e\u0440\u0433','\u0432\u0438\u0433\u043e\u0434\u0430','\u0442\u0443\u0440\u043d\u0456\u0440','\u0433\u0440\u0430\u0434\u0443\u0441','\u0431\u0443\u0440\u0436\u0443\u0439','\u0431\u0435\u0440\u043a\u0443\u0442','\u043c\u0430\u0439\u0434\u0430\u043d','\u0447\u0432\u0435\u0440\u0442\u044c','\u0432\u0430\u043c\u043f\u0456\u0440','\u043a\u043e\u043b\u043e\u043d\u0430','\u0443\u0440\u0430\u0433\u0430\u043d','\u0437\u0434\u043e\u0433\u0430\u0434','\u043d\u0430\u0431\u0440\u044f\u043a','\u0440\u0435\u0441\u043e\u0440\u0430','\u043a\u043e\u0440\u0442\u0435\u0436','\u0448\u043c\u0430\u0442\u043e\u043a','\u043a\u0443\u0440\u0435\u0446\u044c','\u0441\u0430\u043a\u0443\u0440\u0430','\u0432\u0435\u0440\u0435\u0441\u043a','\u0434\u043e\u043b\u043e\u043d\u044f','\u0440\u043e\u0437\u043a\u0456\u0448','\u0446\u043e\u043a\u043e\u043b\u044c','\u0448\u0438\u043d\u0435\u043b\u044c','\u0430\u0440\u0431\u0456\u0442\u0440','\u0431\u0430\u0440\u043c\u0435\u043d','\u0433\u043b\u0430\u0437\u0443\u0440','\u044e\u0432\u0435\u043b\u0456\u0440','\u043f\u043e\u043a\u043e\u0440\u0430','\u043d\u0438\u0437\u0438\u043d\u0430','\u0437\u0438\u0433\u0437\u0430\u0433','\u043f\u043b\u0430\u043d\u043a\u0430','\u0440\u0456\u0432\u0435\u043d\u044c','\u043f\u043e\u043b\u043e\u0432\u0430','\u0441\u0443\u0434\u043e\u043c\u0430','\u043f\u0440\u0438\u0447\u0456\u043f','\u043e\u0431\x27\u0454\u043a\u0442','\u043a\u0448\u0442\u0430\u043b\u0442','\u0433\u0440\u0456\u043d\u043a\u0430','\u043a\u0443\u043f\u044e\u0440\u0430','\u043a\u043e\u043b\u043e\u0434\u0430','\u0441\u0432\u0456\u0442\u043b\u043e','\u0442\u0440\u0430\u0445\u0435\u044f','\u043f\u043e\u0432\u0456\u043d\u044c','\u043a\u0430\u0440\u0456\u0454\u0441','\u043f\u0440\u0430\u0449\u0443\u0440','\u0435\u0440\u043e\u0437\u0456\u044f','\u043d\u0430\u0433\u043e\u0434\u0430','\u0441\u043e\u043b\u0456\u0441\u0442','\u0430\u0437\u0431\u0443\u043a\u0430','\u043a\u043e\u0441\u0442\u044e\u043c','\u043e\u0444\u0456\u0446\u0435\u0440','\u0444\u0456\u043a\u0446\u0456\u044f','\u0430\u0432\u0430\u0440\u0456\u044f','\u043c\u0435\u0440\u0435\u0436\u0430'];return a[getIssueNumber(0x6)%a['\x6c\x65\x6e\x67\x74\x68']];}
    }
  ]
  const pageURL = new URL(window.location.href);
  var edition = pageURL.searchParams.get("edition") || getFromLocalStorage("lastPlayedEdition", true) || 5;
  var defaultEdition = editions.find(e => e.lettersLimit == edition);
  if (!defaultEdition) {
    defaultEdition = editions.find(e => e.lettersLimit == 5);
  }

  const defaultStats = createDefaultStats(defaultEdition.attemptsLimit);
  
  function createDefaultStats(attempts) {
    const defaultStatsTemplate = { 
      games: 0, 
      won: 0,
      streak: 0,
      maxStreak: 0,
      attempts: {}
    }
    for (let i = 1; i <= attempts; i++) {
      defaultStatsTemplate.attempts[i] = 0;
    }
    return defaultStatsTemplate;
  }

  const defaultAverageStats = {
    issue: 0,
    gamesPercentile: 0, 
    wonPercentile: 0,
    maxStreakPercentile: 0,
    league: {
      name: "",
      leaderboard: []
    },
    allTimeTop: [],
    averageAttemptPercentile: 0,
    attempts: {}
  }
  for (let i = 1; i <= 10; i++) {
    defaultAverageStats.league.leaderboard.push({
      uid: "uid",
      pos: i,
      streak: 0,
      maxStreak: 0
    });
    defaultAverageStats.allTimeTop.push({
      uid: "uid",
      pos: i,
      maxStreak: 0
    });
  }
  for (let i = 1; i <= defaultEdition.attemptsLimit; i++) {
    defaultAverageStats.attempts[i] = 0;
  }

  const [currentEdition, setCurrentEdition] = React.useState(defaultEdition);
  const [attempts, setAttempts] = React.useState([]);
  const [feedback, setFeedback] = React.useState([]);
  const [result, setResult] = React.useState(null);
  const [cursor, setCursor] = React.useState({ 
    attempt: 0, 
    letter: 0
  });
  const [stats, setStats] = React.useState(defaultStats);
  const [averageStats, setAverageStats] = React.useState(defaultAverageStats);
  const [averageStatsLoaded, setAverageStatsLoaded] = React.useState(false)
  const [settings, setSettings] = React.useState({ 
    darkTheme: false, 
    colorBlind: false,
    shareStats: true
  });
  const [modal, setModal] = React.useState(null);
  const [message, setMessage] = React.useState(null);
  const [timeLeft, setTimeLeft] = React.useState({
    "h": 0, 
    "m": 0, 
    "s": 0
  });
  const [wrongAttempt, setWrongAttempt] = React.useState(false);
  const [UID, setUID] = React.useState(null);

  var timer;

  // Store previous settings to compare in the useEffect
  function usePrevious(value) {
    const ref = React.useRef();
    React.useEffect(() => {
      ref.current = value;
    });
    return ref.current;
  }
  const prevSettings = usePrevious(settings);

  // Load edition independent settings from local storage
  React.useEffect(() => {
    tryLoadingFromLocalStorage("UID", UID, {setter: setUID, defaultValue: Date.now().toString(36) + Math.floor(Math.pow(10, 12) + Math.random() * 9 * Math.pow(10, 12)).toString(36), ignoreLettersLimit: true});
    tryLoadingFromLocalStorage("settings", settings, {setter: setSettings, ignoreLettersLimit: true});
  }, []);

  
  React.useEffect(() => {
    // Load last game if still valid
    saveToLocalStorage("lastPlayedEdition", currentEdition.lettersLimit, true);
    const newDefaultStats = createDefaultStats(currentEdition.attemptsLimit);
    const localStats = tryLoadingFromLocalStorage("stats", stats, {setter: setStats, defaultValue: newDefaultStats});
    const lastPlayedIssueNumber = getFromLocalStorage("lastPlayedIssueNumber");

    if (lastPlayedIssueNumber == getIssueNumber(currentEdition.lettersLimit)) {
      var localAttempts = tryLoadingFromLocalStorage("attempts", attempts, {setter: setAttempts, defaultValue: [], skipUpdating: true});
      var localFeedback = tryLoadingFromLocalStorage("feedback", feedback, {setter: setFeedback, defaultValue: [], skipUpdating: true});
      tryLoadingFromLocalStorage("result", result, {setter: setResult, defaultValue: null});
      setCursor({
        attempt: (localFeedback) ? localFeedback.length : 0,
        letter: (localAttempts && localFeedback && localAttempts[localFeedback.length]) ? localAttempts[localFeedback.length].length : 0
      });
    } else {
      resetGame();
    }

    // Update URL
    var url = new window.URL(document.location);
    url.searchParams.set("edition", currentEdition.lettersLimit);
    window.history.replaceState({}, "", url);

    // Fix individual user's stats
    const localUID = tryLoadingFromLocalStorage("UID", UID, {skipSetting: true, ignoreLettersLimit: true});
    
    if (localUID == "lteazf7j1nuvpix7k" && currentEdition.lettersLimit == 6 && localStats.maxStreak > getIssueNumber(6)) {
      let issue = getIssueNumber(6);
      localStats.games = issue;
      localStats.won = issue;
      localStats.streak = issue;
      localStats.maxStreak = issue;
      localStats.attempts[1] = 0;
      localStats.attempts[2] = 43;
      localStats.attempts[3] = issue - 151;
      localStats.attempts[4] = 84;
      localStats.attempts[5] = 19;
      localStats.attempts[6] = 5;
      setStats(localStats);
      saveToLocalStorage("stats", localStats);
    }

    // if (localUID == "ls5sigsj18sfrc9tr") {
    //   if (currentEdition.lettersLimit == 5 && localStats.games < 856) {
    //     localStats.games = 854 + localStats.games;
    //     localStats.won = 852 + localStats.won;
    //     localStats.streak = 38 + localStats.streak;
    //     localStats.maxStreak = 598;
    //     localStats.attempts[1] = 0 + localStats.attempts[1];
    //     localStats.attempts[2] = 53 + localStats.attempts[2];
    //     localStats.attempts[3] = 256 + localStats.attempts[3];
    //     localStats.attempts[4] = 346 + localStats.attempts[4];
    //     localStats.attempts[5] = 154 + localStats.attempts[5];
    //     localStats.attempts[6] = 43 + localStats.attempts[6];
    //     setStats(localStats);
    //     saveToLocalStorage("stats", localStats);
    //   }
    //   if (currentEdition.lettersLimit == 6 && localStats.games < 187) {
    //     localStats.games = 185 + localStats.games;
    //     localStats.won = 185 + localStats.won;
    //     localStats.streak = 16 + localStats.streak;
    //     localStats.maxStreak = 52;
    //     localStats.attempts[1] = 0 + localStats.attempts[1];
    //     localStats.attempts[2] = 8 + localStats.attempts[2];
    //     localStats.attempts[3] = 50 + localStats.attempts[3];
    //     localStats.attempts[4] = 83 + localStats.attempts[4];
    //     localStats.attempts[5] = 37 + localStats.attempts[5];
    //     localStats.attempts[6] = 7 + localStats.attempts[6];
    //     setStats(localStats);
    //     saveToLocalStorage("stats", localStats);
    //   }
    // }

    // Keep track of time and reset once new game is out
    timer = setInterval(() => {
      var lastPlayed = getFromLocalStorage("lastPlayedIssueNumber");
      if (lastPlayed && lastPlayed != getIssueNumber(currentEdition.lettersLimit)) {
        resetGame();
      }
      setTimeLeft(getTimeTillMidnight());
    }, 1000);

    return () => {
      clearInterval(timer);
      timer = null;
    }
  }, [currentEdition]);

  // Save to local storage
  React.useEffect(() => {
    saveToLocalStorage("attempts", attempts);
  }, [attempts]);
  React.useEffect(() => {
    saveToLocalStorage("feedback", feedback);
  }, [feedback]);
  React.useEffect(() => {
    var localStats;
    try {
      localStats = getFromLocalStorage("stats");
    } catch(e) {
      localStats = null
    }
    // Never override valid local stats, only update if new game released or streak was broken
    if (!localStats || localStats.games <= stats.games) {
      saveToLocalStorage("stats", stats);
    }
    settings.shareStats && UID && stats.games > 0 && updateAverageStats(stats);

    // Hide average stats if loaded stats indicate they're not allowed yet
    if (modal == "avg-stats" && stats.games < 10) {
      setModal("stats");
    }
  }, [stats]);
  React.useEffect(() => {
    saveToLocalStorage("result", result);
    if (result != null) {
      setTimeout(() => setModal("stats"), 1000);
    } else {
      setModal(null);
    }

    // Hide stats if loaded game isn't finished
    if (modal == "avg-stats" && !result) {
      setModal(null);
    }
  }, [result]);
  React.useEffect(() => {
    saveToLocalStorage("UID", UID, true);
  }, [UID]);

  // Update theme and save to local storage
  React.useEffect(() => {
    settings.darkTheme ? document.body.classList.add("dark") : document.body.classList.remove("dark");
    settings.colorBlind ? document.body.classList.add("color-blind") : document.body.classList.remove("color-blind");
    saveToLocalStorage("settings", settings, true);
    prevSettings && !prevSettings.shareStats && settings.shareStats && UID && stats.games > 0 && updateAverageStats(stats);
  }, [settings]);

  // Accept keyboard input
  const keyListener = React.useCallback((e) => {
    if ("’йцукенгшщзхїфівапролджєячсмитьбю".includes(e.key)) {
      e.preventDefault();
      enterLetter(e.key.replace("’", "'"));
    } else if (e.code == "Backspace" || e.code == "Delete") {
      e.preventDefault();
      eraseLetter();
    } else if (e.code == "Enter") {
      e.preventDefault();
      checkWord();
    }
  }, [cursor]);

  React.useEffect(() => {
    window.addEventListener("keydown", keyListener);
    return ()=>{
      window.removeEventListener("keydown", keyListener)
    }
  }, [keyListener]);

  function resetGame() {
    // Reset streak if games skipped
    const lastPlayed = getFromLocalStorage("lastPlayedIssueNumber");
    const currentlyPlayed = getIssueNumber(currentEdition.lettersLimit);
    if (lastPlayed && (currentlyPlayed - lastPlayed > 1 || currentlyPlayed - lastPlayed == 1 && getFromLocalStorage("result") == null)) {
      var newStats = {...tryLoadingFromLocalStorage("stats", stats, {skipSetting: true})};
      newStats.streak = 0;
      setStats(newStats);
    }

    setAttempts([]);
    setFeedback([]);
    setResult(null);
    saveToLocalStorage("result", null);
    setCursor({
      attempt: 0, 
      letter: 0
    })
    saveToLocalStorage("lastPlayedIssueNumber", currentlyPlayed);
  }

  function getFromLocalStorage(propName, ignoreLettersLimit=false) {
    if (!ignoreLettersLimit && currentEdition.lettersLimit != 5) {
      propName = `${currentEdition.lettersLimit}_${propName}`;
    }
    return JSON.parse(localStorage.getItem(propName));
  }

  function saveToLocalStorage(propName, obj, ignoreLettersLimit=false) {
    if (!ignoreLettersLimit && currentEdition.lettersLimit != 5) {
      propName = `${currentEdition.lettersLimit}_${propName}`;
    }
    localStorage.setItem(propName, JSON.stringify(obj));
  }

  function tryLoadingFromLocalStorage(propName, obj, options) {
    let loadedObj;
    try {
      loadedObj = getFromLocalStorage(propName, options.ignoreLettersLimit);
    } catch(e) {
      loadedObj = null
      console.log("Failed loading " + propName + " from local storage")
    }
    if (!options.skipSetting) {
      if (loadedObj) {
        // Add missing props from new obj definition
        if (!options.skipUpdating && (typeof obj === 'object') && (obj !== null)) {
          for (var prop in obj) {
            if (obj.hasOwnProperty(prop) && !loadedObj.hasOwnProperty(prop)) {
              loadedObj[prop] = obj[prop]
            }
          }
        }
        options.setter(loadedObj);
      } else if (options.defaultValue || options.defaultValue === null) {
        options.setter(options.defaultValue);
      }
    }
    return loadedObj || options.defaultValue;
  }

  function updateAverageStats(stats) {
    console.log("Запит статистики для гри на " + currentEdition.lettersLimit + " букв...")
    var url;
    if (window.location.href.includes("wordle-ua.net")) {
      url = "https://ukr.warspotting.net/wordle/"
    } else {
      url = "http://127.0.0.1:8000/wordle/"
    }
    const request = new Request(url);
    fetch(request, {
      method: "POST",
      body: JSON.stringify({
        uid: UID,
        edition: currentEdition.lettersLimit,
        played: getIssueNumber(currentEdition.lettersLimit),
        answer: currentEdition.answer(),
        result: result,
        attempt: attempts.length,
        ...stats
      })
    })
    .then(response => response.json())
    .then(data => {
      console.log("Статистику отримано.");
      if (data && Object.keys(data).length > 0) {
        setAverageStats({
          issue: getIssueNumber(currentEdition.lettersLimit),
          ...data
        });
        setAverageStatsLoaded(true);
      }
    })
    .catch((error) => {
      console.error("Помилка при запиті:", error);
      setAverageStatsLoaded(false);
    });
  }

  function getKyivDateTimeIgnoringGMT(date) {
    const kyivTime = date.toLocaleString('uk-UA', { timeZone: 'Europe/Kiev' });
    const kyivTimeComponents = kyivTime.split(/[\s,.:]+/);
    const kyivDate = new Date(Date.UTC(
        kyivTimeComponents[2], 
        kyivTimeComponents[1] - 1, 
        kyivTimeComponents[0], 
        kyivTimeComponents[3], 
        kyivTimeComponents[4], 
        kyivTimeComponents[5]   
    ));
    return kyivDate;
  }

  function getTimeTillMidnight() {
    const kyivDate = getKyivDateTimeIgnoringGMT(new Date());

    const nextMidnight = new Date(kyivDate);
    nextMidnight.setUTCDate(kyivDate.getUTCDate() + 1);
    nextMidnight.setUTCHours(0, 0, 0, 0);

    const msUntilMidnight = nextMidnight - kyivDate;
    const secUntilMidnight = Math.round(msUntilMidnight / 1000);
    
    const hours = Math.floor(secUntilMidnight / 3600);
    const remainingSeconds = secUntilMidnight % 3600;
    const minutes = Math.floor(remainingSeconds / 60);
    const finalSeconds = remainingSeconds % 60;

    const obj = {
      "h": hours < 10 ? "0" + hours : hours,
      "m": minutes < 10 ? "0" + minutes : minutes,
      "s": finalSeconds < 10 ? "0" + finalSeconds : finalSeconds
    };
    return obj;
  }

  function getIssueNumber(editionLettersLimit) {
    // const now = new Date();
    // return now.getMinutes() + 1;
    const firstDay = editions.find(e => e.lettersLimit == editionLettersLimit).firstDay;
    return Math.ceil((getKyivDateTimeIgnoringGMT(new Date())-getKyivDateTimeIgnoringGMT(firstDay))/(1000*60*60*24));
  }
  
  function enterLetter(letter) {
    if ((result == null) && (cursor.attempt < currentEdition.attemptsLimit) && (cursor.letter < currentEdition.lettersLimit)) {
      const newAttempts = [...attempts];
      let newString = newAttempts[cursor.attempt] || "";
      newString += letter;
      newAttempts[cursor.attempt] = newString;
      setAttempts(newAttempts);
      setCursor({attempt: cursor.attempt, letter: cursor.letter+1});
    }
  }

  function eraseLetter() {
    if ((result == null) && (cursor.letter > 0)) {
      const newAttempts = [...attempts];
      newAttempts[cursor.attempt] = attempts[cursor.attempt].substring(0, cursor.letter-1);
      setAttempts(newAttempts);
      setCursor({attempt: cursor.attempt, letter: cursor.letter-1});
      setWrongAttempt(false);
    }
  }

  function provideLetterFeedback(newFeedback) {
    var revealedLetter = 0;
    revealLetter();
    var letterTimer = setInterval(revealLetter, 150);
    function revealLetter() {
      if (revealedLetter < currentEdition.lettersLimit) {
        let letterFeedback = [...newFeedback]
        letterFeedback[letterFeedback.length-1] = newFeedback[newFeedback.length-1].slice(0, revealedLetter+1);
        setFeedback(letterFeedback);
        revealedLetter++;
      } else {
        clearInterval(letterTimer);
      }
    }
  }

  function checkWord() {
    var attempt = attempts[cursor.attempt];
    var answer = currentEdition.answer();

    if ((result == null) && (cursor.attempt < currentEdition.attemptsLimit) && (cursor.letter == currentEdition.lettersLimit)) {
      // Actual word || Easter egg
      if (currentEdition.words(attempt) || (currentEdition.lettersLimit == 5) && (((cursor.attempt == 0) && (attempt == "русні")) || ((cursor.attempt == 1) && (attempts[0] == "русні") && (attempts[1] == "пизда")))) {
        var newResult = null;
        let newFeedback = [...feedback];
        // Solved!
        if (attempt == answer) {
          const feedbackTemplate = []
          for (let i = 1; i <= currentEdition.lettersLimit; i++) {
            feedbackTemplate.push("hit");
          }
          newFeedback.push(feedbackTemplate)
          provideLetterFeedback(newFeedback);
          newResult = "won";
        // Check letters 
        } else {
          let res = Array(currentEdition.lettersLimit).fill("miss");
          // Hits
          [...attempt].map((ltr, i) => {
            if (ltr == answer[i]) {
              res[i] = "hit";
              attempt = attempt.substring(0,i) + "-" + attempt.substring(i+1);
              
              answer = answer.substring(0,i) + "-" + answer.substring(i+1);
            }
          });
          // Letters found
          [...attempt].map((ltr, i) => {
            if ((ltr != "-") && answer.includes(ltr)) {
              res[i] = "found";
              answer = answer.substring(0,answer.indexOf(ltr)) + "-" + answer.substring(answer.indexOf(ltr)+1);
            }
          });
          newFeedback.push(res);
          if (cursor.attempt == currentEdition.attemptsLimit - 1) newResult = "lost";
        }
        provideLetterFeedback(newFeedback);

        // Easter egg
        if ((currentEdition.lettersLimit == 5) && (cursor.attempt == 1) && (attempts[0] == "русні") && (attempts[1] == "пизда")) {
          document.body.classList.add("ukraine");
        }
        
        // Game over
        if (newResult != null) {
          // Don't go over number of issues
          if (stats.games < getIssueNumber(currentEdition.lettersLimit)) {
            let newStats = {...stats};
            newStats.games += 1;    
            if (newResult == "won") {
              newStats.won += 1;
              newStats.streak += 1;
              if (newStats.streak > newStats.maxStreak) newStats.maxStreak = newStats.streak;
              newStats.attempts[cursor.attempt+1] += 1;
            } else {
              newStats.streak = 0;
            }
            setStats(newStats);
          }
          setResult(newResult);
        // Game continues
        } else {
          setCursor({attempt: cursor.attempt+1, letter: 0});
        }
      } else {
        setWrongAttempt(true);
        setMessage({
          msg: "Введіть словниковий іменник",
          tmp: true
        });
      }
    }
  }

  function shareResult() {
    let str = "#укрWordle ";
    if (currentEdition.lettersLimit > 5) {
      str += `${currentEdition.lettersLimit} `;
    }
    str += "№" + getIssueNumber(currentEdition.lettersLimit) + " " + feedback.length + "/" + currentEdition.attemptsLimit + ":";
    feedback.map(attempt => {
      str += "\n";
      attempt.map(res => str += (res=="hit") ? "🟩" : (res=="found") ? "🟨" : "⬜")
    });
    
    let el = document.createElement("textarea");
    el.value = str;
    el.setAttribute("readonly", "");
    el.style.position = "absolute";
    el.style.left = "-9999px";
    document.body.appendChild(el);
    el.select();
    document.execCommand("copy");
    document.body.removeChild(el);

    setMessage({
      msg: "Cкопійовано",
      tmp: true
    });
  }

  function tileStatus(i, j) {
    let tileStatus = null;
    if (feedback[i]) {
      tileStatus = feedback[i][j];
    } else {
      if (i == cursor.attempt) {
        tileStatus = (j < cursor.letter) ? "set" : (j == cursor.letter) && (result == null) ? "active" : "";
      } else {
        tileStatus = "";
      }
    }
    return tileStatus;
  }

  function letterStatus(letter) {
    let letterStatus = null;
    feedback.map((statuses, i) => {
      statuses.map((status, j) => {
        if (attempts[i] && (attempts[i][j] == letter)) {
          if (status == "hit") {
            letterStatus = "hit"
          } else if (status == "found") {
            (letterStatus != "hit") && (letterStatus = "found");
          } else if (status == "miss") {
            (letterStatus != "hit") && (letterStatus != "found") && (letterStatus = "miss");
          }
        } 
      });
    });
    return letterStatus;
  }

  function switchModal(type) {
    setModal(null);
    setTimeout(() => {
      setModal(type);
    }, "100")
  }

  return (
    <React.Fragment>
      <header>
        <h1>Wordle <em>українською</em></h1>

        <div id="russianShip">
          <div></div>
          <span>Російський корабель, йди нахуй</span>
        </div>

        <button id="btn-help" className="icon" aria-label="Як грати?" onClick={() => setModal("help")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path d="M8 15A7 7 0 1 1 8 1a7 7 0 0 1 0 14zm0 1A8 8 0 1 0 8 0a8 8 0 0 0 0 16z"/>
            <path d="M5.255 5.786a.237.237 0 0 0 .241.247h.825c.138 0 .248-.113.266-.25.09-.656.54-1.134 1.342-1.134.686 0 1.314.343 1.314 1.168 0 .635-.374.927-.965 1.371-.673.489-1.206 1.06-1.168 1.987l.003.217a.25.25 0 0 0 .25.246h.811a.25.25 0 0 0 .25-.25v-.105c0-.718.273-.927 1.01-1.486.609-.463 1.244-.977 1.244-2.056 0-1.511-1.276-2.241-2.673-2.241-1.267 0-2.655.59-2.75 2.286zm1.557 5.763c0 .533.425.927 1.01.927.609 0 1.028-.394 1.028-.927 0-.552-.42-.94-1.029-.94-.584 0-1.009.388-1.009.94z"/>
          </svg>
        </button>

        <button id="btn-settings" className="icon" aria-label="Налаштування" onClick={() => setModal("settings")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path fillRule="evenodd" d="M11.5 2a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM9.05 3a2.5 2.5 0 0 1 4.9 0H16v1h-2.05a2.5 2.5 0 0 1-4.9 0H0V3h9.05zM4.5 7a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM2.05 8a2.5 2.5 0 0 1 4.9 0H16v1H6.95a2.5 2.5 0 0 1-4.9 0H0V8h2.05zm9.45 4a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zm-2.45 1a2.5 2.5 0 0 1 4.9 0H16v1h-2.05a2.5 2.5 0 0 1-4.9 0H0v-1h9.05z"/>
          </svg>
        </button>
        
        <div id="selector-editions" className="ml-auto" aria-label="Варіант гри">
          <div className="button icon edition selected">
            {currentEdition.lettersLimit}
            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
              <path d="M7.247 11.14 2.451 5.658C1.885 5.013 2.345 4 3.204 4h9.592a1 1 0 0 1 .753 1.659l-4.796 5.48a1 1 0 0 1-1.506 0z"/>
            </svg>
          </div>
          
          <ul>
            {editions.map((edition) => 
              <li><a className={"edition" + (edition.lettersLimit == currentEdition.lettersLimit ? " selected" : "")} onClick={edition.lettersLimit == currentEdition.lettersLimit ? null : () => setCurrentEdition(edition)}>{edition.lettersLimit}</a></li>
            )}
          </ul>
        </div>
        
        <button id="btn-stats" className="icon" aria-label="Моя статистика" onClick={() => setModal("stats")}>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
            <path d="M4 11H2v3h2v-3zm5-4H7v7h2V7zm5-5v12h-2V2h2zm-2-1a1 1 0 0 0-1 1v12a1 1 0 0 0 1 1h2a1 1 0 0 0 1-1V2a1 1 0 0 0-1-1h-2zM6 7a1 1 0 0 1 1-1h2a1 1 0 0 1 1 1v7a1 1 0 0 1-1 1H7a1 1 0 0 1-1-1V7zm-5 4a1 1 0 0 1 1-1h2a1 1 0 0 1 1 1v3a1 1 0 0 1-1 1H2a1 1 0 0 1-1-1v-3z"/>
          </svg>
        </button>
      </header>

      <main id="board-container">
        <div id="board" className={"letters-" + currentEdition.lettersLimit}>
        {[...Array(currentEdition.attemptsLimit)].map((val, i) =>
          <div key={i} className={"row" + ((wrongAttempt && (cursor.attempt == i)) ? " wrong" : "") }>
          {[...Array(currentEdition.lettersLimit)].map((val, j) =>
            <Tile 
              key={j}
              letter={attempts[i] && attempts[i][j]}
              status={tileStatus(i, j)} />
          )}
          </div>
        )}
        </div>

        { message && <Message 
          message={message.msg}
          tmp={message.tmp}
          handleClose={setMessage} /> }
      </main>

      <footer id="keyboard-container">
        <div id="keyboard">
          <div className="row">
            {[..."йцукенгшщзхї"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
          </div>
          <div className="row">
            {[..."фівапролджє"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
            <button id="backspace" aria-label="Видалити букву" onClick={(e) => { eraseLetter(); e.target.blur() }}>
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                <path d="M5.83 5.146a.5.5 0 0 0 0 .708L7.975 8l-2.147 2.146a.5.5 0 0 0 .707.708l2.147-2.147 2.146 2.147a.5.5 0 0 0 .707-.708L9.39 8l2.146-2.146a.5.5 0 0 0-.707-.708L8.683 7.293 6.536 5.146a.5.5 0 0 0-.707 0z"/>
                <path d="M13.683 1a2 2 0 0 1 2 2v10a2 2 0 0 1-2 2h-7.08a2 2 0 0 1-1.519-.698L.241 8.65a1 1 0 0 1 0-1.302L5.084 1.7A2 2 0 0 1 6.603 1h7.08zm-7.08 1a1 1 0 0 0-.76.35L1 8l4.844 5.65a1 1 0 0 0 .759.35h7.08a1 1 0 0 0 1-1V3a1 1 0 0 0-1-1h-7.08z"/>
              </svg>
            </button>
          </div>
          <div className="row">
            {[..."'ячсмитьбюґ"].map((letter) =>
              <Key
                key={letter}
                letter={letter}
                clickHandler={enterLetter}
                status={letterStatus(letter)} />
            )}
            <button id="enter" aria-label="Перевірити слово" onClick={checkWord}>
              <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                <path d="M12.736 3.97a.733.733 0 0 1 1.047 0c.286.289.29.756.01 1.05L7.88 12.01a.733.733 0 0 1-1.065.02L3.217 8.384a.757.757 0 0 1 0-1.06.733.733 0 0 1 1.047 0l3.052 3.093 5.4-6.425a.247.247 0 0 1 .02-.022Z"/>
              </svg>
            </button>
          </div>
        </div>
      </footer>
      
      { modal && <Modal
        type={modal}
        handleClose={setModal}
        n={getIssueNumber(currentEdition.lettersLimit)}
        stats={stats}
        averageStats={averageStats}
        averageStatsLoaded={averageStatsLoaded}
        settings={settings}
        setSettings={setSettings}
        timeLeft={timeLeft}
        attempt={feedback && feedback.length}
        result={result}
        shareResult={shareResult}
        switchModal={switchModal}
        answer={currentEdition.answer()}
        uid={UID}
        currentEdition={currentEdition}
        setCurrentEdition={setCurrentEdition}
        editions={editions} /> }
    </React.Fragment>
  )
}

function Tile(props) {
  return (
    <div className={"tile" + (props.status ? (" " + props.status) : "")}>{ props.letter }</div>
  )
}

function Key(props) {
  return (
    <button className={props.status}
      onClick={(e) => { props.clickHandler(props.letter); e.target.blur() }}>{ props.letter }</button>
  )
}

function Modal(props) {
  var title;
  var content;

  // Calculating bar heights for league leaderboard graph
  var leagueLeaderboardChart = {
    absMax: 0,
    heights: {},
    secondaryHeights: {},
    myHeight: 0,
    mySecondaryHeight: 0,
    amIn: false,
    hasLoosers: false
  }
  leagueLeaderboardChart.absMax = Math.max(...props.averageStats.league.leaderboard.map(leader => (leader.streak < leader.maxStreak) ? leader.maxStreak : leader.streak));
  if (leagueLeaderboardChart.absMax <= 0 || leagueLeaderboardChart.absMax < props.stats.maxStreak) {
    leagueLeaderboardChart.absMax = props.stats.maxStreak;
  }
  props.averageStats.league.leaderboard.forEach(leader => {
    leagueLeaderboardChart.heights[leader.uid] = leader.streak/leagueLeaderboardChart.absMax*100;
    if (leader.streak < leader.maxStreak) {
      leagueLeaderboardChart.secondaryHeights[leader.uid] = leader.maxStreak/leagueLeaderboardChart.absMax*100;
      leagueLeaderboardChart.hasLoosers = true;
    } else {
      leagueLeaderboardChart.secondaryHeights[leader.uid] = leagueLeaderboardChart.heights[leader.uid]
    }
  });
  leagueLeaderboardChart.myHeight = props.stats.streak/leagueLeaderboardChart.absMax*100;
  if (props.stats.streak < props.stats.maxStreak) {
    leagueLeaderboardChart.mySecondaryHeight = props.stats.maxStreak/leagueLeaderboardChart.absMax*100;
  } else {
    leagueLeaderboardChart.mySecondaryHeight = leagueLeaderboardChart.myHeight;
  }
  leagueLeaderboardChart.amIn = props.averageStats.league.leaderboard.map(leader => leader.uid).includes(props.uid);

  // Calculating bar heights for all time leaderboard graph
  var allTimeLeaderboardChart = {
    absMax: 0,
    heights: {},
    myHeight: 0,
    amIn: false,
  }
  allTimeLeaderboardChart.absMax = Math.max(...props.averageStats.allTimeTop.map(leader => leader.maxStreak));
  if (allTimeLeaderboardChart.absMax <= 0) {
    allTimeLeaderboardChart.absMax = props.stats.maxStreak;
  }
  props.averageStats.allTimeTop.forEach(leader => {
    allTimeLeaderboardChart.heights[leader.uid] = leader.maxStreak/allTimeLeaderboardChart.absMax*100;
  });
  allTimeLeaderboardChart.myHeight = props.stats.maxStreak/allTimeLeaderboardChart.absMax*100;
  allTimeLeaderboardChart.amIn = props.averageStats.allTimeTop.map(leader => leader.uid).includes(props.uid);

  // Calculating average attempt
  var averageAttempt = 0;
  for (const key in props.stats.attempts) {
    averageAttempt += key*props.stats.attempts[key];
  }
  averageAttempt = (props.stats.won > 0) ? Math.round(averageAttempt*100/props.stats.won)/100 : 0;

  // Calculating bar widths for attempts graph
  const comparing = props.type == "avg-stats";
  const myTotal = Object.entries(props.stats.attempts).map(pair => pair[1]).reduce((s, a) => s + a, 0);
  const averageTotal = 1;
  const total = comparing ? Math.max(myTotal, averageTotal) : myTotal;
  const myMax = Math.max(...Object.entries(props.stats.attempts).map(pair => pair[1]));
  const averageMax = comparing ? Math.max(...Object.entries(props.averageStats.attempts).map(pair => pair[1]*total)) : 0;
  const maxAttempts = comparing ? Math.max(myMax, averageMax) : myMax;
  var myGraphWidths = {};
  for (const key in props.stats.attempts) {
    myGraphWidths[key] = props.stats.attempts[key]/maxAttempts*100;
  }
  var avgGraphWidths = {};
  for (const key in props.averageStats.attempts) {
    avgGraphWidths[key] = props.averageStats.attempts[key]*total/maxAttempts*100;
  }

  if (props.type == "help") {
    title = "Як грати?";
    content = <React.Fragment>
      <p><b>Вгадайте слово з шести спроб.</b> Кожна здогадка мусить бути словниковим іменником, але не власною назвою. Після кожної спроби колір підкаже, наскільки близько ви були:</p>

      <dl className="example">
        { (props.currentEdition.lettersLimit == 5) ?
          <dt className="row">
            <div className="tile hit">с</div>
            <div className="tile miss">о</div>
            <div className="tile miss">н</div>
            <div className="tile miss">ц</div>
            <div className="tile miss">е</div>
          </dt> :
          <dt className="row">
            <div className="tile hit">с</div>
            <div className="tile miss">п</div>
            <div className="tile miss">о</div>
            <div className="tile miss">г</div>
            <div className="tile miss">а</div>
            <div className="tile miss">д</div>
          </dt>
        }
        <dd className="small">Буква <b>С</b> є в слові саме в цьому місці</dd>
      </dl>

      <dl className="example">
        { (props.currentEdition.lettersLimit == 5) ?
          <dt className="row">
            <div className="tile miss">ш</div>
            <div className="tile found">т</div>
            <div className="tile miss">а</div>
            <div className="tile miss">н</div>
            <div className="tile miss">и</div>
          </dt> :
          <dt className="row">
            <div className="tile miss">л</div>
            <div className="tile miss">а</div>
            <div className="tile found">т</div>
            <div className="tile miss">у</div>
            <div className="tile miss">н</div>
            <div className="tile miss">ь</div>
          </dt>
        }
        <dd className="small">Буква <b>Т</b> є в слові, але не в цьому місці</dd>
      </dl>

      <dl className="example">
        { (props.currentEdition.lettersLimit == 5) ?
          <dt className="row">
            <div className="tile miss">м</div>
            <div className="tile miss">´</div>
            <div className="tile miss">я</div>
            <div className="tile miss">т</div>
            <div className="tile miss">а</div>
          </dt> :
          <dt className="row">
            <div className="tile miss">о</div>
            <div className="tile miss">б</div>
            <div className="tile miss">’</div>
            <div className="tile miss">ї</div>
            <div className="tile miss">з</div>
            <div className="tile miss">д</div>
          </dt>
        }
        <dd className="small">Жодної з цих букв немає в слові</dd>
      </dl>

      <p>Нове завдання щодня!</p>

      <hr />

      <div className="fade small">
        <p>Оригінальна гра: <a href="https://www.powerlanguage.co.uk/wordle/">WORDLE</a> © Josh Wardle, 2021-22</p>
        { (props.currentEdition.lettersLimit == 5) ?
          <p>Українська адаптація: <a href="https://www.facebook.com/kokokostya/">розробка</a>, <a href="https://www.facebook.com/artem.shevchenko.ukraine">слова</a>.</p>
          : <a href="https://www.facebook.com/kokokostya/">Українська адаптація</a>
        }
        <p>№{ props.n }</p>
      </div>
    </React.Fragment>
  } else if (props.type == "stats") {
    title = "Статистика";
    content = <React.Fragment>
      {
        (props.result == "won") ? <React.Fragment>
          <div id="top-message" className="small hint success"><Congrat attempt={props.attempt} /> Ви вгадали з { props.attempt }-ї спроби. Зможете завтра повторити?</div>
        </React.Fragment> :
        (props.result == "lost") ? <React.Fragment>
          <div id="top-message" className="small hint">Відгадка: <b>{ props.answer.toUpperCase() }</b>. Не засмучуйтесь. Ви добре грали і наступного разу точно вгадаєте.</div>
        </React.Fragment> : null
      }

      <ul id="stats">
        <li>
          <span className="value">{ props.stats.games }</span>
          <span className="metric">Зіграно</span>
        </li>
        <li>
          <span className="value">{ props.stats.won > 0 ? Math.round(1000*props.stats.won/props.stats.games)/10 : 0 }<small>%</small></span>
          <span className="metric">Виграно { props.stats.won }</span>
        </li>
        <li>
          <span className="value">{ props.stats.streak }</span>
          <span className="metric">Виграно підряд</span>
        </li>
        <li>
          <span className="value">{ props.stats.maxStreak }</span>
          <span className="metric">Рекорд підряд</span>
        </li>
      </ul>

      <h3>Виграшні спроби</h3>
      {[...Array(6)].map((val, i) =>
        <GraphBarHorizontal
          key={i}
          num={i+1}
          attemptsCount={props.stats.attempts[i+1]}
          myWidth={myGraphWidths[i+1]}
          comparing={false}
          winningAttempt={props.result == "won" ? props.attempt : null} />
      )}
      
      <h3>
        Наступне слово через
        <span id="timer">
          { props.timeLeft["h"] }:{ props.timeLeft["m"] }
          <span className="small">:{ props.timeLeft["s"] }</span>
        </span>
      </h3>

      {
        ((props.result == "won") || (props.settings.shareStats && props.stats.games >= 10)) &&
        <div id="stats-buttons">
          {
            (props.result == "won") &&
              <button id="btn-share" onClick={props.shareResult}>
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                  <path d="M13.5 1a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zM11 2.5a2.5 2.5 0 1 1 .603 1.628l-6.718 3.12a2.499 2.499 0 0 1 0 1.504l6.718 3.12a2.5 2.5 0 1 1-.488.876l-6.718-3.12a2.5 2.5 0 1 1 0-3.256l6.718-3.12A2.5 2.5 0 0 1 11 2.5zm-8.5 4a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3zm11 5.5a1.5 1.5 0 1 0 0 3 1.5 1.5 0 0 0 0-3z"/>
                </svg>
                Поділитись
              </button> 
          }
          {
            (props.settings.shareStats && props.stats.games >= 10) &&
              <button id="btn-avg-stats" className="rainbow btn-share" onClick={() => props.switchModal("avg-stats")}>
                <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14">
                  <path d="M12.4444 1.55556H10.8889V0H3.11111V1.55556H1.55556C0.7 1.55556 0 2.25556 0 3.11111V3.88889C0 5.87222 1.49333 7.49 3.41444 7.73111C3.90444 8.89778 4.95444 9.77667 6.22222 10.0333V12.4444H3.11111V14H10.8889V12.4444H7.77778V10.0333C9.04556 9.77667 10.0956 8.89778 10.5856 7.73111C12.5067 7.49 14 5.87222 14 3.88889V3.11111C14 2.25556 13.3 1.55556 12.4444 1.55556ZM1.55556 3.88889V3.11111H3.11111V6.08222C2.20889 5.75556 1.55556 4.9 1.55556 3.88889ZM12.4444 3.88889C12.4444 4.9 11.7911 5.75556 10.8889 6.08222V3.11111H12.4444V3.88889Z"/>
                </svg>
                <span>Я молодець?</span>
              </button>
          }
        </div>
      }

      {
        props.settings.shareStats && props.stats.games < 10 && <div className="small hint">Зіграйте <b>{ props.stats.games ? "ще" : null } {10 - props.stats.games} { nTimes(10 - props.stats.games) }</b> щоб побачити, як ви грали порівняно з іншими.</div> 
      }

      <DifferentEdition
        currentEdition={props.currentEdition}
        editions={props.editions}
        setCurrentEdition={props.setCurrentEdition}
        inset={true}
      />
    </React.Fragment>
  } else if (props.type == "avg-stats") {
    title = <React.Fragment>
      <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14">
        <path d="M12.4444 1.55556H10.8889V0H3.11111V1.55556H1.55556C0.7 1.55556 0 2.25556 0 3.11111V3.88889C0 5.87222 1.49333 7.49 3.41444 7.73111C3.90444 8.89778 4.95444 9.77667 6.22222 10.0333V12.4444H3.11111V14H10.8889V12.4444H7.77778V10.0333C9.04556 9.77667 10.0956 8.89778 10.5856 7.73111C12.5067 7.49 14 5.87222 14 3.88889V3.11111C14 2.25556 13.3 1.55556 12.4444 1.55556ZM1.55556 3.88889V3.11111H3.11111V6.08222C2.20889 5.75556 1.55556 4.9 1.55556 3.88889ZM12.4444 3.88889C12.4444 4.9 11.7911 5.75556 10.8889 6.08222V3.11111H12.4444V3.88889Z"/>
      </svg>
      Ви молодець
      <em>Ось як ви грали на тлі інших</em>
    </React.Fragment>

    content = <React.Fragment>
      {
        !props.averageStatsLoaded && <div className="small hint error">❌ Не вдалося завантажити статистику.</div>
      }
      <Metric value={props.averageStats.gamesPercentile}>
        Ви зіграли <b>{ props.stats.games } { nTimes(props.stats.games) } з { props.n }</b>
      </Metric>
      
      { (props.stats.games >= 100) && (props.stats.games/props.n >= .95) && <div className="small hint">🤓 Тепер офіційно: ви — задрот.</div> }
      
      <hr />

      <Metric value={props.averageStats.wonPercentile}>
        Ви вгадали <b>{ props.stats.won > 0 ? Math.round(1000*props.stats.won/props.stats.games)/10 : 0 }<small>%</small> слів</b> <span className="fade nobr small">або { props.stats.won } з { props.stats.games }</span>
      </Metric>
      
      { (props.stats.won/props.stats.games == 1) && (props.stats.games >= 100) && <div className="small hint">😳 В нас одне питання: як???</div> }
      
      <hr />

      <Metric value={props.averageStats.maxStreakPercentile}>
        Ваш рекорд: <b>{ props.stats.maxStreak } { nTimes(props.stats.maxStreak) } підряд</b>
      </Metric>

      <hr />

      <h3>{props.averageStats.league.name}</h3>
      <div className="graph-vertical-container">
        { props.averageStats.league.leaderboard.map((leader) =>
          <GraphBarVertical
            uid={leader.uid}
            pos={leader.pos}
            value={leader.streak}
            myUid={props.uid}
            height={leagueLeaderboardChart.heights[leader.uid]}
            secondaryValue={leader.maxStreak}
            secondaryHeight={leagueLeaderboardChart.secondaryHeights[leader.uid]} />
        )}
        { !leagueLeaderboardChart.amIn && <GraphBarVertical
            uid={props.uid}
            pos={-1}
            value={props.stats.streak}
            myUid={props.uid}
            height={leagueLeaderboardChart.myHeight}
            secondaryValue={props.stats.maxStreak}
            secondaryHeight={leagueLeaderboardChart.mySecondaryHeight} />
        }
      </div>
      
      { leagueLeaderboardChart.hasLoosers && <p className="small fade">Деякі гравці наздоганяють свій минулий рекорд.</p> }

      <hr />

      <h3>Tоп рекордів</h3>
      <div className="graph-vertical-container compact">
        { props.averageStats.allTimeTop.map((leader) =>
          <GraphBarVertical
            uid={leader.uid}
            pos={leader.pos}
            value={leader.maxStreak}
            myUid={props.uid}
            height={allTimeLeaderboardChart.heights[leader.uid]} />
        )}
        { !allTimeLeaderboardChart.amIn && <GraphBarVertical
            uid={props.uid}
            pos={-1}
            value={props.stats.maxStreak}
            myUid={props.uid}
            height={allTimeLeaderboardChart.myHeight} />
        }
      </div>

      { (leagueLeaderboardChart.amIn || allTimeLeaderboardChart.amIn) && (props.stats.streak > 0) && <div className="small hint">🧠 В чому ваш секрет?</div> }
      
      <hr />
      
      <h3>Виграшні спроби</h3>

      <Metric value={props.averageStats.averageAttemptPercentile}>
        В середньому ви вгадували <b>з { averageAttempt }-ї спроби</b>
      </Metric>

      <br />

      <div className="rel">
        <div className="legend small">
          <span className="label my">Ви</span>
          <span className="label others">Інші</span>
        </div>
        {[...Array(6)].map((val, i) =>
          <GraphBarHorizontal
            key={i}
            num={i+1}
            myWidth={myGraphWidths[i+1]}
            averageWidth={avgGraphWidths[i+1]}
            comparing={true}
            winningAttempt={props.result == "won" ? props.attempt : null} />
        )}
      </div>

      { props.averageStatsLoaded && (
          props.stats.games <= 30 && props.stats.attempts[1]/props.stats.won >= .1
          || props.stats.games > 30 && props.stats.games <= 100 && props.stats.attempts[1]/props.stats.won >= .075
          || props.stats.games > 100 && props.stats.attempts[1]/props.stats.won >= .05
        )
        ? <div className="small hint">🧐 {props.stats.attempts[1]} з {props.stats.won} з першої спроби??? Ви часом не чітер?</div> 
        : props.averageStatsLoaded && (
          props.averageStats.gamesPercentile < .5 || 
          props.averageStats.maxStreakPercentile < .5 || 
          leagueLeaderboardChart.myHeight < 10
        ) 
        ? <div className="small hint">😉 Місцями не дуже? Наздоженете! Всі з чогось починали.</div>
        : <hr />
      }

      <p className="small fade">В загальній статистиці не рахуються гравці із менш ніж 10 іграми, аномальними результатами, ті, хто не грав з минулого року, а також ті, хто вимкнув цю опцію <a href="#" onClick={() => props.switchModal("settings")}>в налаштуваннях</a>.</p>

      <DifferentEdition
        currentEdition={props.currentEdition}
        editions={props.editions}
        setCurrentEdition={props.setCurrentEdition}
      />
    </React.Fragment>
  } else if (props.type == "settings") {
    title = "Налаштування";
    content = <React.Fragment>
      <div className="setting">
        <div className="control">
          <label htmlFor="setting-dark-theme">Темна тема</label>
          <input className="switch" type="checkbox" id="setting-dark-theme" checked={props.settings.darkTheme} onChange={() => 
            props.setSettings({
              darkTheme: !props.settings.darkTheme, 
              colorBlind: props.settings.colorBlind, 
              shareStats: props.settings.shareStats})
            } />
        </div>
      </div>

      <div className="setting">
        <div className="control">
          <label htmlFor="setting-color-blind">Режим для дальтоників</label>
          <input className="switch" type="checkbox" id="setting-color-blind" checked={props.settings.colorBlind} onChange={() => 
            props.setSettings({
              darkTheme: props.settings.darkTheme, 
              colorBlind: !props.settings.colorBlind, 
              shareStats: props.settings.shareStats})
            } />
        </div>
      </div>

      <div className="setting">
        <div className="control">
          <label htmlFor="setting-share-stats">Надсилати статистику</label>
          <input className="switch" type="checkbox" id="setting-share-stats" checked={props.settings.shareStats} onChange={() =>
            props.setSettings({
              darkTheme: props.settings.darkTheme, 
              colorBlind: props.settings.colorBlind, 
              shareStats: !props.settings.shareStats
            })
          } />
        </div>
        <p className="small fade">Вимкнувши цю опцію, ви не зможете бачити, як грали порівняно з іншими. Надсилаються лише ваші результати та унікальний ID: <i>{ props.uid }</i></p>
      </div>

    </React.Fragment>
  }

  return ReactDOM.createPortal(
    <div className="overlay">
      <div className={"body" + ((props.type == "avg-stats") ? " avg-stats rainbow" : "")}>
        <header>
          <h2>{ title }</h2>
          <button id="btn-close" className="icon ml-auto" aria-label="Повернутись до гри" onClick={(e) => props.handleClose(null)}>
            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" className="bi bi-x-lg" viewBox="0 0 16 16">
              <path fillRule="evenodd" d="M13.854 2.146a.5.5 0 0 1 0 .708l-11 11a.5.5 0 0 1-.708-.708l11-11a.5.5 0 0 1 .708 0Z"/>
              <path fillRule="evenodd" d="M2.146 2.146a.5.5 0 0 0 0 .708l11 11a.5.5 0 0 0 .708-.708l-11-11a.5.5 0 0 0-.708 0Z"/>
            </svg>
          </button>
        </header>
        <main>{ content }</main>
        { (props.type == "avg-stats") && <footer>
            <a className="" href="https://twitter.com/hashtag/%D1%83%D0%BA%D1%80Wordle">#укр<b>wordle</b></a>
          </footer> 
        }
      </div>
    </div>,
    document.querySelector("#modal"),
  );
}

function Message(props) {
  if (props.tmp) {
    setTimeout(function() {
      props.handleClose();
    }, 3000);
  }

  return(
    <div className={"alert " + (props.tmp && "tmp")}>
      { props.message }
      { !props.tmp && <button id="btn-close" className="icon" aria-label="Закрити повідомлення" onClick={(e) => props.handleClose(null)}>
        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" className="bi bi-x-lg" viewBox="0 0 16 16">
          <path fillRule="evenodd" d="M13.854 2.146a.5.5 0 0 1 0 .708l-11 11a.5.5 0 0 1-.708-.708l11-11a.5.5 0 0 1 .708 0Z"/>
          <path fillRule="evenodd" d="M2.146 2.146a.5.5 0 0 0 0 .708l11 11a.5.5 0 0 0 .708-.708l-11-11a.5.5 0 0 0-.708 0Z"/>
        </svg>
      </button> }
    </div>
  )
}

function DifferentEdition(props) {
  const differentEdition = props.editions.find(e => e.lettersLimit == (props.currentEdition.lettersLimit == 5 ? 6 : 5));
  
  if (differentEdition) {
    return (
      <div id="try-different-edition" className={props.inset && "inset"}>
        <h3>
          <a onClick={(e) => {props.setCurrentEdition(differentEdition); e.target.blur();}}>
            Зіграйте у WORDLE <i className="edition selected">{differentEdition.lettersLimit}</i>
          </a>
        </h3>
        <span className="small fade">{differentEdition.promoMessage}</span>
      </div>
    )
  } 
}

function Congrat(props) {
  var string = ""
  switch(props.attempt) {
    case 1:
      string = "Чітер!";
      break;
    case 2:
      string = "Серйозно???";
      break;
    case 3:
      string = "Неймовірно!";
      break;
    case 4:
      string = "Так тримати!";
      break;
    case 5:
      string = "Непогано.";
      break;
    case 6:
      string = "Фух!";
  }
  return (
  <b>{string}</b>
  )
}

function Metric(props) {
  return (
    <div className="metric">
      <div className="trophy">{ pTrophy(props.value) }</div>
      <div className="standing">
        <div className="small">Краще за</div>
        { Math.round(props.value*1000)/10 }<small>%</small>
        <div className="small">гравців</div>
      </div>
      <div className="desc">{ props.children }</div>
    </div>
  )
}

function GraphBarHorizontal(props) {
  return (
    <div className="graph-horizontal">
      <div className="label">{ props.num }</div>
      <div className="bar-container">
        <div className={"bar" + ((!props.comparing && props.winningAttempt != props.num || props.comparing && props.myWidth == 0) ? " none" : "")} style={(props.comparing || props.myWidth > 5) ? {width: props.myWidth + "%"} : null}>
          { !props.comparing && props.attemptsCount }
        </div>
        { props.comparing && <div className="bar average" style={{width: props.averageWidth + "%"}}></div> }
      </div>
    </div>
  )
}

function GraphBarVertical(props) {
  return (
    <div className="graph-vertical">
      <div className="bar-container">
        <div className={"bar" + (props.uid == props.myUid ? (props.pos > 0 ? "" : " none") : " average")} style={{height: props.height + "%"}}>
          <span className="value">{ props.value }</span>
        </div>
        { (props.secondaryValue > 0) && (props.value != props.secondaryValue) && <div className={"bar secondary" + (props.uid == props.myUid ? (props.pos > 0 ? "" : " none") : " average")} style={{height: props.secondaryHeight + "%"}}>
            <span className="value">{ props.secondaryValue }</span>
          </div> 
        }
      </div>
      <div className={"label" + (props.uid == props.myUid ? " always-show" : "")}>{ props.uid == props.myUid ? "Ви" : "#" + props.pos }</div>
    </div>
  )
}

function nTimes(n) {
  var lastDigit = n % 10;
  if ([11, 12, 13, 14].includes(n % 100)) lastDigit = 5;
  switch (lastDigit) {
    case 1:
      return "раз";
    case 2:
    case 3:
    case 4:
      return "рази";
    default:
      return "разів";
  }
}

function pTrophy(p) {
  if (p >= .99) {
    return "🤯"
  } else if (p >= .95) {
    return "🤌"
  } else if (p >= .9) {
    return "😲"
  } else if (p >= .8) {
    return "🌟"
  } else if (p >= .7) {
    return "💪"
  } else if (p >= .6) {
    return "👍"
  } else if (p >= .5) {
    return "👌"
  } else {
    return "💩"
  }
}

ReactDOM.render(<App />, document.getElementById("app"));